{"name": "Nishkal Hundia", "courses": {"1347620": {"name": "AREC280-0101: Harvesting Big Data to Examine Agriculture and Climate Change-Fall 2023 ljolson", "assignments": {"6397395": {"name": "Introductory Course Survey", "due_at": "2023-08-29T01:00:00Z", "description": "This introductory survey is designed to gather information about student backgrounds and their computing technology. Please complete the survey before 9pm, August 28.  You must complete the survey to receive credit for readiness check-in #1. Ignore individual question points. Readiness check-ins are graded 1 = check-in complete, 0 = check-in not complete. Please answer all questions."}, "6471324": {"name": "Week 1 - Class 2 check-in", "due_at": "2023-08-31T19:15:00Z", "description": "Create an Activity Log for your team and use it to complete the check-in."}, "6471325": {"name": "Week 2 - Class 1 check-in", "due_at": "2023-09-05T19:15:00Z", "description": "Summarize teamwork in Activity Log"}, "6471326": {"name": "Week 2 - Class 2 check-in", "due_at": "2023-09-07T19:15:00Z", "description": "Summarize teamwork in Activity Log"}, "6541374": {"name": "Week 3 - Class 2 Check-In", "due_at": "2023-09-14T19:15:00Z", "description": "to be assigned in class - agricultural productivity, review data wrangling and basic plots"}, "6397398": {"name": "Proposed Fact Sheet Topic Check-In", "due_at": "2023-09-14T18:00:00Z", "description": "Fact Sheet Topic Check-In"}, "6397425": {"name": "Week 4 - Class 1 Check-In", "due_at": "2023-09-19T19:15:00Z", "description": "Assigned in class."}, "6397426": {"name": "Week 5 - Class 1 Check-In", "due_at": "2023-09-26T19:15:00Z", "description": "Assigned in class"}, "6551877": {"name": "Week 5 course feedback check-in", "due_at": "2023-10-03T10:00:00Z", "description": "Complete the Week 5 course feedback survey to receive credit for this check-in. The survey uses the Qualtrics survey tool and you can use the link below to access the survey. You need to complete both pages to receive check-in credit. Page 1 is feedback on the course. Page 2 is feedback for the peer mentors. The due date is 6am, Tuesday, Oct 3. Week 5 feedback survey"}, "6397427": {"name": "Week 6 check-in", "due_at": "2023-10-05T19:15:00Z", "description": "W6C2 CheckIn.pdf"}, "6397428": {"name": "Week 8 - Class 2 check-in", "due_at": "2023-10-19T19:15:00Z", "description": "Assigned in class. See notes under modules W7C2. Due date adjusted to allow more time for teams to complete activity and to accommodate change of schedule caused by classroom relocation. Now due end of class Th, Oct 19."}, "6397430": {"name": "Week 9 - Class 1 check-in", "due_at": "2023-10-24T19:15:00Z", "description": "Assigned in class."}, "6397429": {"name": "Week8 pre-class check-in -- due 6am Thursday -- each student should submit check-in as an entry in your team activity log, ", "due_at": "2023-10-19T10:00:00Z", "description": "At the top of your team activity log list Potential Team Research Topics. Each team member should list their name followed by 2 potential research topics focused on the impact of climate change on agriculture, as in Name: Potential topic #1, Potential topic #2. This is the initial step in brainstorming potential topics. Be creative but also think about what data might be available. Potential data sources are in the course shared data folder or listed on the syllabus. These are not exhaustive and in previous years teams have identified other very interesting data sources for their projects."}, "6397396": {"name": "Research Paper Topic Check-In", "due_at": "2023-10-27T01:00:00Z", "description": "Research paper topic check-in"}, "6397416": {"name": "Week10 - Class2 check-in", "due_at": "2023-11-02T19:15:00Z", "description": "Assigned in class"}, "6397418": {"name": "Week11 - Class2 check-in", "due_at": "2023-11-09T20:15:00Z", "description": "Assigned in class"}, "6397420": {"name": "Week12 - Class2 check-in", "due_at": "2023-11-16T20:15:00Z", "description": "Assigned in class"}, "6397421": {"name": "Week13 check-in", "due_at": "2023-11-30T20:15:00Z", "description": "Assigned in class"}, "6397417": {"name": "Week14 - Class1 check-in", "due_at": "2023-12-05T20:15:00Z", "description": "Assigned in class"}, "6593145": {"name": "Carillon Teamwork Reflection check-in", "due_at": "2023-12-09T04:59:00Z", "description": "These questions ask you to reflect upon the experience of teamwork in this course. Carillon faculty and staff review these reflections carefully--we appreciate your thoughtful and detailed responses!"}, "6570727": {"name": "Search Mastery Check-in", "due_at": "2023-10-25T03:59:59Z", "description": null}, "6564232": {"name": "Search Mastery Module 1 Review Activities", "due_at": "2023-10-20T10:00:00Z", "description": "Use what you learned in this module to complete the following questions. Once you're done, click \"Finish\" and compare the provided answers to what you wrote."}, "6564234": {"name": "Search Mastery Module 2 Review Activities", "due_at": "2023-10-20T10:00:00Z", "description": "Use what you learned in this module to complete the following questions. When you're done, click \"Finish\" and compare the provided answers to what you wrote."}, "6564233": {"name": "Search Mastery Module 3 Review Activities", "due_at": "2023-10-20T10:00:00Z", "description": "Use what you learned in this module to complete the following questions. When you're done, click \"Finish\" and compare the provided answers to what you wrote."}, "6564231": {"name": "Search Mastery Module 4 Review Activities", "due_at": "2023-10-20T10:00:00Z", "description": "Use what you learned in this module to complete the following questions. When you're done, click \"Finish\" and compare the provided answers to what you wrote."}, "6397399": {"name": "DataCamp - Week 1", "due_at": "2023-09-05T10:00:00Z", "description": "Complete the DataCamp tutorials: Introduction to Data Literacy - all chapters (4100 XP) Introduction to Data Ethics - all chapters (2250 XP) Introduction to Importing Data in R - chs. 1-3 (through Importing data from Excel into R - 2750 XP) Try to complete at least some of this before Thursday 8/31. The How to import data into R tutorial may also be helpful. To receive credit for the assignment you must earn at least 6825 XP for these chapters (at least 75% of 9100=4100+2250+2750). If you earn less than 6825 XP you can make up the difference by earning additional XP in the tutorial: Introduction to Data (2100 XP) You only need to earn enough additional XP so that your total XP for the week is at least 6825 XP. Once you have earned more than 6825 XP on the assigned DataCamp chapters, you have completed the assignment, but you should finish the assigned chapters so you learn the material. The assignment is due Tuesday at 6am. Don't leave it to the last minute as some coding exercises may take longer than you expect."}, "6397400": {"name": "DataCamp - Week 2", "due_at": "2023-09-12T10:00:00Z", "description": "Complete the following DataCamp courses/chapters: Introduction to the Tidyverse (all chapters) Introduction to Statistics in R, Ch. 1 - Summary Statistics To receive credit for the assignment you must earn at least 3750 XP out of 5000 possible XP for these chapters (at least 75%). Important: Note your XP before you begin the tutorials for the week. Click on the \"My Account\" icon in the top upper right and note your total XP . This will allow you to keep track of the XP earned during the week by checking \"My Account\" and calculating the difference between the current value and the XP you started the week with. If you earn less than 3750 XP you can make up the difference by earning additional XP in the tutorials: Data Manipulation with dplyr: Ch 1. Transforming Data with dplyr Reshaping Data with tidyr, Ch. 1 - Tidy Data You only need to earn enough additional XP so that your total XP for the week is at least 3750 XP. Once you have completed the assignment feel free to work through any or all remaining parts of the chapters. The practice you gain by doing so is one of the best ways to learn R. The assignment is due Tuesday at 6am."}, "6397401": {"name": "DataCamp - Week 3", "due_at": "2023-09-19T10:00:00Z", "description": "Complete the following DataCamp tutorials: Reshaping Data with tidyr, Chapter 2 - From Wide to Long and Back (1300XP) Data Storytelling Concepts (course - 3150XP) Introduction to Data Visualization with ggplot2 (course - 4300XP) To receive credit for the assignment you must earn at least 6562 XP out of 8750 possible XP for these chapters (at least 75%). Important: Note your XP before you begin the tutorials for the week. Click on the \"DataCamp\" icon in the upper left to go to Home. Then click the \"My Account\" tab in the top bar and note your total XP . This will allow you to keep track of the XP earned during the week by checking \"My Account\" and calculating the difference between the current value and the XP you started the week with. If you earn less than 6562 XP you can make up the difference by earning additional XP in the tutorials: Communicating with Data in the Tidyverse, Chapter 1 – Custom ggplot2 Themes Communicating with Data in the Tidyverse, Chapter 2 – Creating a Custom and Unique Visualization You only need to earn enough additional XP so that your total XP for the week is at least 6562 XP. Once you have completed the assignment feel free to work through any or all remaining parts of the chapters. The practice you gain by doing so is one of the best ways to learn R. The assignment is due Tuesday at 6am."}, "6397402": {"name": "DataCamp - Week 4", "due_at": "2023-09-26T10:00:00Z", "description": "Complete the following DataCamp tutorials: Joining Data with dplyr, Chapter 1 – Joining Tables Joining Data with dplyr, Chapter 2 – Left and Right Joins Joining Data with dplyr, Chapter 3 – Full, Semi, and Anti Joins To receive credit for the assignment you must earn at least 2250 XP out of 3000 possible XP for these chapters (at least 75%). Important: Note your XP before you begin the tutorials for the week. Click on the \"DataCamp\" icon in the upper left to go to Home. Then click the \"My Account\" tab in the top bar and note your total XP . This will allow you to keep track of the XP earned during the week by checking \"My Account\" and calculating the difference between the current value and the XP you started the week with. If you earn less than 2250 XP you can make up the difference by earning additional XP in the tutorial: Joining Data with dplyr, Chapter 4 – Case Study: Joins on Stack Overflow Data You only need to earn enough additional XP so that your total XP for the week is at least 2250 XP. Once you have completed the assignment feel free to work through any or all remaining parts of the chapters. The practice you gain by doing so is one of the best ways to learn R. The assignment is due Tuesday at 6am."}, "6397403": {"name": "DataCamp - Week 5", "due_at": "2023-10-03T10:00:00Z", "description": "Complete the following DataCamp chapters: Modeling with Data in the Tidyverse - Introduction to Modeling (1000XP) Modeling with Data in the Tidyverse - Modeling with Basic Regression (950XP) Modeling with Data in the Tidyverse - Modeling with Multiple Regression (950XP) Introduction to Regression in R - Simple Linear Regression (800XP) To receive credit for the assignment you must earn at least 2775 XP out of 3700 possible XP for the chapters (at least 75%). Important: Note your XP before you begin the tutorials for the week. Click on the \"DataCamp\" icon in the upper left to go to Home. Then click the \"My Account\" tab in the top bar and note your total XP . This will allow you to keep track of the XP earned during the week by checking \"My Account\" and calculating the difference between the current value and the XP you started the week with. If you earn less than 2775 XP you can make up the difference by earning additional XP in these chapters: Modeling with Data in the Tidyverse - Model Assessment and Selection (1000XP) Introduction to Regression in R - Predictions and Model Objects (1250XP) You only need to earn enough additional XP so that your total XP for the week is at least 2775 XP. Once you have completed the assignment feel free to work through any or all remaining parts of the chapters. The practice you gain by doing so is one of the best ways to learn R. The assignment is due Tuesday at 6am."}, "6397404": {"name": "DataCamp - Week 6", "due_at": "2023-10-12T10:00:00Z", "description": "Complete the following DataCamp course (all 4 chapters): Visualizing Geospatial Data in R, Chapter 1 – Basic Mapping with ggplot2 and ggmap Visualizing Geospatial Data in R, Chapter 2 -- Point and Polygon Data Visualizing Geospatial Data in R, Chapter 3 – Raster Data and Color Visualizing Geospatial Data in R, Chapter 4 – Data Import and Projections To receive credit for the assignment you must earn at least 3750 XP out of 5000 possible XP for these chapters (at least 75%). Important: Note your XP before you begin the tutorials for the week. Click on the \"DataCamp\" icon in the upper left to go to Home. Then click the \"My Account\" tab in the top bar and note your total XP . This will allow you to keep track of the XP earned during the week by checking \"My Account\" and calculating the difference between the current value and the XP you started the week with. If you earn less than 3750 XP you can make up the difference by earning additional XP in the tutorials: Analyzing Census Data in R, Chapter 3 - US Census Geographic Data in R Analyzing Census Data in R, Chapter 4 - Mapping US Census Data You only need to earn enough additional XP so that your total XP for the week is at least 3185 XP. Once you have completed the assignment feel free to work through any or all remaining parts of the chapters. The practice you gain by doing so is one of the best ways to learn R. The assignment is due Thursday at 6am . Note the due date is Thursday (not Tuesday)."}, "6397408": {"name": "Fact Sheet", "due_at": "2023-10-10T10:00:00Z", "description": "Fact sheet on agricultural productivity and climate change Individual research project (not a team project) A clear, concise, informative, factual summary of a selected inquiry into the impact of climate change and/or extreme weather on agriculture/agricultural productivity 2 pages (see sample fact sheets on ELMS for examples) includes scientific facts, evidence, or analysis from refereed scientific journals includes supporting data, analysis of data or data visualizations to present information in an intuitive and convincing manner references must be provided for sources of data and other information, cited in the fact sheet itself (see sample fact sheets on ELMS for formatting examples) reference at least 2 sources indexed in the Web of Science and not listed in syllabus readings. Use an asterisk (*) in front of the citation to designate which references are indexed in the Web of Science. images may be used with appropriate acknowledgement of the source writing should be clear, concise and factual do not include code in your fact sheet. Submit supporting code (if any) separately in a subfolder of your team folder under your name, as in: Team folder/Student folder/Student_name_fact_sheet_code.R. pdf submission on ELMS Fact sheets will be evaluated according to the rubric provided with the Fact Sheet Assignment on the Assignments page in ELMS. A Modules section on ELMS menu contains sample fact sheets. A Panopto Recording on ELMS contains tips on using Web of Science Fact sheets should be submitted to ELMS as a pdf upload.  Submissions must be in pdf format. Fact sheets are due by Oct 10 at 6am."}, "6397412": {"name": "Research Paper", "due_at": "2023-11-29T04:59:59Z", "description": "Upload your research paper in pdf format. A rubric and formatting guidelines are available under Modules: Research Paper. In your Team shared folder create an individual folder with your name as the folder name. In this folder place a copy of all code used to create the visualizations and results that are included in your paper, both those in your paper and those in the up to 3 pages of supplementary tables and visualizations. Your code should be capable of replicating your results and visualizations so any data used should be in the course shared folder, your team folder, or your individual folder and the working directories/paths used to load the data in your code should point correctly to the data."}, "6515794": {"name": "Carillon Showcase", "due_at": "2023-12-05T00:00:00Z", "description": null}, "6397413": {"name": "Research Poster", "due_at": "2023-12-08T17:01:00Z", "description": "Poster rubric See poster guidelines and submission information in ELMS: Modules: Week 14: Week14 - Class2"}, "6397414": {"name": "Research Poster Presentation", "due_at": "2023-12-15T17:30:00Z", "description": "Points are based on evaluations of your oral poster presentations during the final exam poster presentation session. You may use flash cards or index cards with notes for your presentation. Presentation rubric"}, "6397410": {"name": "Peer Assessments", "due_at": "2023-12-09T04:59:59Z", "description": "This is a placeholder to record peer evaluations of each student's contributions to their team in Canvas."}, "6397411": {"name": "Peer evaluation of your teammates", "due_at": "2023-12-09T01:00:00Z", "description": "Please complete the online: Peer Evaluation Survey"}}, "files": {}}, "1353207": {"name": "ASTR100-0101,0102,0103,0104,0105,0106: Introduction to Astronomy-Fall 2023 diemer", "assignments": {"6448781": {"name": "Unit 1 Quiz", "due_at": "2023-09-12T03:59:59Z", "description": "Before taking this quiz, please make sure to review the lecture material and the following sections in OpenStax astronomy: Section 1 Section 2.1 Appendix C Appendix D You have two attempts on this quiz. If you're still not satisfied with your score, you may unlock a third attempt by coming to office hours to discuss the material (see syllabus for details)."}, "6448789": {"name": "Unit 2 Quiz", "due_at": "2023-09-19T03:59:59Z", "description": "Before taking this quiz, please make sure to review the lecture material and the following sections in OpenStax astronomy: Section 2.2 Section 2.4 Section 3.1-3.5 You have two attempts on this quiz. If you're still not satisfied with your score, you may unlock a third attempt by coming to office hours to discuss the material (see syllabus for details)."}, "6448786": {"name": "Unit 3 Quiz", "due_at": "2023-09-26T03:59:59Z", "description": "Before taking this quiz, please make sure to review the lecture material and the following sections in OpenStax astronomy: Section 4.1-4.3 Section 4.5-4.7 Section 8.1 Section 8.3 Section 8.5 You have two attempts on this quiz. If you're still not satisfied with your score, you may unlock a third attempt by coming to office hours to discuss the material (see syllabus for details)."}, "6448784": {"name": "Unit 4 Quiz", "due_at": "2023-09-26T03:59:59Z", "description": "Before taking this quiz, please make sure to review the lecture material and the following sections in OpenStax astronomy: Section 5 Section 6.1 You have two attempts on this quiz. If you're still not satisfied with your score, you may unlock a third attempt by coming to office hours to discuss the material (see syllabus for details)."}, "6448787": {"name": "Unit 5 Quiz", "due_at": "2023-10-10T03:59:59Z", "description": "Before taking this quiz, please make sure to review the lecture material and the following sections in OpenStax astronomy: Section 7.3 Section 9.1-2 Section 9.5 Section 10.1 Section 11.2 Section 14.5 You have two attempts on this quiz. If you're still not satisfied with your score, you may unlock a third attempt by coming to office hours to discuss the material (see syllabus for details)."}, "6448780": {"name": "Unit 6 Quiz", "due_at": "2023-10-17T03:59:00Z", "description": "Before taking this quiz, please make sure to review the lecture material and the following sections in OpenStax astronomy: 11.1 12.2-3 13.1-2 14.2 You have two attempts on this quiz. If you're still not satisfied with your score, you may unlock a third attempt by coming to office hours to discuss the material (see syllabus for details)."}, "6448785": {"name": "Unit 7 Quiz", "due_at": "2023-10-24T03:59:59Z", "description": "Before taking this quiz, please make sure to review the lecture material and the following sections in OpenStax astronomy: 15.3-4 17.3-4 18.1-2 You have two attempts on this quiz. If you're still not satisfied with your score, you may unlock a third attempt by coming to office hours to discuss the material (see syllabus for details)."}, "6448779": {"name": "Unit 8 Quiz", "due_at": "2023-10-31T03:59:59Z", "description": "Before taking this quiz, please make sure to review the lecture material and the following sections in OpenStax astronomy: 18.4 21.1 22.1 22.4 23.2 You have two attempts on this quiz. If you're still not satisfied with your score, you may unlock a third attempt by coming to office hours to discuss the material (see syllabus for details)."}, "6448776": {"name": "Unit 9 Quiz", "due_at": "2023-11-07T04:59:00Z", "description": "Before taking this quiz, please make sure to review the lecture material and the following sections in OpenStax astronomy: 23.1 23.4-5 24.5-7 You have two attempts on this quiz. If you're still not satisfied with your score, you may unlock a third attempt by coming to office hours to discuss the material (see syllabus for details)."}, "6448782": {"name": "Unit 10 Quiz", "due_at": "2023-11-14T04:59:59Z", "description": "Before taking this quiz, please make sure to review the lecture material and the following sections in OpenStax astronomy: 21.4-5 30.1-3 You have two attempts on this quiz. If you're still not satisfied with your score, you may unlock a third attempt by coming to office hours to discuss the material (see syllabus for details)."}, "6448788": {"name": "Unit 11 Quiz", "due_at": "2023-11-28T04:59:59Z", "description": "Before taking this quiz, please make sure to review the lecture material and the following sections in OpenStax astronomy: 25.1-3 26.2 28.3-4 You have two attempts on this quiz. If you're still not satisfied with your score, you may unlock a third attempt by coming to office hours to discuss the material (see syllabus for details)."}, "6448783": {"name": "Unit 12 Quiz", "due_at": "2023-12-08T04:59:59Z", "description": "Before taking this quiz, please make sure to review the lecture material and the following sections in OpenStax astronomy: 26.4-5 29.1-4 You have two attempts on this quiz. If you're still not satisfied with your score, you may unlock a third attempt by coming to office hours to discuss the material (see syllabus for details)."}, "6448810": {"name": "Project 1: Lesson for Kids ", "due_at": "2023-10-03T03:59:59Z", "description": "For this assignment, you are going to choose one of the following concepts: moon phases seasons eclipses Your task is to create a short lesson to teach kids (assume they are in grades 3-5) about your chosen concept. To do so, please create a video that is at least three minutes long. This video must include both a video feed of yourself, audio of yourself, and some form of visual aid that helps you explain the concept. The visual aid can be anything of your choosing, with possibilities including a slide show, background video, or physical demonstration (similar to those used in lecture). If you happen to have a kid or kids in your life, your submission can be you actually teaching them the lesson, if you want, but this is not required. Please submit both your video and your background visual aid together on Canvas. You may upload the video in any commonly used format (see below for further information). Please also upload a link to or file of your slideshow, background video, or photos of your physical demonstration if you use one. If you use images, videos, or content from books or the web, please cite your sources within your uploaded material for the visual aid. How to Submit Your Lesson To upload your video, you can either upload the file directly or upload it to YouTube as an \"unlisted\" video (that means that only those who have the direct link can view it) and post that link to this assignment. If you use Google docs for your slideshow or other visual aid , when you click \"Share\", click the option to \"Change to anyone with the link\" before copying the link, otherwise the TAs and I won't be able to view it. Or you can download the file and upload it to Canvas. If you make a physical display (demo) , photograph it in a way that the TAs and I can easily see everything, and please don't upload full resolution images to Canvas (they appear huge, and that makes it difficult to grade). Have fun with this!"}, "6448811": {"name": "Project 2: Presentation about an astronomer", "due_at": "2023-11-21T04:59:59Z", "description": "For this second project, you're going to prepare a 3-5 minute presentation about a famous astronomer (living or deceased). It is entirely up to you who you choose (with some exceptions, see \"Resources\"). While astronomy has historically not done great in the diversity department, I encourage you to pick a woman and/or person of color to lift up those voices (you can find a list of options under \"Resources\"). Please r ead all of the tabs below for instructions and resources. Overview Examples and Rubric Instructions Resources Choose an astronomer who we talked about in class, who you heard about elsewhere, from the resource guides, from the list under the \"Resources\" tab, or from any other source. Research the astronomer, focusing mainly on their journey of becoming a scientist, but also including a brief summary of the work they did/have done as a scientist (remember, the point is you're talking to kids). Please cite your sources on your visual aids. Create a 3-minute presentation aimed at the 6th-12th grade range (absolute max time is 5 minutes). We're pretending here that you're practicing your presentation for your cohort, so that you can give each other feedback and help prepare you for your presentation to the kids. Here is the grading rubric for this assignment: If you are uncomfortable sharing video of yourself, it is still possible to score highly on this assignment, but you will need to do a really good job on your visual aids. Similarly, if you don't do visual aids, it's still possible to score Explorer level. The best presentations (the ones that keep the attention of kids the most) are the ones where the audience can both see and hear you AND you have visual aids that are engaging, but don't require the audience to read much (they should be listening to you, not reading; the best slides are mostly pictures). Below are some examples for which Prof. Katie Berryhill (who designed this assignment) used Dr. Neil deGrasse Tyson, director of the Hayden Planetarium in New York City. As a result, you may NOT choose him for your presentation (see \"Resources\"). Watch the first example video to learn about him, and then just scan the others to see why they decrease in quality (and would receive lower grades). Presenter audio & video, more graphical visual aids Presenter audio only, more graphical visual aids Presenter audio and video, more textual visual aids Presenter audio and video only, no/minimal visual aids Presenter audio only, very text based visual aids Presenter audio only, no visual aids You can record your video using any software, and if you don't have a webcam I recommend utilizing the UMD One Button Studios ( https://faculty.umd.edu/1button-studios ). The following instructions are for recording on Flipgrid which you can access at https://info.flipgrid.com (but again, any other software is fine). Please log in using your UMD credentials. If you are accessing Flipgrid, only Google Chrome or Microsoft Edge browsers on computers (not phones) will have the Share Screen option. When you're ready to record on a computer or phone with a camera, login to Flipgrid using your UMD credentials. Click the red button that says \"Record a response\". Click Options, and you'll have the option to upload a clip that you recorded elsewhere, record with mic only, mirror the video (so the video won't be flipped), share screen (so you can share slides, and you'll be able to choose a window, tab, or the entire screen), and device settings (to select the camera and mic). Click the record button, and you'll get a countdown before it starts to record. If you want to record video of yourself AND your screen, start by clicking the record button Click Options Click Record screen Click Start screen recording Select Entire screen (that's the only way it'll record both) Click Share (the video of you should pop down to the bottom right corner, and then you can bring whatever app you're using for your visual aids forward and begin your presentation) NOTE: If you're trying to record both your video and your screen, and you don't see the video of you in the bottom right corner of your screen, try this: Cancel the recording Confirm that you want to stop Start recording again, but immediately click the \"Retake\" button on the left side of the screen Click Confirm when it asks if you're sure you want to delete the clip You'll see a trash can, and it'll say \"You got this. Try again.\" Restart the process above, and it should work properly (I've tried this a bunch of times.) When you're done, return to your browser window to stop recording. You'll be able to check it over after you record and edit before you post. You can trim the beginning and end of the video, add stickers, etc. When you're ready to post, click Next. Flipgrid will prompt you to take a selfie as the thumbnail for your video. Click Next again. After it uploads, you can type in your name and title your video (use your astronomer subject's name as your title). Please place a link to your Flipgrid video in the submission window on Canvas. This page provides additional help in choosing and researching \"your\" astronomer. First, you are free to choose any astronomer, but they a) must primarily be an astronomer and not a physicist and b) must not have been thoroughly covered in class. This means that you MAY NOT CHOOSE the following scientists: Neil deGrasse Tyson (because example videos are about him) Carl Sagan (because he's just too famous) Plato Aristotle Aristarchus Eratosthenes Ptolemy Nicholas Copernicus Tycho Brahe Johannes Kepler Galileo Galilei Isaac Newton (primarily physicist) Albert Einstein (primarily physicist) Stephen Hawking (primarily physicist) If you are unsure whether the scientist you have chosen would qualify, please confirm with your TA. If you would like to make your presentation about a non-white-dude astronomer, the following (incomplete) list might be a good starting point: Aaron S. Evans (20th/21st century African-American) Abd Al-Rahman Al Sufi (1st century Persian) Akimasa Nakamura (20th/21st century Japanese) Ali al-Qushji (14th century Timurid) Alphonse Sterling (20th/21st century African-American) Amy Mainzer (20th/21st century American) Andrea Ghez (20th/21st century American) Annie Jump Cannon (19th/20th century American) Antonia Maury (19th/20th century American Aomawa Shields (20th/21st century African-American) Arthur Walker, Jr. (20th/21st century African-American) Asada Goryu (18th century Japanese) Barbara Williams (20th/21st century African-American) Beatrice Tinsley (20th century New Zealander) Beth Brown (20th/21st century African-American) Caroline Herschel (18th/19th century German) Carolyn Porco (20th/21st century American) Carolyn Shoemaker (20th/21st century American) Cecilia Payne-Gaposchkin (20th century American) Chanda Prescod-Weinstein (20th/21st century American) Charles McGruder III (20th/21st century African-American) Charles E. Woodward (20th/21st century African-American) Debra Fischer (20th/21st century American) Derek Pitts (20th/21st century African-American) E. Margaret Burbidge (20th/21st century British-American) Eleanor Helin (20th/21st century American) France A. Córdova (20th/21st century Latina-American) Gabriela González (20th/21st century Latina-American) George R. Carruthers (20th/21st century African-American) Gibor Basri (20th/21st century African-American) Guo Shoujing (13th/14th century Chinese) Heide Hammel (20th/21st century American) Helen Sawyer Hogg (20th century American) Henrietta Swan Levitt (19th/20th century American) Ibn al-Shatir (14th century Arab) Ingrid van Houten-Groeneveld (20th/21st century Dutch) Jill Tarter (20th/21st century American) Jocelyn Bell (20th/21st century British) John Asher Johnson (20th/21st century African-American) Jorge Moreno Soto (20th/21st century Latino-American) Kiyotsugu Hirayama (19th/20th century Japanese) Leonard Strachan, Jr. (20th/21st century African-American) Lyudmila Chernykh (20th/21st century Russian) Mae Jemison (20th/21st century African-American) Margaret Geller (20th/21st century American) Maria Mitchell (19th century American) Mary W. Jackson (20th/21st century African-American) Mary Somerville (18th/19th century Scottish) Nancy Grace Roman (20th/21st century American) Omar Khayyam (11th/12th century Persian) Paris Pismis (20th century Mexican) Reva K. Williams (20th/21st century African-American) Ruby Violet Payne-Scott (20th century Australian) Sally Ride (20th/21st century American) Sandra Faber (20th/21st century American) Shen Kuo (11th century Chinese) Su Song (11th century Chinese) Subramanyan Chandrasekhar (20th century Indian-American) Tadashi Nakajima (20th/21st century Japanese) Vera Rubin (20th/21st century American) Williamina Fleming (19th/20th century Scottish-American) But remember, you can choose any astronomer (living or dead) except those listed above! The following resource guides (by Andrew Fraknoi ) might help you get a jumpstart on your research: Black lives in astronomy Women in astronomy The astronomy of many cultures"}, "6448818": {"name": "Lecture 2", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6448819": {"name": "Lecture 3", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6448820": {"name": "Lecture 4", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6541337": {"name": "Lecture 5", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6541338": {"name": "Lecture 6", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6546194": {"name": "Lecture 7", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6546195": {"name": "Lecture 8", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6552576": {"name": "Lecture 9", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6552577": {"name": "Lecture 10", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6558200": {"name": "Lecture 11", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6558199": {"name": "Lecture 12", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6563604": {"name": "Lecture 13", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6563605": {"name": "Lecture 14", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6567124": {"name": "Lecture 15", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6567125": {"name": "Lecture 16", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6572820": {"name": "Lecture 17", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6572821": {"name": "Lecture 18", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6575545": {"name": "Lecture 19", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6575547": {"name": "Lecture 20", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6581059": {"name": "Lecture 21", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6581062": {"name": "Lecture 22", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6586637": {"name": "Lecture 23", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6586639": {"name": "Lecture 24", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6586638": {"name": "Lecture 25", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6448797": {"name": "Discussion Section 1", "due_at": null, "description": "Enter your response to the task assigned during the discussion section by your TA."}, "6541340": {"name": "Discussion Section 2", "due_at": null, "description": "Enter your response to the task assigned during the discussion section by your TA."}, "6546197": {"name": "Discussion Section 3", "due_at": null, "description": "Enter your response to the task assigned during the discussion section by your TA."}, "6552578": {"name": "Discussion Section 4", "due_at": null, "description": "Enter your response to the task assigned during the discussion section by your TA."}, "6558202": {"name": "Discussion Section 5", "due_at": null, "description": "Enter your response to the task assigned during the discussion section by your TA."}, "6563606": {"name": "Discussion Section 6", "due_at": null, "description": "Enter your response to the task assigned during the discussion section by your TA."}, "6571543": {"name": "Discussion Section 8", "due_at": null, "description": "Enter your response to the task assigned during the discussion section by your TA."}, "6572822": {"name": "Discussion Section 9", "due_at": null, "description": "Enter your response to the task assigned during the discussion section by your TA."}, "6575548": {"name": "Discussion Section 10", "due_at": null, "description": "Enter your response to the task assigned during the discussion section by your TA."}, "6581064": {"name": "Discussion Section 11", "due_at": null, "description": "Enter your response to the task assigned during the discussion section by your TA."}, "6586642": {"name": "Discussion Section 12", "due_at": null, "description": "Enter your response to the task assigned during the discussion section by your TA."}, "6549987": {"name": "Midterm 1 (multiple choice)", "due_at": null, "description": null}, "6551874": {"name": "Midterm 1 (short answer)", "due_at": null, "description": null}, "6572630": {"name": "Midterm 2 (multiple choice)", "due_at": null, "description": null}, "6572809": {"name": "Midterm 2 (short answer)", "due_at": null, "description": null}, "6601068": {"name": "Final (multiple choice)", "due_at": null, "description": null}, "6601069": {"name": "Final (short answer)", "due_at": null, "description": null}, "6448778": {"name": "Midterm 1 practice quiz", "due_at": null, "description": null}, "6567062": {"name": "Midterm 2 practice quiz", "due_at": null, "description": null}, "6591752": {"name": "Final practice quiz", "due_at": null, "description": null}, "6593788": {"name": "Lecture 26", "due_at": null, "description": "Please enter your response to the question(s) posted in class, or upload images of your hand-written responses."}, "6593801": {"name": "Discussion Section 13", "due_at": null, "description": "Enter your response to the task assigned during the discussion section by your TA."}}, "files": {}}, "1358850": {"name": "CMSC216-0201,0202,0203,0204,0205,0206,0207,0208: Introduction to Computer Systems-Spring 2024 nelson", "assignments": {}, "files": {}}, "1368158": {"name": "CMSC250-0301,0302,0303,0304,0305,0306,0307,0308,0401,0402,0403,0404,0405,0406,0407,0408: Discrete Structures-Fall 2024 fpe", "assignments": {}, "files": {"79633841": {"display_name": "equivalencies.pdf", "url": "https://umd.instructure.com/files/79633841/download?download_frd=1&verifier=egQE8KbZ0YIBTAPYYTeKZc8OYEsCxj3q5lSwSHpC"}, "79374603": {"display_name": "hw01.pdf", "url": "https://umd.instructure.com/files/79374603/download?download_frd=1&verifier=p5eUl4AGqH3k9SulrgelJ4UVe5gDlKDgg0pkD9Fc"}, "79718567": {"display_name": "hw01.pdf", "url": "https://umd.instructure.com/files/79718567/download?download_frd=1&verifier=YBXYqbFzzHAFDCpvnXjbvXSTJR4rgtApWrc8nWGN"}, "79374594": {"display_name": "hw01Solutions.pdf", "url": "https://umd.instructure.com/files/79374594/download?download_frd=1&verifier=uC4XCzieBvoiWsb52L1xWf7VRVjnV9ldbH8DNeV2"}, "79895588": {"display_name": "hw01Solutions.pdf", "url": "https://umd.instructure.com/files/79895588/download?download_frd=1&verifier=2mwz3mqNSSbdB38bnjBN5rCwSqkVq7YAJVgke1kR"}, "79374590": {"display_name": "hw02.pdf", "url": "https://umd.instructure.com/files/79374590/download?download_frd=1&verifier=lLaAE1JuCuX3QVsVKdHgErecJh6skOel7vSjQ80t"}, "79851027": {"display_name": "hw02.pdf", "url": "https://umd.instructure.com/files/79851027/download?download_frd=1&verifier=ZKUEuQE0UJJ1MjQhiTpjPQl4AIhPcNWXPInL5w3t"}, "79374593": {"display_name": "hw02Solutions.pdf", "url": "https://umd.instructure.com/files/79374593/download?download_frd=1&verifier=JO8VBGrVSl8sEJbRCJ00HK1JZOcwErRui0ea0MLN"}, "79374602": {"display_name": "hw03.pdf", "url": "https://umd.instructure.com/files/79374602/download?download_frd=1&verifier=Q1IDGJWhk6iE4rpOoT3oWLCJVg5mJzLt6ZYZDvLu"}, "79374595": {"display_name": "hw03Solutions.pdf", "url": "https://umd.instructure.com/files/79374595/download?download_frd=1&verifier=IEsPmrvyDVGZM3cN1ebX5g9gCBOE8uGUMTCVQXti"}, "79374605": {"display_name": "hw04.pdf", "url": "https://umd.instructure.com/files/79374605/download?download_frd=1&verifier=unEJphhiC6aAZIzs6dxqjna8mziOPSH0GiwEEzw3"}, "79374596": {"display_name": "hw04Solutions.pdf", "url": "https://umd.instructure.com/files/79374596/download?download_frd=1&verifier=4uSFc7YA2gBQqZPs0UfmMTaMisyJZNCXfxectylJ"}, "79374598": {"display_name": "hw05.pdf", "url": "https://umd.instructure.com/files/79374598/download?download_frd=1&verifier=ytN04B7XDhe3YOL3dhZPt3i8k3lRlkX12FtNw8mE"}, "79374599": {"display_name": "hw05Solutions.pdf", "url": "https://umd.instructure.com/files/79374599/download?download_frd=1&verifier=Z5z3yVzm3tT5utJZmBDU1nya0xUe4tRbUntaPQQz"}, "79374597": {"display_name": "hw06.pdf", "url": "https://umd.instructure.com/files/79374597/download?download_frd=1&verifier=smmVtnydX4Yc56uGv6CA81NbGrNeWQJSWdjWjEu7"}, "79374601": {"display_name": "hw06Solutions.pdf", "url": "https://umd.instructure.com/files/79374601/download?download_frd=1&verifier=frhZ9aZwbwFrz0C7buUa3lzSkgy7UGusxHhVKbVN"}, "79374604": {"display_name": "hw07.pdf", "url": "https://umd.instructure.com/files/79374604/download?download_frd=1&verifier=9q6Ymn8QjcAHdSYNBey7YmoEO5NnQajn9UT44dFm"}, "79374592": {"display_name": "hw07Solutions.pdf", "url": "https://umd.instructure.com/files/79374592/download?download_frd=1&verifier=786cQRvxbAmL44248tUlOxqTz16kDVZ3bU7ExV1Y"}, "79374600": {"display_name": "hw08.pdf", "url": "https://umd.instructure.com/files/79374600/download?download_frd=1&verifier=1muuKDun8KURaK0Ial6zZxf4T0ftd0pafyyvoR4L"}, "79374591": {"display_name": "hw08Solutions.pdf", "url": "https://umd.instructure.com/files/79374591/download?download_frd=1&verifier=2Dsyxn7sw2Y5Z7MjXeCquxt3LY0v23txCfGGqNyz"}, "79374607": {"display_name": "hw09.pdf", "url": "https://umd.instructure.com/files/79374607/download?download_frd=1&verifier=GzxFnftxhJF6yxRgaXPDC8t38PH5lRrZ0ZDgjhx8"}, "79374610": {"display_name": "hw09Solutions.pdf", "url": "https://umd.instructure.com/files/79374610/download?download_frd=1&verifier=ypprITIsgGRJQbzvzEZa8BsXLYiDIiit8IV8Zd8g"}, "79374608": {"display_name": "HW10.pdf", "url": "https://umd.instructure.com/files/79374608/download?download_frd=1&verifier=Su3DwlLjl0cDZ3IwVnteKY3ygKRNYRpNSrE8VABZ"}, "79374609": {"display_name": "HW10Solutions.pdf", "url": "https://umd.instructure.com/files/79374609/download?download_frd=1&verifier=T03xO1nVqT8EKy2leSkh0AYLhKR0yXG28BTgO3J6"}, "79186737": {"display_name": "iribe4.jpg", "url": "https://umd.instructure.com/files/79186737/download?download_frd=1&verifier=mgVeGzLcOJidkRfvovx3wY4mHbHlJ30tp0qZcDKX"}, "79186785": {"display_name": "Lec01.pdf", "url": "https://umd.instructure.com/files/79186785/download?download_frd=1&verifier=4I74bRynW1jqCRXchAjBj0wLzVmX8F8kFUzfOPlE"}, "79568958": {"display_name": "Lec01.pdf", "url": "https://umd.instructure.com/files/79568958/download?download_frd=1&verifier=l4uhJdaYSibFFYkTOEfwOyXt0S6N5r0RGSPkEe1e"}, "79186784": {"display_name": "Lec02.pdf", "url": "https://umd.instructure.com/files/79186784/download?download_frd=1&verifier=1wlQnjXwowJujvp0wbRzmIvSIJ1MzbjcznuSnSnl"}, "79621230": {"display_name": "Lec02.pdf", "url": "https://umd.instructure.com/files/79621230/download?download_frd=1&verifier=SVb0iAhJ4SSDekPnqkO8mSjdqHWyd2tUQhdx5RpP"}, "79621269": {"display_name": "lec02Examples.pdf", "url": "https://umd.instructure.com/files/79621269/download?download_frd=1&verifier=ZF1meVRu4fHZOCaNw7ZrHC6vCorlZQ8lZnsK0sGi"}, "79186786": {"display_name": "Lec03.pdf", "url": "https://umd.instructure.com/files/79186786/download?download_frd=1&verifier=xvZdSQSrLUFeNEDrOl9916aJKm8o847d8MZgjqTn"}, "79657699": {"display_name": "Lec03.pdf", "url": "https://umd.instructure.com/files/79657699/download?download_frd=1&verifier=44atgalHR9OVJq6Riz83GpD6cFQGPgV8iS9hZSHv"}, "79186787": {"display_name": "Lec04.pdf", "url": "https://umd.instructure.com/files/79186787/download?download_frd=1&verifier=NrqKO013QybQO0kc76CPvwyDiTRAhfk6OAgBe0BS"}, "79717567": {"display_name": "Lec04.pdf", "url": "https://umd.instructure.com/files/79717567/download?download_frd=1&verifier=33LEAiAMhnf2GTyoryaKsj92xyzmvSV0ZjhthLpJ"}, "79717562": {"display_name": "lec04Examples.pdf", "url": "https://umd.instructure.com/files/79717562/download?download_frd=1&verifier=bAFSn76xk0sN9lZVkVpHqSMcS6vXoOVNenXosN1s"}, "79186769": {"display_name": "Lec05.pdf", "url": "https://umd.instructure.com/files/79186769/download?download_frd=1&verifier=9Nu5aSoT9OzZUHAY3z46q0o7nxORhAezLLFR8ByT"}, "79756294": {"display_name": "Lec05.pdf", "url": "https://umd.instructure.com/files/79756294/download?download_frd=1&verifier=YMliro1m3HD6r9MYIOJKYLFkms5GLrOqXVFI355Z"}, "79186770": {"display_name": "Lec06.pdf", "url": "https://umd.instructure.com/files/79186770/download?download_frd=1&verifier=SxzyQEM3i7pSmJTvkwHw5mGtKwbn1L6pb4EFVK1P"}, "79796728": {"display_name": "Lec06.pdf", "url": "https://umd.instructure.com/files/79796728/download?download_frd=1&verifier=VxrSq0AYMnet2p8DL6g6PabkC3inGhc1P3a8MqMW"}, "79186792": {"display_name": "Lec07.pdf", "url": "https://umd.instructure.com/files/79186792/download?download_frd=1&verifier=rkXQmz6A47iiXTn9PBtdDQOC02PmtCoSB2l6meAv"}, "79848660": {"display_name": "Lec07.pdf", "url": "https://umd.instructure.com/files/79848660/download?download_frd=1&verifier=7vwGRxnDTYUB99VpTBRJuQk144NnfhNxvOllqcyh"}, "79186760": {"display_name": "Lec08.pdf", "url": "https://umd.instructure.com/files/79186760/download?download_frd=1&verifier=qMuGbJ8YigETHCOf2DQGQkfZcK9ipUGve7r0Wmk4"}, "79893727": {"display_name": "Lec08.pdf", "url": "https://umd.instructure.com/files/79893727/download?download_frd=1&verifier=6ORSczLNpFF8cVJ5OiXTtwW5gHwydQbqq5plbkVi"}, "79893741": {"display_name": "lec08Examples.pdf", "url": "https://umd.instructure.com/files/79893741/download?download_frd=1&verifier=nWc98i3AxMSKr2RDxhuTMa700YRN8V00GI9rSzmC"}, "79186779": {"display_name": "Lec09.pdf", "url": "https://umd.instructure.com/files/79186779/download?download_frd=1&verifier=eCGp6O1L8Lh2oXn5lt6bHMwcf0aoQqbIToJkqN5u"}, "79186761": {"display_name": "Lec10.pdf", "url": "https://umd.instructure.com/files/79186761/download?download_frd=1&verifier=L7fAlDKEkb6Qs8lMDO5yZHgpnMxbL6LVyuA02iEf"}, "79186817": {"display_name": "Lec10Examples.pdf", "url": "https://umd.instructure.com/files/79186817/download?download_frd=1&verifier=lmDo6YIgEayXzVqrceTuS12pPV0xZ2TvNkxgC7jb"}, "79186775": {"display_name": "Lec11.pdf", "url": "https://umd.instructure.com/files/79186775/download?download_frd=1&verifier=umNqJSKOD6CEXTN1qsk12zTDxQz6fqbDZN0tUowC"}, "79186776": {"display_name": "lec11Examples.pdf", "url": "https://umd.instructure.com/files/79186776/download?download_frd=1&verifier=dw8zzG1l2gcjOeEoHbXTdeOhC7Hs7l7pZbxxp4mL"}, "79186781": {"display_name": "Lec12.pdf", "url": "https://umd.instructure.com/files/79186781/download?download_frd=1&verifier=76HX9eQbsn6hiPDiJY9EzDfUIrmXC0dU1dFIO9Aw"}, "79186780": {"display_name": "lec12Examples.pdf", "url": "https://umd.instructure.com/files/79186780/download?download_frd=1&verifier=VSYUj5EWOrZOc55ONWG9TxPyNpXTiOCMQQu0aCPu"}, "79186758": {"display_name": "Lec13.pdf", "url": "https://umd.instructure.com/files/79186758/download?download_frd=1&verifier=id6A8hjF9Wns3TR8nA8F6CIC7p1366NZrcyJUmPy"}, "79186783": {"display_name": "lec13Examples.pdf", "url": "https://umd.instructure.com/files/79186783/download?download_frd=1&verifier=exT6zUtQdiuXxZGL4dr0oJOXnYyro4T918JruZQm"}, "79186773": {"display_name": "Lec14.pdf", "url": "https://umd.instructure.com/files/79186773/download?download_frd=1&verifier=McKm5b2IQJlx2fTYYMNZSJlnfmcCR6MCbMF81Mgx"}, "79186795": {"display_name": "lec14Examples.pdf", "url": "https://umd.instructure.com/files/79186795/download?download_frd=1&verifier=QJFCFrjXH96Se80EyKVCooY87LQndTDsjeijYAeB"}, "79186782": {"display_name": "Lec15.pdf", "url": "https://umd.instructure.com/files/79186782/download?download_frd=1&verifier=u4rkGIbnqM0Odka7arLRwQB2aOs4bZo9TrnRQgga"}, "79186798": {"display_name": "lec15Examples.pdf", "url": "https://umd.instructure.com/files/79186798/download?download_frd=1&verifier=ZUj1xlwIplICY6aC7mLTlYL8EofohGfLxDjZ06bo"}, "79186815": {"display_name": "Lec16.pdf", "url": "https://umd.instructure.com/files/79186815/download?download_frd=1&verifier=qsbpPDdKXPffwFTFjTYfSTzUQfGpJXvz7iKhAtuI"}, "79186772": {"display_name": "lec16Examples.pdf", "url": "https://umd.instructure.com/files/79186772/download?download_frd=1&verifier=seu9Zhri1WRcHv2EQnNhEyserUQs91dg75Yj2mDJ"}, "79186790": {"display_name": "Lec17.pdf", "url": "https://umd.instructure.com/files/79186790/download?download_frd=1&verifier=r8TnSygJVEorNXp6dsZXE42bXzelU4iS6nWHz3Su"}, "79186789": {"display_name": "lec17Examples.pdf", "url": "https://umd.instructure.com/files/79186789/download?download_frd=1&verifier=6zagLFSjSnZLsOp5QIjjOXDROf3yNvyMQUemNcsQ"}, "79186788": {"display_name": "Lec19.pdf", "url": "https://umd.instructure.com/files/79186788/download?download_frd=1&verifier=hEDIJ7dwAr8lh1TkOAwUOQkbTiLl0KFy5H8dzROt"}, "79186808": {"display_name": "lec19Examples.pdf", "url": "https://umd.instructure.com/files/79186808/download?download_frd=1&verifier=I6rMjL4mxuo9N92I83zDofHldbb6Rnf1xs09ncCu"}, "79186774": {"display_name": "Lec20.pdf", "url": "https://umd.instructure.com/files/79186774/download?download_frd=1&verifier=pujxnb0uw7T2wis8rKLPto8aKDDx81ZY6TX0s9CJ"}, "79186778": {"display_name": "lec20Examples.pdf", "url": "https://umd.instructure.com/files/79186778/download?download_frd=1&verifier=PIVUmY6ZcMrgMJVZ8HSGSXpH7VvYZfDKocGFVAur"}, "79186796": {"display_name": "Lec21.pdf", "url": "https://umd.instructure.com/files/79186796/download?download_frd=1&verifier=PUWkl5zZRJIKiVqpJJveFg8yE5mabqtVbYW527nR"}, "79186768": {"display_name": "lec21Examples.pdf", "url": "https://umd.instructure.com/files/79186768/download?download_frd=1&verifier=TiSjGOful1yVvwtNp8lgMYm7Ucjs9uEe8lv0OgAw"}, "79186794": {"display_name": "Lec22.pdf", "url": "https://umd.instructure.com/files/79186794/download?download_frd=1&verifier=teau1uugENZYyr34njBs5EMKlmzQSngjgSh5ZlBA"}, "79186793": {"display_name": "lec22Exampless.pdf", "url": "https://umd.instructure.com/files/79186793/download?download_frd=1&verifier=TX50ECaSsVosksT5V9klXL8aq3zRrBnl8KbiXDfE"}, "79186809": {"display_name": "Lec23.pdf", "url": "https://umd.instructure.com/files/79186809/download?download_frd=1&verifier=jPrnDPJEr91FS4SrrysWT4TwXkOvfPFtpURTYwUW"}, "79186759": {"display_name": "lec23Examples.pdf", "url": "https://umd.instructure.com/files/79186759/download?download_frd=1&verifier=LRiZxKZF2o8xug8iQPRwpXyoG7LRubs2WV3O35En"}, "79186764": {"display_name": "Lec24.pdf", "url": "https://umd.instructure.com/files/79186764/download?download_frd=1&verifier=65Qsbkz5Y2B2StUGSZ8yZ4Gfw2y5R2LNldKq5WwN"}, "79186765": {"display_name": "lec24Examples.pdf", "url": "https://umd.instructure.com/files/79186765/download?download_frd=1&verifier=0HOs3rV6gpbcaOrdAHYHdUU6Rj83COR84qC9gM18"}, "79186799": {"display_name": "Lec25.pdf", "url": "https://umd.instructure.com/files/79186799/download?download_frd=1&verifier=qIJ91MoZpI4bZJSLBQPagRw7PSPtwTkjBXrhykp0"}, "79186800": {"display_name": "lec25Examples.pdf", "url": "https://umd.instructure.com/files/79186800/download?download_frd=1&verifier=sutkRLsqWE6WlBh8tEHCxnqPljXf8ZVHJyosQ5nV"}, "79186802": {"display_name": "Lec26.pdf", "url": "https://umd.instructure.com/files/79186802/download?download_frd=1&verifier=dp6KZxohsIXAuUn99bDF33iGXI1FVc31n026kbKN"}, "79186804": {"display_name": "Lec27.pdf", "url": "https://umd.instructure.com/files/79186804/download?download_frd=1&verifier=mSAAtvUwN4dQoCVCOtKNxfLXcxUe1YZWz1bHBgEx"}, "79186791": {"display_name": "Lec28.pdf", "url": "https://umd.instructure.com/files/79186791/download?download_frd=1&verifier=fsFvhNRUL97m9BZwi4qiVPiaql3BPM6KMn0ALocp"}, "79186803": {"display_name": "Lec29.pdf", "url": "https://umd.instructure.com/files/79186803/download?download_frd=1&verifier=nXi3TXqqST5EzGtUnjH2G6pN8HkvqScoRxY0av8k"}, "79186767": {"display_name": "Lec30.pdf", "url": "https://umd.instructure.com/files/79186767/download?download_frd=1&verifier=HFZTsSIlXVuOHAL4a4B41DziCN9W9dPf7VotgipJ"}, "79186762": {"display_name": "Lec31.pdf", "url": "https://umd.instructure.com/files/79186762/download?download_frd=1&verifier=SgjlBBN5pdnb5fpgW1oDKjfl1lUSLiU00RWqFnq1"}, "79186763": {"display_name": "lec31Examples.pdf", "url": "https://umd.instructure.com/files/79186763/download?download_frd=1&verifier=JUOXQRooPS1yU8z4zhS10aFCYRbwhqwuwxHacLbQ"}, "79186806": {"display_name": "lec32Examples.pdf", "url": "https://umd.instructure.com/files/79186806/download?download_frd=1&verifier=woR0wX86DZu8ufX6V4DGChs4vXK16hrNiYSv3RLB"}, "79186807": {"display_name": "Lec32Review.pdf", "url": "https://umd.instructure.com/files/79186807/download?download_frd=1&verifier=MnrsQq0LYvVAKpm8GNcvZpEOMti6iZdFms0SwS6x"}, "79186812": {"display_name": "Lec33.pdf", "url": "https://umd.instructure.com/files/79186812/download?download_frd=1&verifier=GZd6CSoUyTJfMaEBAJp8L67dg8jpglW6ISKBJRTB"}, "79186818": {"display_name": "lec33Examples.pdf", "url": "https://umd.instructure.com/files/79186818/download?download_frd=1&verifier=QfzjqhS3thylVXIWuXuBRdMzvMNPYx0AezAwrNke"}, "79186801": {"display_name": "Lec34.pdf", "url": "https://umd.instructure.com/files/79186801/download?download_frd=1&verifier=sKagR8geyiD2qd4KxsaPGOrr5kRDU9BtokEtvnVs"}, "79186810": {"display_name": "Lec35.pdf", "url": "https://umd.instructure.com/files/79186810/download?download_frd=1&verifier=fkAhC9IDPuvvt7fdFa3iDQW9TfluLV4624PzwHKj"}, "79186813": {"display_name": "Lec36.pdf", "url": "https://umd.instructure.com/files/79186813/download?download_frd=1&verifier=MISJq7w9wLtjOExSUJxFbRwaKzn3qUJzIERR59eB"}, "79186766": {"display_name": "Lec37.pdf", "url": "https://umd.instructure.com/files/79186766/download?download_frd=1&verifier=kFmFkNo933ba9o8jglhWrvcGdHNX0UxtD45iEd8T"}, "79186811": {"display_name": "Lec38.pdf", "url": "https://umd.instructure.com/files/79186811/download?download_frd=1&verifier=QC1yoHNLEWaXaH8cVvqRKy0yQAc2cZw9w3vHuWnD"}, "79186814": {"display_name": "Lec39 (Review).pdf", "url": "https://umd.instructure.com/files/79186814/download?download_frd=1&verifier=2fWNYI110tteWZrTcT0SMQWuoJkUB6n3PYS9VhS8"}, "79186771": {"display_name": "LogicalEquivalencies.pdf", "url": "https://umd.instructure.com/files/79186771/download?download_frd=1&verifier=y1JF70CLiVBTT7Ne408XNYh7CeyQhDc0gKQ9cD3V"}, "79633911": {"display_name": "logicRules.pdf", "url": "https://umd.instructure.com/files/79633911/download?download_frd=1&verifier=nowlqrgHNicS2XmVWGsWMNad9mjB0dWPcMsFsTot"}, "79742002": {"display_name": "logicRules.pdf", "url": "https://umd.instructure.com/files/79742002/download?download_frd=1&verifier=airpaW8g1kbYEtkWDpQRPUKNUl3x9d120upFLSng"}, "79186816": {"display_name": "reviewForFinalExamples.pdf", "url": "https://umd.instructure.com/files/79186816/download?download_frd=1&verifier=aiHDgeqvjKncFvJCZP4BUd5T0ToJ5m6gu1hFlzkJ"}, "79186797": {"display_name": "setRules.pdf", "url": "https://umd.instructure.com/files/79186797/download?download_frd=1&verifier=diL5AHbFeo3sdm1B3Kf8sVrkxSSsLjG6W13czatV"}}}, "1368177": {"name": "CMSC320-0201/DATA320-0201:  Introduction to Data Science-Fall 2024 fardina/", "assignments": {"6938822": {"name": "HW 1 - Pandas and SQL Section", "due_at": "2024-09-20T03:59:59Z", "description": "Welcome to the first homework of this semester. Follow the directions carefully! 🔥 The section and its instructions are linked here Overview: This section (Pandas AND SQL)  is worth 70 point s, contributing to a total of 100 points for the entire homework. There are 3 Parts to complete in this section. (DON’T REMOVE ANY PART OF THE QUESTIONS) : Part 1: 25 points Part 2: 30 points Part 3: 15 points Note: ~ Start early, as this is a bit of a lengthy homework (YOU GOT THIS!) ~ Submission: Submit your completed notebook (.ipynb) file to the \"HW1- Pandas and SQL Section\" on Gradescope . Late Submission Policy: A 24-hour late submission is allowed with a 15% penalty ."}, "6938825": {"name": "HW 1 - Git Section", "due_at": "2024-09-20T03:59:59Z", "description": "Welcome to the first homework of this semester. Follow the directions carefully! 🔥 The section and its instructions are linked here Overview: This section (Git)  is worth 3 0 point s, contributing to a total of 100 points for the entire homework. Carefully follow the directions in this section to make sure you complete all the tasks successfully. Note: ~ Start early, as this is a bit of a lengthy homework (YOU GOT THIS!) ~ Submission: Submit ONLY the URL link of your completed repository to the  \"HW1- Git Section\" on Gradescope . Late Submission Policy: A 24-hour late submission is allowed with a 15% penalty ."}, "6936993": {"name": "BONUS Quiz: Course Logistics Introduction ", "due_at": "2024-09-07T03:59:00Z", "description": "This is a bonus quiz! This quiz consists of 13 questions including MCQ, Fill in the blanks, T/F. The questions are related to course logistics . The students can find the answers from Syllabus (https://cmsc320.github.io/) and Lecture 01. Do not forget to read the course website (https://cmsc320.github.io/), and syllabus along with the slide before taking this quiz. The total time duration is 12 minutes . Each multiple-choice question has only one correct answer . Note that there are no questions from \"Overview of Data Science\" in this quiz . Please manage your time effectively, as multiple attempts are not allowed . Due date: September 06, 2024."}, "6927330": {"name": "Final Project - Checkpoint 1", "due_at": "2024-09-25T03:59:59Z", "description": "Final Project Assignment.pdf Checkpoint 1 of the final project is due on Thursday, 9/24 on Gradescope. Don't forget to add your group on there when you submit! Also, write down all group members name and their UID in the PDF that you will submit."}, "6927331": {"name": "Final Project - Checkpoint 2", "due_at": "2024-10-23T03:59:59Z", "description": "Final Project Assignment-1.pdf Checkpoint 2 of the final project is due on Tuesday, October 22 on Gradescope. Remember to include everyone in your group in the submission."}, "6927332": {"name": "Final Project Checkpoint 03", "due_at": "2024-12-04T04:59:59Z", "description": "Final Project Assignment-2.pdf This is a reminder assignment, submit ONLY on gradescope. This is for your ELMS timeline. Again , you do NOT need to submit anything here."}}, "files": {}}, "1368189": {"name": "CMSC330: Organization of Programming Languages", "assignments": {"6943941": {"name": "Lecture Quiz 1", "due_at": "2024-09-02T03:59:59Z", "description": null}, "6943960": {"name": "Lecture Quiz 2", "due_at": "2024-09-09T03:59:59Z", "description": null}, "6943974": {"name": "Project 1", "due_at": "2024-09-16T03:59:59Z", "description": null}, "6944009": {"name": "Quiz 1", "due_at": null, "description": null}, "6944010": {"name": "Quiz 2", "due_at": null, "description": null}, "6944012": {"name": "Quiz 3", "due_at": null, "description": null}, "6944013": {"name": "Quiz 4", "due_at": null, "description": null}, "6944001": {"name": "Project 2", "due_at": null, "description": null}, "6944003": {"name": "Project 3", "due_at": null, "description": null}, "6944004": {"name": "Project 4", "due_at": null, "description": null}, "6944005": {"name": "Project 5", "due_at": null, "description": null}, "6944007": {"name": "Project 6", "due_at": null, "description": null}, "6944008": {"name": "Project 7", "due_at": null, "description": null}}, "files": {}}, "1367453": {"name": "CMSC351-WB21: Algorithms-Summer II 2024 immortal", "assignments": {"6827691": {"name": "hw-1", "due_at": null, "description": null}, "6833465": {"name": "hw-2", "due_at": null, "description": null}, "6833466": {"name": "hw-3", "due_at": null, "description": null}, "6833469": {"name": "hw-4", "due_at": null, "description": null}, "6833470": {"name": "hw-5", "due_at": null, "description": null}, "6833471": {"name": "hw-6", "due_at": null, "description": null}, "6833472": {"name": "hw-7", "due_at": null, "description": null}, "6833473": {"name": "hw-8", "due_at": null, "description": null}, "6833474": {"name": "hw-9", "due_at": null, "description": null}, "6833475": {"name": "hw-10", "due_at": null, "description": null}, "6833476": {"name": "hw-11", "due_at": null, "description": null}, "6785526": {"name": "Exam 1 Canvas", "due_at": "2024-07-22T03:59:59Z", "description": null}, "6838587": {"name": "Exam 2 Canvas", "due_at": "2024-08-05T03:59:00Z", "description": null}, "6866475": {"name": "Exam 3 Canvas", "due_at": "2024-08-19T03:59:59Z", "description": null}, "6833467": {"name": "we-2", "due_at": null, "description": null}, "6833468": {"name": "we-3", "due_at": null, "description": null}}, "files": {"79040317": {"display_name": "exam-1-sample-solutions.pdf", "url": "https://umd.instructure.com/files/79040317/download?download_frd=1&verifier=UfcA0oe7OATDGhGnQeqqXTOZXGM1Ny8amjJGPFfB"}, "79037223": {"display_name": "exam-1-sample.pdf", "url": "https://umd.instructure.com/files/79037223/download?download_frd=1&verifier=HIbq4Gkk6JCSFfwO1kgQOYljQ9QILQkcHWzvHL0c"}, "79059134": {"display_name": "exam-1-solutions.pdf", "url": "https://umd.instructure.com/files/79059134/download?download_frd=1&verifier=HIZNc6DW1vuQt8VlZrAR4Kk4B9LM5alKd5AfrWrb"}, "79059133": {"display_name": "exam-1.pdf", "url": "https://umd.instructure.com/files/79059133/download?download_frd=1&verifier=yuItZPE6pKHP0kzFZu1qQxDr74XgkmuzelisQhdR"}, "79141240": {"display_name": "exam-2-sample-solutions.pdf", "url": "https://umd.instructure.com/files/79141240/download?download_frd=1&verifier=WZmiU8d577cCTiACN4kOw1Q3iUdcoIEA1JsTde8L"}, "79144887": {"display_name": "exam-2-sample.pdf", "url": "https://umd.instructure.com/files/79144887/download?download_frd=1&verifier=h3k2UhrdieTFHwkgy8XH7jPH0esC6cZYU9SEkZbF"}, "79182608": {"display_name": "exam-2-solutions.pdf", "url": "https://umd.instructure.com/files/79182608/download?download_frd=1&verifier=zb5B5XPIzFjlyYzi0rp92F9Pj4wWX2OAuuKjNI6Q"}, "79182303": {"display_name": "exam-2.pdf", "url": "https://umd.instructure.com/files/79182303/download?download_frd=1&verifier=GHvtIwS22EGLkFcR10aZTDDByYIBv8iILUDmp3Yr"}, "79305817": {"display_name": "exam-3-sample-solutions.pdf", "url": "https://umd.instructure.com/files/79305817/download?download_frd=1&verifier=ibHcDzAKwVdiRCU7FGv8PPW9SLPQyTy7NBxaOuUT"}, "79300521": {"display_name": "exam-3-sample.pdf", "url": "https://umd.instructure.com/files/79300521/download?download_frd=1&verifier=FmFDJ1Oxl4OBCBwNLFAjR0093WQEZQsM0JopN7kx"}, "78993930": {"display_name": "hw-1-solutions.pdf", "url": "https://umd.instructure.com/files/78993930/download?download_frd=1&verifier=GQgr3vucrJyy4AiI8N5UDkapBPqJjQcy0uEcBsVJ"}, "78947378": {"display_name": "hw-1.pdf", "url": "https://umd.instructure.com/files/78947378/download?download_frd=1&verifier=ZeKSQXAq1MyaAL05b8unJkmX2ZSLNYmHecBKDIH8"}, "78947379": {"display_name": "hw-1.tex", "url": "https://umd.instructure.com/files/78947379/download?download_frd=1&verifier=lChNZiQSHSe0H4S0S5DCOdeAh1ynACuglOx7Ilm0"}, "79089398": {"display_name": "hw-2-solutions.pdf", "url": "https://umd.instructure.com/files/79089398/download?download_frd=1&verifier=kKWkJqwvmkdXxJt2dcvwWRFwOFUZdFQm0atqxqfj"}, "78958351": {"display_name": "hw-2.pdf", "url": "https://umd.instructure.com/files/78958351/download?download_frd=1&verifier=RTpKvWqWOSZBBtEgDnSuG8Zjgh22lQy1aOtHERsH"}, "78958350": {"display_name": "hw-2.tex", "url": "https://umd.instructure.com/files/78958350/download?download_frd=1&verifier=M8xT07d418wkgQDjI3jSwVuhxsnJtDBzKpAos5RM"}, "79059148": {"display_name": "hw-3-solutions.pdf", "url": "https://umd.instructure.com/files/79059148/download?download_frd=1&verifier=wz0AkaG2Qgr2avjZ4iUrhjk7XDtJWeta4OF9GLAH"}, "78972918": {"display_name": "hw-3.pdf", "url": "https://umd.instructure.com/files/78972918/download?download_frd=1&verifier=jkBOsJ5d1jVHTvYGSbkS37bhtKEnYV6X0k3vlaWx"}, "78972917": {"display_name": "hw-3.tex", "url": "https://umd.instructure.com/files/78972917/download?download_frd=1&verifier=IRaD3qb9AIQ5ix97vewP3zlhvOXcaTT6MVs7J2b7"}, "79098904": {"display_name": "hw-4-solutions.pdf", "url": "https://umd.instructure.com/files/79098904/download?download_frd=1&verifier=4j9tyO0pRRxOcLXKFGIiKof3YcbumRKxpRk6MNih"}, "79059125": {"display_name": "hw-4.pdf", "url": "https://umd.instructure.com/files/79059125/download?download_frd=1&verifier=yIOOKo0HGYAvxjLVdgpYkL9rN4GVGATjQC9xaj5I"}, "79059126": {"display_name": "hw-4.tex", "url": "https://umd.instructure.com/files/79059126/download?download_frd=1&verifier=QKoHU8SxjYgAOsYyPw8kLIOyfxWjNfa8ncgJnBFZ"}, "79101528": {"display_name": "hw-5-solutions.pdf", "url": "https://umd.instructure.com/files/79101528/download?download_frd=1&verifier=lL0n78kXfvaw9QzxmTelmf54UQxjKox7Zr0w4jhO"}, "79087386": {"display_name": "hw-5.pdf", "url": "https://umd.instructure.com/files/79087386/download?download_frd=1&verifier=cCbPYlQY8fH3h6USmXOLT3Yq5lGAh1CFZr40F3AI"}, "79087387": {"display_name": "hw-5.tex", "url": "https://umd.instructure.com/files/79087387/download?download_frd=1&verifier=mxdIQblsB1lm0EMdS8Xd2jfkJF9xr6fZ9NyuG4yG"}, "79181820": {"display_name": "hw-6-solutions.pdf", "url": "https://umd.instructure.com/files/79181820/download?download_frd=1&verifier=XPlHc9H3EIzx0TYGU0YT6uK0hID2Tj19yyuqfIG8"}, "79098913": {"display_name": "hw-6.pdf", "url": "https://umd.instructure.com/files/79098913/download?download_frd=1&verifier=u28X9Tynlt7JNqWavmq1NKVjxUGUEOHPy7oEVOKR"}, "79098914": {"display_name": "hw-6.tex", "url": "https://umd.instructure.com/files/79098914/download?download_frd=1&verifier=tHtHPzDqqCgFdB76jPNkCx0Zni8QtxhSelyLfLvp"}, "79223419": {"display_name": "hw-7-solutions.pdf", "url": "https://umd.instructure.com/files/79223419/download?download_frd=1&verifier=A8eroYvFYSvjW1bacrgyBSEe0OtGLJsFJyTncQ37"}, "79096546": {"display_name": "hw-7.pdf", "url": "https://umd.instructure.com/files/79096546/download?download_frd=1&verifier=y9cD1tx9kydBfJ7OYuE2Cslew2MmpvdCEypoiuok"}, "79096547": {"display_name": "hw-7.tex", "url": "https://umd.instructure.com/files/79096547/download?download_frd=1&verifier=nHvCE4xXq0EkaQZLkSyPjPs9UCntQXrQTDSEXrrT"}, "79223420": {"display_name": "hw-8-solutions.pdf", "url": "https://umd.instructure.com/files/79223420/download?download_frd=1&verifier=hBL9LGSONQgh3p3Zr4G9O1P4fJebreuwfrcOFpvk"}, "79174486": {"display_name": "hw-8.pdf", "url": "https://umd.instructure.com/files/79174486/download?download_frd=1&verifier=jCKVk3ETVpcn6yeV2U3GQCdFReqNBPXvccWWPLE9"}, "79174485": {"display_name": "hw-8.tex", "url": "https://umd.instructure.com/files/79174485/download?download_frd=1&verifier=bdj0bRmNLR3KpLRD6QOLE7Rr2IHX7on49RwU2wYY"}, "79250757": {"display_name": "hw-9-solutions.pdf", "url": "https://umd.instructure.com/files/79250757/download?download_frd=1&verifier=gYuItEoch2dYWXNwsKqEuwpbcg2tRyYN2r0nBy1B"}, "79179722": {"display_name": "hw-9.pdf", "url": "https://umd.instructure.com/files/79179722/download?download_frd=1&verifier=LbStZmo2CSUFddp12xV4Lk8cshXGTCWf8pmn9EJh"}, "79179723": {"display_name": "hw-9.tex", "url": "https://umd.instructure.com/files/79179723/download?download_frd=1&verifier=MdREfBRV5kj9T1fo0QgazaVpMkeiLSKHkczpHbKi"}, "79300510": {"display_name": "hw-10-solutions.pdf", "url": "https://umd.instructure.com/files/79300510/download?download_frd=1&verifier=c3xWclJf9DjlYlRuGG2sW6ZBB1dMPA1edtUvJqZA"}, "79209043": {"display_name": "hw-10.pdf", "url": "https://umd.instructure.com/files/79209043/download?download_frd=1&verifier=CX4E9A6wwZtZUpVUZF4jk6ON1TttsK7WSxqNnCnn"}, "79209044": {"display_name": "hw-10.tex", "url": "https://umd.instructure.com/files/79209044/download?download_frd=1&verifier=cSwZ1kDVcgLty4ovM7dGWLRnUJ3KP0v1ZICw2mn2"}, "79324595": {"display_name": "hw-11-solutions.pdf", "url": "https://umd.instructure.com/files/79324595/download?download_frd=1&verifier=mQo8wMlfIVlcgXTgwIHdYEk3FSEXhUzzmNqi9phJ"}, "79226449": {"display_name": "hw-11.pdf", "url": "https://umd.instructure.com/files/79226449/download?download_frd=1&verifier=3mjPNwuL5o6ro4aUDJYOnM0VRhuUjfX91Km6wCgN"}, "79226451": {"display_name": "hw-11.tex", "url": "https://umd.instructure.com/files/79226451/download?download_frd=1&verifier=PF2EnZpJmlIc79py6WfyqvQan9od95nkV9uSY8yj"}, "78787272": {"display_name": "Topic-01-coin-changing.pdf", "url": "https://umd.instructure.com/files/78787272/download?download_frd=1&verifier=zzCow9ZGtCKgPHk4NeO0NmZsgkyKURoZpoQo3wVJ"}, "78804499": {"display_name": "Topic-02-bigs-Part-1.pdf", "url": "https://umd.instructure.com/files/78804499/download?download_frd=1&verifier=OiZyF2KXaxZTrpQIoaFIHsvduGkdD5aohnYQGjO6"}, "78805670": {"display_name": "Topic-02-bigs-Part-2.pdf", "url": "https://umd.instructure.com/files/78805670/download?download_frd=1&verifier=KLfJCy2V7UGT9NcrrQeoKc3Fkh9av46J5t8HCCJp"}, "78807793": {"display_name": "Topic-02-bigs-Part-3.pdf", "url": "https://umd.instructure.com/files/78807793/download?download_frd=1&verifier=xBtNe372Cxnf7r3rK6k54pgNiwCCDj6HreBt2bPB"}, "78819176": {"display_name": "Topic-03-time-requirements.pdf", "url": "https://umd.instructure.com/files/78819176/download?download_frd=1&verifier=W7HwgulLwKd4cpFJVEZ222PcenDGb6wgoZODXtOA"}, "78823301": {"display_name": "Topic-04-maximum-contiguous-sum-Part-1.pdf", "url": "https://umd.instructure.com/files/78823301/download?download_frd=1&verifier=teRHFri6I4byI18b25GyP7ygJW1Nb6z2ErxN65E0"}, "78823979": {"display_name": "Topic-04-maximum-contiguous-sum-Part-2.pdf", "url": "https://umd.instructure.com/files/78823979/download?download_frd=1&verifier=M7lKZlVjxHsHKz9gcuLUvKuQhDWlHJvqffmmFo0Z"}, "78824415": {"display_name": "Topic-04-maximum-contiguous-sum-Part-3.pdf", "url": "https://umd.instructure.com/files/78824415/download?download_frd=1&verifier=iWEySVodCgtmnPQLvjDLtA4TR7rmXcqaVm11ECSW"}, "78894022": {"display_name": "Topic-05-sorting-overview-and-definitions.pdf", "url": "https://umd.instructure.com/files/78894022/download?download_frd=1&verifier=4758VSm1cYaHx8jKds1HIvhO5qat9AOjRssDFees"}, "78894101": {"display_name": "Topic-06-bubble-sort.pdf", "url": "https://umd.instructure.com/files/78894101/download?download_frd=1&verifier=8EwFNEFHZb7AC8bpDWL8SNnmL7KlPq5JIezN3OK2"}, "78897136": {"display_name": "Topic-07-selection-sort.pdf", "url": "https://umd.instructure.com/files/78897136/download?download_frd=1&verifier=JVooPgRD5lHPdCUZBa90tMoJ6tHDUKrfPY6aOceD"}, "78969525": {"display_name": "Topic-08-insertion-sort.pdf", "url": "https://umd.instructure.com/files/78969525/download?download_frd=1&verifier=Rhen9ClJlbCVzOgMNE6GUaCc04Ijeg722CWhptMt"}, "78969982": {"display_name": "Topic-09-binary-search.pdf", "url": "https://umd.instructure.com/files/78969982/download?download_frd=1&verifier=APTTzifUztOfEnofa1zcvYJ128C3R62H2vHnIjch"}, "78970788": {"display_name": "Topic-10-recurrence-and-digging-down.pdf", "url": "https://umd.instructure.com/files/78970788/download?download_frd=1&verifier=5IPNEqXCHopHcOieoYtE20QIkKCHPnDGuuiKnwDi"}, "79016810": {"display_name": "Topic-11-recurrence-trees.pdf", "url": "https://umd.instructure.com/files/79016810/download?download_frd=1&verifier=2FPWBOMTRYH2m9bHlKtMmynrWeTZ7mCze6R6L34Y"}, "79044765": {"display_name": "Topic-12-master-theorem.pdf", "url": "https://umd.instructure.com/files/79044765/download?download_frd=1&verifier=hRKjGCLu78VMXLi0u02hwgSOXVGlR6yysxQp21Xf"}, "79046315": {"display_name": "Topic-13-merge-sort.pdf", "url": "https://umd.instructure.com/files/79046315/download?download_frd=1&verifier=jZxSzwCh0yLSgHV0vlDlmsWejoztS0AiXbuiXXel"}, "79052174": {"display_name": "Topic-14-heaps.pdf", "url": "https://umd.instructure.com/files/79052174/download?download_frd=1&verifier=B5tlKhgbjxvVfPjTnM9d3qYWRcCd08mjKNwkWsWq"}, "79057291": {"display_name": "Topic-15-heap-sort.pdf", "url": "https://umd.instructure.com/files/79057291/download?download_frd=1&verifier=vzwl6KDCOBfQGnqIyg84yKclY7U2bIapMMnTAvzr"}, "79065825": {"display_name": "Topic-16-quick-sort.pdf", "url": "https://umd.instructure.com/files/79065825/download?download_frd=1&verifier=m3KAbzTmT2p4ksFkx8QmV0Q1UXc3Cndh8mgGomu0"}, "79092202": {"display_name": "Topic-17-counting-sort.pdf", "url": "https://umd.instructure.com/files/79092202/download?download_frd=1&verifier=ZTPRU7PuFMwm6arXMcMAJLs4n8nBMcdqBxkzLtBJ"}, "79093132": {"display_name": "Topic-18-radix-sort.pdf", "url": "https://umd.instructure.com/files/79093132/download?download_frd=1&verifier=hSGfqiIgeBm3dSAJnAqp6Z6F2vxERyobwXwaXHtT"}, "79095158": {"display_name": "Topic-19-karatsuba-part-1.pdf", "url": "https://umd.instructure.com/files/79095158/download?download_frd=1&verifier=PpMkwer61d41yq9RA5UH1A9n9aLMh9kMTzW1saGw"}, "79095159": {"display_name": "Topic-20-karatsuba-part-2.pdf", "url": "https://umd.instructure.com/files/79095159/download?download_frd=1&verifier=DWQtDpPpCwJsZKeTb4itwJ1S0mSitrKDRYHsRQrc"}, "79099040": {"display_name": "Topic-21-graphs.pdf", "url": "https://umd.instructure.com/files/79099040/download?download_frd=1&verifier=XLMpqEhMPSmFIEXH8Y9xZaBsw8Osix1frjzgFkoh"}, "79099160": {"display_name": "Topic-22-shortest-path-algorithm.pdf", "url": "https://umd.instructure.com/files/79099160/download?download_frd=1&verifier=sMNe7wFLy9qfmcPe5RBsxukdVcGVOTV0B1MU8pOE"}, "79099594": {"display_name": "Topic-23-bft.pdf", "url": "https://umd.instructure.com/files/79099594/download?download_frd=1&verifier=Y2VEnbZkV68UaF9TvmoBSO29uhdx6XMk6S0z7R39"}, "79099595": {"display_name": "Topic-24-dft.pdf", "url": "https://umd.instructure.com/files/79099595/download?download_frd=1&verifier=hg6BH5q6HFbgqFDQMmQf3TlrOp1R6ii5ezZ6j7Pa"}, "79152182": {"display_name": "Topic-25-dijkstra.pdf", "url": "https://umd.instructure.com/files/79152182/download?download_frd=1&verifier=iLpqEdzLK9bWIYslW28ct6nSbthOSHIMXyyvBGf4"}, "79153149": {"display_name": "Topic-26-floyd.pdf", "url": "https://umd.instructure.com/files/79153149/download?download_frd=1&verifier=wkJNirbPE0yRxDopWomneHmcXQS3mOeLWvQ0jaH7"}, "79171790": {"display_name": "Topic-27-minimal-spanning-trees.pdf", "url": "https://umd.instructure.com/files/79171790/download?download_frd=1&verifier=TgV1fql0gatPoA4Gt6DuP5LwBsx82mRLpmpl2usX"}, "79195547": {"display_name": "Topic-28-prim.pdf", "url": "https://umd.instructure.com/files/79195547/download?download_frd=1&verifier=T07eRs6YL9kzXXq5WlzVFGLwxrTyAxqnwCLmN1Dj"}, "79171792": {"display_name": "Topic-29-kruskal.pdf", "url": "https://umd.instructure.com/files/79171792/download?download_frd=1&verifier=SfJHg1mpi5cD8ezI4fOYrAZBjevdquGjaZI13yZ6"}, "79173480": {"display_name": "Topic-30-minimax.pdf", "url": "https://umd.instructure.com/files/79173480/download?download_frd=1&verifier=fcx1AiDY3pUQlay5uBunmCcwyhsGGhanPzUhTsAc"}, "79175242": {"display_name": "Topic-31-huffman.pdf", "url": "https://umd.instructure.com/files/79175242/download?download_frd=1&verifier=FpJnFt3FjAx5ke0bBRXJEbaRTDavefu8I1KrXIGU"}, "79191864": {"display_name": "Topic-32-P-and-NP-Part-1.pdf", "url": "https://umd.instructure.com/files/79191864/download?download_frd=1&verifier=4vLYbuD6PO2CKAD0lJkE8s7C6GpCNeYXfjoZFrNG"}, "79223718": {"display_name": "Topic-33-P-and-NP-Part-2.pdf", "url": "https://umd.instructure.com/files/79223718/download?download_frd=1&verifier=oYW0KxNnZS8Btqm2nDy5ownwwRH35RNVfLqYolpO"}, "79250187": {"display_name": "Topic-34-P-and-NP-Part-3.pdf", "url": "https://umd.instructure.com/files/79250187/download?download_frd=1&verifier=bvudUVs6Ywks1aXO8UxIoorkltKk6TnKCT47ibdb"}}}, "1363604": {"name": "COMM107-9902,9909: Oral Communication: Principles and Practices-Spring 2024 taufiq", "assignments": {"6630593": {"name": "Informative Outline", "due_at": null, "description": "Informative Outline (30 points) You will submit an outline for the Informative Presentation. You should organize your outline using a nested structure. You may consider following an organizational structure, as explained in your textbook (i.e., chronological/temporal, spatial/geographical, temporal, comparative advantage). Please be sure that your outline also includes the components of an introduction , body , and conclusion; as well as transitions, internal previews , and signposts . This outline will organize your entire presentation in full sentences. For more information, see Chapter 6: Presentation Preparation. Further Guidelines: Research: Your outline must include at least three (3) sources. These sources must support and reinforce the main ideas and claims made throughout the outline. They must come from credible sources, such as expert interviews, academic journals, and newspapers. All references to external sources must be attributed using complete and accurate in-text citations and be properly formatted at the end of the outline. For more information on citation resources see https://owl.purdue.edu/owl/research_and_citation/resources.html Introduction: Your introduction should gain the audience's attention, provide a clear thesis statement, establish practicality, and preview the main points of your presentation. The attention grabber must hook the audience and draw them into the presentation. The purpose/central idea/thesis statement should narrow the topic, and it should not be persuasive. For more information, see Chapter 6: Presentation Preparation and Chapter 8: Informative Presentations. Body: The body of your speech should have a structure that makes sense for the presentation (e.g., chronological, spatial, topical). It should be arranged logically to present concepts. It should have artfully-constructed transitions between ideas. Don't just say, \"second...\" but provide a segue from one point to another. There should be enough material in the body to make the presentation thorough, but not so much that it moves outside the time frame of a 3-4 minute presentation. For more information, see Chapter 6: Presentation Preparation. Conclusion: Your conclusion should restate the goal, review the main points, and complete the circular narrative. Explanatory strategies: The presentation outline should also note places where the speaker will use stories, analogies, examples, evidence, and other techniques to liven-up and better engage the audience For more information, see Chapter 8: Informative Presentations. Learning Outcome Demonstrate competency in planning, preparing, and presenting effective oral presentations."}, "6630572": {"name": "Informative I Presentation", "due_at": null, "description": "This assignment is the first part of a 2-part series of informative presentations: Informative Presentation I and Informative Presentation II. For the first informative presentation, y ou will prepare a 3-4 minute informative presentation about a topic of your choice. The purpose of your informative presentations is to inform, not persuade . In other words, you should strive to make your audience aware of an event, person, place, or thing ( speech of awareness) , demonstrate how to do something ( speech of demonstration) , or to increase understanding of a complex subject ( speech of explanation) . You should NOT discuss why your listeners should take a particular action. For more details about what makes a presentation informative, see Chapter 8: Informative Presentations. Your grade for this assignment will be determined by (1) meeting the presentation requirements and (2) providing quality feedback to your assigned peers. Presentation Requirements Time : 3-4 minutes. Presentation Aid : None. You will not use a visual aid for this presentation. Oral Citations : Three (For more details on credible sources and supporting materials, see Chapter 5: Information Literacy). Speaking Notes : To be determined by instructor. Learning Outcomes Demonstrate competency in planning, preparing, and presenting effective oral presentations. Use effective presentation techniques. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate an ability to listen carefully."}, "6630582": {"name": "Informative II Presentation", "due_at": null, "description": "Informative Presentation II (75 points) For this assignment, you will present an improved version of your first informative presentation. Y ou should incorporate the feedback you received from your instructor and peers on your first informative presentation. The purpose of your informative presentations is to inform, not persuade . In other words, you should strive to make your audience aware of an event, person, place, or thing ( speech of awareness) , demonstrate how to do something ( speech of demonstration) , or to increase understanding of a complex subject ( speech of explanation) . You should NOT discuss why your listeners should take a particular action. For more details about what makes a presentation informative, see Chapter 8: Informative Presentations. Presentation Requirements Time : 3-4 minutes. Presentation Aid : None. You will not use a visual aid for this presentation. Oral Citations : Three (For more details on credible sources and supporting materials, see Chapter 5: Information Literacy). Speaking Notes : To be determined by instructor. Learning Outcomes Demonstrate competency in planning, preparing, and presenting effective oral presentations. Use effective presentation techniques. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate an ability to listen carefully."}, "6630598": {"name": "Informative Self-Reflection", "due_at": "2024-03-14T16:30:00Z", "description": "Informative Self-Reflection (20 points) This assignment asks you to reflect on your performance during the Informative Presentation after watching the recording and getting your feedback. You will write a two-paragraph reflection: Paragraph I: Reflect on your presentation’s strengths and weaknesses after watching the recording. Paragraph II: Craft an action plan for improvement. Example: In paragraph one, you might state the following: \"I was reading from directly from my notes throughout the entire presentation.\" In paragraph two, you might provide a summary that states: \"My peer noticed that I did not have a clear conclusion for the presentation.\" Learning Outcomes Demonstrate an understanding of the role of oral communication in academic, social, civic, and professional endeavors. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate competency in planning, preparing, and presenting effective oral presentations."}, "6630609": {"name": "Persuasive Outline", "due_at": "2024-04-08T03:59:59Z", "description": "Persuasive Outline (40 points) You will submit an outline for the Persuasive Presentation. You should organize your outline using a nested structure and include full sentences. You may consider following an organizational structure, as explained in your textbook (i.e., comparative advantage, cause-effect problem-solution, Monroe's motivated sequence). Please be sure that your outline also includes the components of an introduction , body , and conclusion; as well as transitions, internal previews , and signposts . This outline will organize your entire presentation in full sentences. For more information, see Chapter 6: Presentation Preparation. Further guidelines: Research: Your outline must include seven (7) sources. These sources must support and reinforce the main ideas and claims made throughout the outline. They must come from credible sources, such as expert interviews, academic journals, and newspapers. All references to external sources must be attributed using complete and accurate in-text citations, must indicated in bold within the outline, and be properly formatted at the end of the outline. For more information on citation resources see the The Purdue OWL website Introduction: Your introduction should gain the audience's attention, provide a clear thesis statement, establish practicality, and preview the main points of your presentation. The attention grabber must hook the audience and draw them into the presentation. The purpose/central idea/thesis statement should narrow the topic. For more information, see Chapter 6: Presentation Preparation. Body: Your structure should make sense for the presentation. It should be arranged logically to present concepts. It should have artfully-constructed transitions between ideas. There should be enough material in the body to make the presentation thorough, but not so much that it moves outside the time frame of a 6-7 minute presentation. For more information, see Chapter 6: Presentation Preparation. Conclusion: Your conclusion should restate the goal, review the main points, and complete the circular narrative. Style: The outline should also note places where the speaker will use stories, analogies, examples, evidence, and other techniques to liven up and better engage us in the topic. For more information, see Chapter 11: Persuasive Speaking. Learning Outcome Demonstrate competency in planning, preparing, and presenting effective oral presentations."}, "6630618": {"name": "Persuasive Presentation", "due_at": null, "description": "Persuasive Presentation (175 points) In this presentation you will attempt to persuade your classmates to adopt/quit a behavior (e.g., meatless Mondays, composting, reusable water bottles) or address a policy (e.g., Purple Line construction, paying student-athletes, student fee allocation). Presentation Requirements Time : 6-7 minutes. Visual Aid : Required. See Chapter 9: Visual Communication. Oral Citations : Seven. For more details on credible sources and supporting materials, see Chapter 5: Information Literacy Speaking Notes : To be determined by instructor. Learning Outcomes Demonstrate competency in planning, preparing, and presenting effective oral presentations. Use effective presentation techniques including presentation graphics. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate an understanding of the role of oral communication in academic, social, and professional endeavors. Demonstrate an ability to listen carefully."}, "6630627": {"name": "Persuasive Self-Reflection", "due_at": "2024-04-16T18:00:00Z", "description": "Persuasive Self-Reflection (20 points) This assignment asks you to reflect on your how your performance changed/improved in your Persuasive Presentation. It also asks you to consider how you will develop a plan for improvement as we move into our Small Group Presentation. You will write a Two-paragraph reflection: the First will be small and the second will be the detailed paragraph while answering the questions. Paragraph I: Reflect on your presentation’s strengths and weaknesses of your Persuasive Presentation. Paragraph II: Looking forward to our Small Group Presentation, how can you continue to improve as a speaker? Craft a plan for improvement considering some or all of the following: (1) How will you select information and prepare it in a way that is interesting for your audience? (2) How will you improve your organization? (3) How will you continue to work on vocal delivery, eye contact, and body language? (4) What are some ways that you can continue to build a connection with your audience? (5) How you will you work on developing convincing arguments? (6) How will you work to incorporate emotional and logical appeals? Learning Outcomes Demonstrate an understanding of the role of oral communication in academic, social, civic, and professional endeavors. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate competency in planning, preparing, and presenting effective oral presentations."}, "6630644": {"name": "Small Group Outline", "due_at": "2024-04-25T18:00:00Z", "description": "Small Group Outline (50 Points) You will submit an outline for the Small Group Presentation. You should organize your outline using a nested structure and include full sentences. You may consider following an organizational structure, as explained in your textbook (i.e., problem-solution). Please be sure that your outline also includes the components of an introduction , body , and conclusion; as well as transitions, internal previews , and signposts . This outline will organize your entire presentation in full sentences. For more information, see Chapter 6: Presentation Preparation. Further guidelines: Research: Your outline must include ten (10) sources. These sources must support and reinforce the main ideas and claims made throughout the outline. They must come from credible sources, such as expert interviews, academic journals, and newspapers. All references to external sources must be attributed using complete and accurate in-text citations and be properly formatted at the end of the outline. For more information on citation resources see: https://owl.purdue.edu/owl/research_and_citation/resources.html Introduction: Your introduction should gain the audience's attention, provide a clear thesis statement, establish practicality, and preview the main points of your presentation. The attention grabber must hook the audience and draw them into the presentation. Body: Your structure should make sense for the presentation. It should be arranged logically to present concepts. It should have artfully-constructed transitions between ideas. There should be enough material in the body to make the presentation thorough, but not so much that it moves outside the time frame of a 13-15 minute presentation. For more information, see Chapter 6: Presentation Preparation. Conclusion: Your conclusion should restate the goal, review the main points, and complete the circular narrative. Style: The outline should also note places where the speaker will use stories, analogies, examples, evidence, and other techniques to liven up and better engage us in the topic. Learning Outcome Demonstrate competency in planning, preparing, and presenting effective oral presentations."}, "6630653": {"name": "Small Group Presentation", "due_at": null, "description": "Small Group Presentation (150 Points) This group presentation will ask you to work with a team of your classmates to identify a problem in your community (however you define the community) and to develop three solutions to this problem. The first part of your presentation should convince the audience that a problem exists; the latter half should emphasize different approaches to solving it. Presentation Requirements Time : 13-15 minutes Presentation Aid : Required. See Chapter 9: Visual Communication. Oral Citations : Ten. For more details on credible sources and supporting materials, see Chapter 5: Information Literacy. Speaking Notes : To be determined by instructor. Learning Outcomes Demonstrate competency in planning, preparing, and presenting effective oral presentations. Use effective presentation techniques including presentation graphics. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate an understanding of the role of oral communication in academic, social, and professional endeavors. Demonstrate an ability to listen carefully. Demonstrate skill in asking and in responding to questions."}, "6630649": {"name": "Small Group Peer Evaluation", "due_at": "2024-05-07T20:00:00Z", "description": "Small Group Peer Evaluation (30 points) You will evaluate the performance each of your group members on a 5-item rubric . Students’ grade for this assignment will be determined by the average of the scores given to them by their fellow group members. If you do not complete the Peer Evaluation, you will earn a zero for this assignment. Download this this small group evaluation rubric to complete for all group members and upload. This is not a group assignment so your group members will not see your responses."}, "6630659": {"name": "Small Group Statement of Mutual Expectations", "due_at": null, "description": "Small Group Statement of Mutual Expectations (20 points) Your group will fill out this form during Small Group Statement of Mutual Expectations Day. Upload one copy of your group's completed form here."}, "6630566": {"name": "Informative I Peer Feedback Day", "due_at": null, "description": "You will complete the Informative I Peer Feedback Day Activity as discussed in class."}, "6630588": {"name": "Informative Instructor Feedback Day I & II", "due_at": null, "description": "Instructor Feedback Conference You will complete a five-minute feedback conference with me via Zoom. We will discuss your Informative I presentation, and how to incorporate feedback, and I will answer any questions you may have about the Informative II Presentation. After this activity, you will have to upload/submit One paragraph in detail about the Instructor's feedback about your presentation One paragraph in detail about Peers' feedback about your presentation"}, "6630577": {"name": "Informative II Peer Feedback Day", "due_at": "2024-03-12T21:00:00Z", "description": "You will complete the Informative II Peer Feedback. The grading of your feedback will be based on two activities. First, you would write your feedback about three students and submit it here before March 12 Tuesday, before your class time. Second, You would share verbally this feedback with those students on Peer Feedback Day for Informative-II. Peer Feedback for Informative-II (9902).docx Peer Feedback for Informative-II (9909).docx"}, "6630632": {"name": "Persuasive Visual Aid Peer Feedback Day", "due_at": "2024-04-08T03:59:59Z", "description": "you will provide feedback to an individual or small group of peers for their visual aid using this checklist . You are not filling out this checklist but it should be used to guide your conversations. After providing and receiving feedback, complete this reflection in approximately one paragraph: What did you do well in terms of the visual aid? How will you improve your visual aid before the Persuasive Presentation?"}, "6630613": {"name": "Persuasive Outline Peer Feedback Day", "due_at": null, "description": "During class, you will be assigned a small group of peers for an outline feedback activity.  After providing and receiving feedback, complete this reflection in approximately one paragraph: What did you do well in terms of outlining? How will you improve your outline before the Persuasive Presentation?"}, "6630636": {"name": "Question & Answer Feedback Day", "due_at": null, "description": "This class will be specifically designed for Q&A. All the groups will meet with the instructor and discuss their questions about their group presentation."}, "6630641": {"name": "Small Group Check-In With Instructor ", "due_at": null, "description": "Your group will have a 15 minute check-in with me (adjust based on the number of groups you have) about your presentation. Your small group can choose to do the following with me: Practice your presentation Review visual aid with me Review the outline You should come to class during the following times. When you are not meeting with me your group should be practicing your presentation. Group 1: [insert time] Group 2: [insert time] Group 3: [insert time] Group 4: [insert time] Group 5: [insert time]"}, "6630486": {"name": "Quiz 1", "due_at": "2024-02-19T22:00:00Z", "description": "This Quiz will cover Chapter 2 and Chapter 8."}, "6630503": {"name": "Quiz 2", "due_at": "2024-02-06T19:00:00Z", "description": null}, "6630509": {"name": "Quiz 3", "due_at": "2024-02-13T19:00:00Z", "description": "This Quiz is from Chapter-3"}, "6630495": {"name": "Quiz 4", "due_at": "2024-02-13T19:00:00Z", "description": null}, "6630478": {"name": "Quiz 5", "due_at": "2024-03-26T18:00:00Z", "description": "This quiz is related to chapter- 10 \"The Persuasive Process\""}, "6630464": {"name": "Quiz 6", "due_at": "2024-03-28T18:00:00Z", "description": null}, "6630519": {"name": "Quiz 7", "due_at": "2024-04-02T18:00:00Z", "description": null}, "6630527": {"name": "Quiz 8", "due_at": "2024-04-16T18:00:00Z", "description": null}, "6630537": {"name": "Quiz 9", "due_at": "2024-04-23T18:00:00Z", "description": null}, "6630470": {"name": "Quiz 10", "due_at": "2024-05-13T20:00:00Z", "description": null}, "6630661": {"name": "Special Occasion Presentation", "due_at": "2024-05-15T16:30:00Z", "description": "Special Occasion Presentation (40 points) One of the overarching goals of COMM107 is to provide the skills and knowledge necessary to engage in presentational speaking situations that you will encounter in your academic, professional, personal, and civic lives. Drawing on the course, this recorded final exam asks you to prepare and deliver a creative individual presentation that allows you to practice giving “everyday” presentations (e.g., wedding toasts, speeches of introductions, acceptance speeches). Specific assignment details will be discussed in class. Special occasion presentations are most effective when they are relatively brief, heartfelt, entertaining, and well-suited to the audience. Presentation Requirements Time : 2-3 minutes is considered best practice Presentation Aid : Not required or expected. Oral Citation : None. Speaking Notes : To be determined by instructor. Learning Outcomes Demonstrate competency in planning, preparing, and presenting effective oral presentations. Use effective presentation techniques including presentation graphics. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate an understanding of the role of oral communication in academic, social, and professional endeavors."}, "6630604": {"name": "Outside Communication Activity ", "due_at": "2024-05-10T03:59:59Z", "description": "Outside Communication Activity (10 points) The Outside Communication Activity is designed to help you better understand the role of oral communication in academic, social, civic, and professional endeavors outside of our classroom. You will complete one hour of Outside Communication Activities throughout the semester. In this activity, you will choose from a combination of the following options: Participate in SONA research You can earn points by participating in communication research studies. Click on this link to access SONA opportunities online. These opportunities are on a first-come, first served basis. Visit the OCC to get help with your presentations. Attend an in-person or virtual event. Submission Information Below are examples of what your submission should look like after completing an activity. You should submit by the last day of classes in order to earn full credit for this assignment. I completed the SONA study [insert name] on [insert date] I completed an OCC appointment on [insert date] I attended [insert event name] on [insert date]. Your instructor will verify your OCC attendance, SONA participation, or event attendance (if applicable) on Reading Day. Your grade will be updated for this assignment shortly after Reading Day. Completion Examples Here are the different ways you can earn the OCA points: 1 hour of SONA research participation 1 OCC appointment 1 eligible event"}, "6630558": {"name": "Assessment ", "due_at": "2024-05-10T03:59:59Z", "description": "To understand your experience in COMM 107, the Oral Communication Program would like to know about how you define and understand civic engagement after taking COMM 107. This research study will include a short survey that will only take 15-30 minutes to complete, and your responses will be entirely anonymous. Your responses to this survey will NOT be connected to your name or any personally identifying information . Furthermore, your responses will not negatively or positively affect your grade, standing, or employability at UMD. If you choose not to complete the survey, you must complete an alternative assignment (Option 2) to earn credit for this assignment. This alternative assignment will also take approximately 15-30 minutes to complete, is no more difficult than completing the survey, and you will receive full credit for completion of this assignment. Option 1 (Participating in the Survey) The survey will take approximately 15-30 minutes to complete. Upon your completion of this survey, you will receive 10 points of course credit. Your responses will not be connected to your name or any personally identifying information, and your instructor will not be able to see your responses. To participate in this study you must be enrolled in COMM107 and be 17 years of age or older. Please take the survey here and leave this page open. Once you have finished the survey, you will be given a random number that you will need to enter into this ELMS assignment in order to receive credit. If you have questions about this research, you can contact: Lindsey B. Anderson, Ph.D. Associate Professor Co-Director of the Oral Communication Program lbander@umd.edu Option 2 (Alternative Assignment) To complete the alternative assignment please write a structured paragraph describing how, if at all, oral communication contributes to civic engagement. Please provide a definition of civic engagement and give a concrete example of how oral communication can facilitate/support civic engagement. To submit your paragraph, please click here (linked to Qualtrics survey) to access the anonymous submission survey. Once you have finished the survey, you will be given a random number that you will need to enter into this ELMS assignment in order to receive credit. Your instructor will not be able to see your response and you will not be graded on the quality or content of your response. You will receive 10 points for completing this assignment. Your submission to this survey will NOT be used as data for any research study. If you have any questions about the alternative assignment please contact: Lindsey B. Anderson, Ph.D. Associate Professor Co-Director of the Oral Communication Program lbander@umd.edu"}, "6713787": {"name": "Activity Ch. 2 & 8", "due_at": null, "description": null}, "6713788": {"name": "Activity Ch. 6", "due_at": null, "description": null}, "6745213": {"name": "Activity Ch. 3 & 4", "due_at": null, "description": null}, "6745214": {"name": "Activity Ch. 5", "due_at": null, "description": null}, "6745215": {"name": "Activity Ch. 10", "due_at": null, "description": null}, "6745216": {"name": "Activity Ch. 11", "due_at": null, "description": null}, "6745217": {"name": "Activity Ch. 7", "due_at": null, "description": null}, "6784982": {"name": "Activity Ch. 9", "due_at": null, "description": null}, "6784983": {"name": "Activity Ch. 13", "due_at": null, "description": null}, "6784984": {"name": "Activity Ch. 12", "due_at": null, "description": null}}, "files": {"76468589": {"display_name": "02 - Column.jpg", "url": "https://umd.instructure.com/files/76468589/download?download_frd=1&verifier=VuHwdPwrAITpdeMLJNQz8nydy5wZHZT3E4ysCssh"}, "76468582": {"display_name": "04 - Bleachers.jpg", "url": "https://umd.instructure.com/files/76468582/download?download_frd=1&verifier=g2cxHHQC0yGGQV7PHpQQ66xhSAZmsmsq6F5HRysL"}, "76468586": {"display_name": "05 - McKeldin.jpg", "url": "https://umd.instructure.com/files/76468586/download?download_frd=1&verifier=ahwDpjKpUa5Ow2vjVLOXmglYcq92xOTTpGRL8W0x"}, "76468576": {"display_name": "07 - Gate.jpg", "url": "https://umd.instructure.com/files/76468576/download?download_frd=1&verifier=2MzP6GuTZkpsU7kDPoGOyBKPNcKQUxUdWJ6SxKPB"}, "76468602": {"display_name": "09 - Aerial Big M.jpg", "url": "https://umd.instructure.com/files/76468602/download?download_frd=1&verifier=j30hoEqYT3x9Lt75Iwu42O64y7Pcw06GizJ5P6Fd"}, "76468575": {"display_name": "10 - Sundial.jpg", "url": "https://umd.instructure.com/files/76468575/download?download_frd=1&verifier=t62W5nIB15TljHIZTDq70R3cXAoaLZb6GyhlFlM8"}, "76468597": {"display_name": "16 - Students McKeldin Front.jpg", "url": "https://umd.instructure.com/files/76468597/download?download_frd=1&verifier=9I0ECKDNDwvoRJKutMp788dS6wncTsbKDQkBbOcH"}, "76468573": {"display_name": "18 - Crowd Flag.jpg", "url": "https://umd.instructure.com/files/76468573/download?download_frd=1&verifier=a2rSjRKxadtxLCiUCy6NXpCbI0T6g35ad2tyyj6s"}, "76468580": {"display_name": "21 - Finance.jpg", "url": "https://umd.instructure.com/files/76468580/download?download_frd=1&verifier=g4Tj8PJLUIpT1RNzxMK7Vk3gwYGlg6er9WEuEgNG"}, "76468584": {"display_name": "22 - Group Work.jpg", "url": "https://umd.instructure.com/files/76468584/download?download_frd=1&verifier=B0BbkHagr74hBlfZBrVA0sFaB2dRHAiH7dNfaKB8"}, "76468599": {"display_name": "23 - Long Exposure Campus.jpg", "url": "https://umd.instructure.com/files/76468599/download?download_frd=1&verifier=vU9yIv79revBLfOXkF0aIypbufg96mhHdWcHCvy0"}, "76468592": {"display_name": "26 - Reflection.jpg", "url": "https://umd.instructure.com/files/76468592/download?download_frd=1&verifier=HpLK5oZZYQMeTCwG5Xo2cQ2Ksd0w2NOwc20tfm8Y"}, "76468614": {"display_name": "Assessment Techniques.pdf", "url": "https://umd.instructure.com/files/76468614/download?download_frd=1&verifier=7CxM0iGANr92H1cC8Nr0sdXbpFee1dEt0mN8OIpZ"}, "76468618": {"display_name": "COMM107 Small Group Peer Evaluation.docx", "url": "https://umd.instructure.com/files/76468618/download?download_frd=1&verifier=NfdgTcuB6wv79LeWjoOOo0XgiDg1u4Aoqr2cTN6d"}, "76468621": {"display_name": "COMM107 Small Group Statement of Mutual Expectations.docx", "url": "https://umd.instructure.com/files/76468621/download?download_frd=1&verifier=so6vSPiJHpkCsG1sYMd6SHczNJevHoejSGeZ7ekB"}, "76958764": {"display_name": "Example of Info Outline.pdf", "url": "https://umd.instructure.com/files/76958764/download?download_frd=1&verifier=E3fNmKAN6aPANNv9hSPq4ZTrDEZG2i02DyvT6y13"}, "76468611": {"display_name": "Learning Outcomes & Bloom's Taxonomy.pdf", "url": "https://umd.instructure.com/files/76468611/download?download_frd=1&verifier=IkFcx6RlvSwJ54ILiPhcq0mMONUt6XOjBSbj6RUC"}, "77631597": {"display_name": "Peer Feedback for Informative-II (9902).docx", "url": "https://umd.instructure.com/files/77631597/download?download_frd=1&verifier=1fqiFzwkBfSjMvpmRFborzkaoU6jBvQWzPGzrzGL"}, "77631596": {"display_name": "Peer Feedback for Informative-II (9909).docx", "url": "https://umd.instructure.com/files/77631596/download?download_frd=1&verifier=DXJdFSTRgBSTmyZ4HyzChG8OBym98egiqxOphfzZ"}, "77152880": {"display_name": "Peer Feedback Performa (Informative-I).docx", "url": "https://umd.instructure.com/files/77152880/download?download_frd=1&verifier=SIePio1M8cQR5IerAe3gFcnKilQXdGpdzm65HSup"}, "77152865": {"display_name": "Schedule for Informative-I (9909).pdf", "url": "https://umd.instructure.com/files/77152865/download?download_frd=1&verifier=eYtsBs4LQ737bDf9BjR96Jh9x1OeooAhO4vDIxMn"}, "77315187": {"display_name": "Schedule for Instructor feedback Day-I (9909).pdf", "url": "https://umd.instructure.com/files/77315187/download?download_frd=1&verifier=ndJWG6WwgNlpNUk7Z49H7VSCO1B2nrDZiIY0ZkAH"}, "77315840": {"display_name": "SCHEDULE for Instructor Feedback(9902).docx", "url": "https://umd.instructure.com/files/77315840/download?download_frd=1&verifier=E06MB0Iile75oUojSpOlVx17VK2miyWfKepvt9UZ"}, "77152862": {"display_name": "SCHEDULE INFORMATIVE PRESENTATIONS (9902).pdf", "url": "https://umd.instructure.com/files/77152862/download?download_frd=1&verifier=z4lyN5GE6R83Q1fIuryakIEvoTOkTJw5NgU3EN3h"}, "76468594": {"display_name": "Shoemaker_Banner.jpg", "url": "https://umd.instructure.com/files/76468594/download?download_frd=1&verifier=mmJuRStzb4ipOf4F4Gb5fOr0YJ9wukZcqbnqWXUy"}, "76468607": {"display_name": "VitalSource_Instructions-UMD-Presentations.pdf", "url": "https://umd.instructure.com/files/76468607/download?download_frd=1&verifier=KWh0ilgumZKqNNqaX6Ni10pUEOzy4otG9O0DegCW"}}}, "1375018": {"name": "Computer Science Undergraduate Advising 2024-2025", "assignments": {}, "files": {}}, "1374760": {"name": "CS TA Training 2024-2025", "assignments": {"6822408": {"name": "Teaching Assistant Training", "due_at": null, "description": "All new Teaching Assistants in Spring are required to attend a TA Training hosted by Elias Gonzalez. You should have received an email about registering for this training."}, "6822406": {"name": "Online Training: FERPA", "due_at": "2024-09-28T03:59:00Z", "description": "Please complete FERPA tutorial through the following link: https://umd-registrar.catalog.instructure.com/courses/umd-ferpa-tutorial The tutorial takes approximately 10 minutes to complete. Once you are finished with the tutorial, please take a screenshot of completion and upload it here."}, "6822405": {"name": "Online Review: Sexual Misconduct", "due_at": "2024-09-28T03:59:00Z", "description": "Please read the following documents in regard to Sexual Misconduct Policy: https://ocrsm.umd.edu/sites/default/files/2021-05/SM%20Policy%20Summary%202020_0.pdf https://ocrsm.umd.edu/sexual-misconduct/reporting-obligations-faculty Answer the following questions in a text entry: Who is a mandatory reporter? To whom should you report incidents of sexual misconduct? For more details, please visit: https://ocrsm.umd.edu/sexual-misconduct"}, "6822404": {"name": "Online Review: Mutual Expectations Agreement", "due_at": null, "description": "The specific duties of Graduate Teaching Assistants (TAs) vary across disciplines and departments. For the majority of teaching assistants, however, assignments and responsibilities fall into four categories: Assuming teaching responsibility for a laboratory or discussion session of a course; Assuming teaching responsibility for a classroom section of a multi-sectional course, under the close supervision of the director(s) of the course; Assisting a faculty member in the grading, advising, and administrative duties necessary for a course(s); Assisting in general departmental administrative duties, such as advising or the administration of community programs, workshops, etc. Within a department, the particular assignment depends on the department's needs and the experience and academic qualifications of the TA. All graduate TAs serving in any capacity are under the direction and close supervision of a member of the faculty. Prior to the start of the assistantship, supervising faculty member and the TA will meet to review and confirm expectations including a summary for the nature of required duties. To facilitate the discussions, a Statement of Mutual Expectations for Teaching Assistants can be found on the Graduate School website. This is a policy recommendation from the Graduate School. In the Department of Computer Science, we also feel that this policy is applicable to TAs (both graduate and undergraduate). If you have questions or concerns please email class-concern@cs.umd.edu"}, "6822397": {"name": "Mandatory Reporting Assessment", "due_at": "2024-09-28T03:59:00Z", "description": "Before taking this quiz, please review the following links: https://ocrsm.umd.edu/sexual-misconduct https://ocrsm.umd.edu/sexual-misconduct/reporting-obligations-faculty"}, "6822401": {"name": "Implicit Bias Reflection ", "due_at": "2024-09-28T03:59:00Z", "description": "Text University of Maryland Regulations Diversity and Inclusion Diversity and Inclusion Diversity and Inclusion Files Files Files Files #7 Implicit Bias Reflection In the Diversity and Inclusion module, there is a link to access Harvard's Implicit Bias IATs (it can also be accessed at the top of this page). Selecting the link will take you to the Project Implicit homepage. From there, select \"Project Implicit Social Attitudes\". Read through the preliminary information and select that you would like to proceed. From here you will be able to access various IATs. For the purpose of this course, you only need to complete the Gender-Career IAT and the Race('Black - White' IAT) but highly recommend going through a few others. The purpose of this activity is in no way intended to penalize you for your implicit biases nor is it an assessment of your perceptions. This activity is intended to better help you build awareness of your biases in order to address inclusivity in your classroom. In your response, we urge you to think critically about these assessments. Does this align with your initial perceptions going into the assessment? What surprised you most when taking these assessments? As an educator, how do you think this may affect your classroom? Will this influence what teaching strategies you choose to use, and if so, how? (Note: You do not need to discuss the findings of this assessment unless you choose to. This is primarily intended to be a reflection for your own purposes) Icon Progress Bar/Navigation (built in browser, hidden in app)"}, "6822400": {"name": "Action to Determine TA Responsibilities", "due_at": "2024-09-28T03:59:59Z", "description": "Once you have read through the overall responsibilities section, it is important to verify you know the individual expectations your supervising instructor has for you and what you can expect from your supervisor.  The University has created a checklist of things you should discuss with your instructor at the beginning of each semester. The checklist is generic, and not all the entries will apply to you. You should review the checklist carefully and discuss all relevant items with your course instructor. (If you are unsure whether an item is relevant, ask your instructor.) For this assignment, you should submit a list of answers to the topics posed in that document (select the topics that you found most relevant as you had this discussion with your instructor). Take notes, turn that document into a PDF document, and submit this PDF document. If you are an undergraduate TA, please ignore the references to 'Graduate Teaching Assistants' and fill all fields. You may include (Undergraduate TA) next to your name for clarification."}, "6822407": {"name": "Reflection on Responsibilities and  Expectations", "due_at": "2024-09-28T03:59:00Z", "description": "List the 7 things you found most important in this section. (These could be deemed important because they caused you to think about your own teaching or they could be important because they were so clearly addressed or missed in the meetings with your instructor.) In general, these are the 7 points you want to be sure you remember as you go through this semester."}, "6822403": {"name": "Names and Pronouns", "due_at": "2024-09-28T03:59:00Z", "description": "Reference for Names and Pronouns: https://lgbt.umd.edu/good-practices-names-and-pronouns ELMS specific reference: https://itsupport.umd.edu/itsupport?id=kb_article_view&sysparm_article=KB0010354 Update the tools you will be using to give students your pronouns and the pronunciation of your name."}, "6822395": {"name": "Disability Reflection", "due_at": "2024-09-28T03:59:00Z", "description": "Answer these reflection questions after watching the \"Disability Sensitivity Training\" video and reviewing the documents under the \"Addressing Disabilities\" module."}}, "files": {}}, "1355727": {"name": "ENGL101-9029: Academic Writing-Fall 2023 jam", "assignments": {"6502574": {"name": "Summary Peer Review", "due_at": "2023-09-08T03:59:59Z", "description": "In addition to answering these questions, please make at least three substantive comments on your partner’s paper in the DocViewer. You may type your answers to these questions directly into the comment box on the page you accessed your partners paper or copy and paste your answers from another document into the box. Alternatively, you may download your partner's paper and comment and answer the questions directly on the doc. Then upload using the attachment button (paperclip icon). This assignment is solely to give you access to the questions and so that I can give you credit. You will not submit anything to this assignment; instead, submit on the page where you accessed your partner's paper. Does the summary introduce the author, title, publication title, and publication date early in the paper? Do you have enough context to understand what is going on? Does the summary articulate clearly and concisely the author’s main argument in the first few sentences? Does the first paragraph catch your interest and make you want to keep reading? Does the summary relate supporting ideas and evidence that form the ‘big picture’ without getting sidetracked with extraneous detail? Note on the summary if something seems unnecessary. Does the summary define key ideas/terms ? Are the definitions/explanations clear to you as a member of the summarizer’s audience? If the summary doesn’t define key terms, where might they be inserted? Make sure to mark it on the paper if you have a suggestion. Does the summary use author tags throughout to remind the reader that these are the author’s ideas? Is there a mix of (properly) quoted material and paraphrased material ? Are the quotes striking? Do they do something useful for the summarizer or do they just seem to be stuck in there? Are they sandwiched? Note on the summary if a quote seems particularly useful or not. Does the summary maintain an objective tone ? Or does the summarizer add his or her opinion? You shouldn’t be able to tell if the summarizer agrees with the author’s argument or not. If you can, indicate where you detect opinion, evaluation, or analysis. Look at the arrangement. Does the organization of the summary make sense? Are the main ideas or themes chunked together? Is it missing a major idea or theme? Are the chunks arranged effectively or do they merely recreate the order of the essay? Are any sentences confusing to you because they are too long, complicated, or generally unclear? Are there sentence fragments? If there are paragraph breaks, do they make sense? Also: are there any sentences that strike you as particularly elegant, useful, or well put?"}, "6502570": {"name": "Rhetorical Analysis Peer Review", "due_at": "2023-09-22T03:59:59Z", "description": "Reminder: Submit your 3+ DocViewer comments and answer these questions on the Summary Draft Assignment where you first accessed your partner's paper. No submissions to this assignment, which is only here to give you access to the questions and so I can give you credit for completing it. Does the thesis statement clearly argue that the article is effective/persuasive (or ineffective/unpersuasive) and give reasons why? Does the paper briefly summarize the main claim(s) of the article? Does the paper explain the rhetorical situation? In other words, as a reader, do you understand who the speaker is, what the message is, and who the intended audience is? Does the paper explain the article’s use of rhetorical strategies and appeals without merely listing them? Does it discuss the purpose and effect of these rhetorical moves? Why does it use an appeal and to what effect? Does the paper discuss how the author’s rhetorical strategies meet the needs and expectations of the audience? Does the paper use topic sentences for each paragraph that both preview what is in that paragraph and connect back to the thesis? Do they introduce evidence and analyze that evidence to back the claim made in the topic sentence? Is the paper as clear and concise as possible? Are there any particular strong statements? Are there any sentences that you don’t understand or have questions about? Please indicate on the paper itself. Are quotations “sandwiched” and not dangling (i.e. are they introduced and explained)?"}, "6502554": {"name": "Inquiry Draft Peer Review", "due_at": "2023-10-13T03:59:59Z", "description": "Please remember to leave at least five DocViewer or in-text comments, as well as answering these questions (either in textbox or in an attached doc). Rather than yes or no responses, please elaborate. Be specific! Does the inquiry identify and contextualize the issue? Does it establish exigence early on, perhaps with a personal anecdote or other hook? Does the inquiry pose insightful, complex, and open-ended questions? Does it ask a range of important or central questions about the topic? Does the inquiry synthesize multiple perspectives on and responses to the question to demonstrate how experts and stakeholders are understanding and engaging this issue? In other words, does it establish the conversation around the topic? Does the inquiry define key ideas/terms ? Are the definitions/explanations clear to you as a member of the audience? Does the inquiry cite relevant research on the topic ? Are the quotes striking? Do they do something useful for the summarizer or do they just seem to be stuck in there? Are quotations sandwiched? Note on the inquiry if a quote seems particularly useful or not. Does the inquiry remain open-ended or can you discern the inquirer’s opinion on the topic? In other words, does inquiry turn into argument? Mark if so. Look at the arrangement. Does the organization follow a line of inquiry? Do the questions asked follow in a logical sequence (for instance, broad to more specific)? Does one question’s response lead to another question? Are the sentences clear and concise ? Are sentences confusing to you because they are too long, complicated, or generally unclear? Are there sentence fragments? Is there variety in sentence length? Are there any sentences that strike you as particularly elegant or useful?"}, "6502563": {"name": "Position Paper Peer Review", "due_at": "2023-11-17T04:59:59Z", "description": "For this Peer Review, please be sure to leave at least six comments on the paper itself (either by downloading and commenting or by using the DocViewer) and answer the following questions in the comment box. Does the introductory paragraph have a hook that establishes exigence ? Is there an appropriate amount of context that allows you to understand the issue and what's at stake? Does the introduction end with a clear thesis statement and partition that acts as a roadmap of the argument? Does the writer effectively use positive evidence (confirmation)? Do paragraphs have topic sentences that state the main point or claim of the paragraph? Does the paper use refutation effectively (i.e., not too much or too early)? Make note of these things on the paper. How is evidence used? Is there a mix of paraphrasing and strong quotations ? Are quotes incorporated using the sandwich method (introduced, given, and explained)? Are the parenthetical citations with page numbers cited correctly in MLA style? Does the writer use enough author tags that you can easily discern whose ideas are being discussed at any given moment? Does the writer analyze evidence and explain how this evidence advances his or her argument? Mark points on the paper where you need more justification for claims or if the evidence or justification is unclear. How is the paper organized? Is the arrangement effective? Does the writer use transitions between paragraphs and the known-new contract between sentences? Are the transitions used properly? Underline transitions used and also mark where transitions might be needed. Are there sentences that can be combined reduce accidental repetitions or redundancy? Mark them if so. Analyze the conclusion. Does it do more than restate the thesis? Does it synthesize the claims made into something greater than the sum of its parts? Does it seem necessary or just tacked on? Is there a clear takeaway point? Check for concision and clarity . Are there sentences that are wordy or phrased awkwardly? Do sentences start with expletives (i.e., There is; The fact is, etc.)? Too many prepositional phrases piled up? Unnecessary relative pronouns (who, which, whom, whose, that)? Nominalizations that lead to the passive voice (a verb turned into a noun, e.g. believe into belief)? Mark them on the paper. Check the works cited (if available). Are there a minimum of fifteen sources total including ten scholarly sources (generally you’ll be able to tell if the source is from a journal with volume and issue number or an academic press for books)? Is the works cited in correct MLA style ? Is the first line of each citation flush left? Do the subsequent lines have a hanging indent? Are the citations uniform (i.e., the same font and color, no block capitalization, etc.)"}, "6502550": {"name": "Infographic and Reflective Memo Peer Review", "due_at": "2023-12-06T04:59:59Z", "description": "Please answer the following questions. Additionally, leave directed and constructive feedback in a comment on what you thought worked well, what might be improved, and any other constructive feedback that you might have. Can you tell who the target audience of the infographic is? How does your partner appeal to common beliefs, assumptions, or values of this audience? Is the arrangement of the infographic clear? How is the information presented? Does the infographic have a clear visual narrative that is intuitive for readers to navigate? Does the infographic have a consistent set of fonts? Is the color scheme visually interesting, but limited? Are graphics consistent? Does the infographic have a good balance of text, graphics, and negative/blank space? Is it too crowded or busy? Overall, do the design choices—font, color scheme, images, icons, and/or graphics—reflect the message and overarching project of the website? How do these design choices add depth to the message and help your partner to reach their audience? If reflection included: does reflection identify substantive translations and give the rationale or justification for that change given the new audience and medium?"}, "6502547": {"name": "In Class Participation", "due_at": null, "description": null}, "6502539": {"name": "About Me", "due_at": "2023-08-30T03:59:59Z", "description": "For today's activity, please use the text box to answer the following questions. Your answers will not be shared with your classmates; they are just to give me a sense of who you are, where you're at, and what you're hoping to accomplish in this class. No wrong answers! Due by 11:59pm tonight if you don't finish in class. Your preferred name (especially if you go by a nickname or your name is different than what is on the class roster). You might also include the pronouns that you use (e.g., I use he/him/his pronouns). Is there anything you would like me to know about your living and/or educational situation so that I can try to help you learn? What is your experience with writing? With English or writing classes? What do you hope to get out of this class? What is the last thing you read (excluding these instructions): could be a book, website, a text message, an email, whatever. Favorite singer, rapper, band, TV show, movie, sports team, podcast, food, or city? (Just pick one—you don't need to answer each category)."}, "6502564": {"name": "Proposed Thesis", "due_at": "2023-11-03T03:59:59Z", "description": "Please propose a thesis for your Position Paper. Your thesis should have a clear and debatable claim about the issue. You should also detail the specific arguments you will use to justify this thesis (this part is called \"the partition,\" or what I call a road map to your argument; it can be part of the thesis statement or a separate sentence (or sentences) immediately following the thesis statement). It's okay if this is a working thesis—it doesn't have to be set in stone. But I do want a sense of where your argument is headed so that I can provide feedback. Here are some basic templates to get you started if you're stuck. You only have to propose one thesis, though! examples of thesis and partition in same sentence: I argue X because A, B, and C. The federal government must ban X because A, B, and C. examples of thesis followed by partition sentence: I argue X. I will do so by arguing A, B, and C. My proposal is X. It argues A, B, and C for reason Y. example of thesis followed by partition sentences: I argue X. First I will argue A. Next I will examine B. Finally, I will suggest C. I conclude Y."}, "6502543": {"name": "Considering Another Side", "due_at": "2023-11-08T04:59:59Z", "description": "For this exercise, I want you to consider another side. You will construct a hypothetical argument that differs from the argument you wish to make in your Position Paper. This hypothetical argument need not be the opposite; it just has to be different. The purpose of this exercise is to get you thinking about how a reasonable person might arrive at a position that you disagree with (or think is less compelling than your own). You will do so by: composing a clear, specific, and positively worded claim/thesis for a position on your topic that is different from the position you will argue in the Position Paper. composing a partition, or road map, that lays out three reasons for this other position that you would (hypothetically) use to justify this position. This can either be a part of the thesis or a separate sentence. For each reason, give a brief justification. Here’s some tips for completing this exercise. 1. Stating your ‘other side’ claim in a positive way To complete the first part of this exercise, you want to state a position different than your own position—not necessarily the opposite—in a positive way. Instead of arguing against your own position, you want to argue in favor of the other proposition that you are advancing as if it were your own. To do this, you will want to avoid simply negating your (real) Position Paper’s thesis. For example, if your actual position is: The University of Maryland should block student users from access to social media such as Facebook, Instagram, and TikTok. Avoid merely turning your positively stated position into a negative one: The University of Maryland should not block student users from access to Facebook, Instagram, and TikTok. Instead, you want to formulate a positive argument for a different position: The University of Maryland should protect students’ rights to free expression and allow them to continue using social media such as Facebook, Instagram, and TikTok. Note that it’s possible that you may have to restate the argument and/or change stases in order to make a positive argument. 2. Partition Once you have a thesis, you want to make a partition, or road map, that gives three reasons for this position. This can be part of thesis (e.g., I argue X for reasons A, B, and C.) or a separate sentence (I argue X. I will do so by arguing A, B, and C.) You don’t have to believe these reasons personally—this is a hypothetical situation to help you understand why someone else might think this way—but you also don’t necessarily have to make claims you feel totally uncomfortable making (remember: it doesn't have to be the opposite opinion, just a different opinion). You also don't want the reasons to be clichés or stereotypes. Think about what a reasonable person who actually holds this position would use to justify it. Put yourself in their shoes. What are their beliefs, values, assumptions, or goals? Why do they believe what they believe? What would be the most effective evidence for their position? What is the most convincing argument you could make from their standpoint? While you don’t necessarily need to cite them for this exercise, you can draw on your research. Have you found articles that have different viewpoints than you? What evidence or justifications do they put forth? Use these to guide your reasoning. You want to make it convincing, compelling, and realistic. I shouldn't be able to tell that this isn't actually your position. 3. Justifications Now that you have three reasons to back your thesis, give a brief justification (1-3 sentences) that explains why a reasonable person would choose each of these reasons to argue this position. How does this reason help them to make a compelling argument? How does it advance their position? Why is this an effective reason for this argument? Please let me know if you have questions or concerns."}, "6502558": {"name": "Planting a Naysayer", "due_at": "2023-11-10T04:59:59Z", "description": "For this activity, you will be responding twice to a viewpoint you don't agree with in order to refute it in two different ways. In other words, you will produce two different paragraph-length refutations of that viewpoint. Feel free to use your 'other side' thesis, reasons, or justifications from the Considering Another Side activity as the naysayer you will plant into your text. Then concede what, if anything, you agree with in that thesis, reason, or justification, before refuting the claim with your own argument and evidence. Remember you can refute in many ways: you can argue with the claim, the reasons, or the justifications. You can provide counter-evidence. You can quibble with definitions, facts, methods, or interpretations. You can agree with some of the reasons and refute others. And so on. Be creative! If you can back your refutation with evidence from one of your research sources, even better! Example: If your 'other side' thesis was: \"I propose free pizza for all UMD students on Friday afternoons because college students are hungry, pizza is delicious, and this plan would build better relations between students and the university.\" ... then you want to plant that as a naysayer and refute some or all of it in TWO different ways. 1. Some might argue that UMD students should get free pizza on Fridays because college students are hungry, pizza is delicious, and this plan would build better relationships between students and the university. I agree that students are hungry and pizza is delicious—who wouldn't? However, pizza is expensive and if the university provided it every week, it would quickly become so expensive that UMD would have to raise tuition costs or charge additional student fees to cover it. Therefore, this plan would ultimately strain relations between students and the university rather than improve them. 2. Others have proposed that UMD students should get free pizza on Fridays because college students are hungry, pizza is delicious, and this plan would build better relationships between students and the university. However, this is a top down policy that rests on faulty assumptions. Some students don't like pizza and others may even be allergic to its ingredients. Why should pizza lovers get free food every week and these equally deserving students get nothing? I argue that the more equitable way to improve student relations with the university is to give each student $15 a week instead so that they can choose what they want to eat. In this model, everyone is happy and student-administration relations will improve. (If you want to review planting a naysayer, here's a lecture from a previous semester.)"}, "6502567": {"name": "Reverse Outline", "due_at": "2023-11-17T04:59:59Z", "description": "For this assignment, create a reverse outline of your current draft of the Position Paper. If you have a full draft, I'd recommend pulling out the topic sentences. If you have a less complete draft, summarize or give the main idea of each paragraph instead. In order to do so: Create a new document. Copy and paste your thesis and topic sentences into the new document and number them in order. Answer the following questions: Are you using topic sentences that state the main point or claim of the paragraph? Are there any paragraphs that need clearer topic sentences? [If so, you should probably revise for your final draft.] Does the reverse outline you've made tell a story (more or less)? Can you follow the argument from the topic sentences alone? [If not do you need stronger topic sentences? Or is arrangement the issue?] Is there a paragraph that seems out of order based on the outline you've created? If so, should it be cut? Or slotted elsewhere and why? [Then you should probably revise the final draft with this understanding in mind.] How useful or not useful did you find the act of reverse outlining?"}, "6502566": {"name": "Research Topic Proposal", "due_at": "2023-10-04T03:59:59Z", "description": "Now that you have had a chance to think of potential topics and search a bit on library day, please submit one research topic for my final approval. While this is not set in stone, you should be fairly committed to pursuing this topic at this point. I will provide feedback as to the research topic's viability. What is your proposed topic? It can be broad at this point (and you don't need an issue, opinion, or argument yet!) What is your investment or interest in the topic? List at least two initial questions you have about the topic. If you already have an opinion on the topic, do you think you will be able to consider other (and even possibly opposing) viewpoints as you begin to research?"}, "6502571": {"name": "Source Grid", "due_at": "2023-10-20T03:59:59Z", "description": "Description: For this activity, you will cast a wide net to find and evaluate viable sources for your semester topic. The sources you collect for the purposes of this activity will likely be popular (yet credible!) . The goal here is to see what broad and interesting public conversations are being had about your topic. To that end, you’ll fill out a grid with a variety of these sources. This grid is the first step in your ongoing research project. Skills used: Evaluating popular sources, finding a range of perspectives and positions, distinguishing between different genres of popular sources, analyzing genre, purpose, and intended audience of texts (sources) Number of sources: 5 Step 1. Finding Sources for the Grid : Hunt on Google, Twitter, and/or other platforms you use to scavenge five (5) sources that meet some of the criteria listed below. You may include social media sources, but be sure to consider the ethos of the author. Sources may check off more than one criterion. Identify sources that are: Written by an expert Written by another expert with a very different argument/perspective Written by a non-expert with personal experience with the issue Written by an academic but not an academic article Written by a professional “commentator” (e.g., former athletes now on ESPN or former politicians turned news commentators) Written by someone who’s changed their mind on the issue Written by someone who incorporates lots of different voices into their article/blog post/ video Published on a widely-read platform Published on a less widely-read platform Written to fellow experts Written to people who may not be experts but are still knowledgeable on the topic Written to a general audience Written with little-to-no personal voice/ perspective Referenced within an article or piece you’ve found and/or linked to in another one of your sources Note: This list is not exhaustive. Your goal is simply to get a wide range of sources, and this list is designed to help you think about different ways to define “range.” You are welcome to include sources that don’t seem to meet any of these criteria. Step 2. Source Grid Format: As you find viable sources, create a Source Grid for them with the following categories. I'm less concerned about the formatting of the grid that I am with you finding five sources and noting this information. It might be easier to read if you set your word processor layout on landscape view. If you need extra explanation, you can watch this video (although note that the video says eight sources and you only have to do five!)"}, "6502551": {"name": "Infographic Proposed Audience Activity", "due_at": "2023-12-01T04:59:59Z", "description": "Aside from demonstrating you can make rhetorically effective choices in a new medium, the other main component of the infographic is a clear sense of audience and an argument tailored to that audience. For today's activity, I want you to think about what audience you might wish to address with your infographic. Some things to keep in mind: Your audience should be a public audience, but must be more specific than \"the general public.\" Yes, anyone might read it, but who are you targeting specifically with your appeals? Your audience should be non-expert, but they can be familiar with the topic (or not). If they are familiar, they can be sympathetic, neutral, skeptical, or hostile to the argument. If they are not familiar, you may have to spend more time providing context or defining key terms. Activity Prompt: Please list two specific audiences that you might target with your infographic. For each proposed audience, please note: why your topic/argument would be relevant to this audience (be specific!) what sorts of beliefs, values, assumptions, level of prior information, etc., do you expect this audience to have and why? how tailoring to this audience might change how you present or frame your argument from the Position Paper"}, "6565409": {"name": "Beginning Student Survey", "due_at": "2023-10-20T03:59:59Z", "description": "Please complete the following Beginning Student Survey Links to an external site. by 11:59pm on Thursday, 10/19 if you are a first year or transfer student. If you have already completed in another class, you should not complete the survey again. Instructions for the 2023 Beginning Student Survey The Campus Assessment Working Group is conducting its annual survey of new first-year students, the Beginning Student Survey (BSS). This year, the BSS will be administered online in class from October 16 – October 27, 2023. Ten minutes will be set aside in class to take the survey. You can use a phone, tablet, or laptop to take the survey. The survey link will be provided to you in class. You only need to take the survey once. However, you may have more than one class where the survey is administered. In this case, be sure to select all applicable courses when the survey asks where you’re taking it. Then you don’t need to take it again. Past results have helped inform decisions regarding student resources and services and are shared regularly with senior leadership. If you are interested in reports created with past survey data, visit https://irpa.umd.edu/CAWG/cawgreports.html Links to an external site. . Thank you for participating in this important project! Frequently Asked Questions If I can’t take the survey in class, what should I do? You can take the survey outside of class during the survey period using the survey link. If I can’t finish the survey in class, what can I do? If you use the same device and browser, you can use the same link and it should pick up where you left off. If you used an incognito tab or something similar, you won’t be able to resume and will have to retake the survey from the beginning. If I already took the survey in one class, should I take it in another? You only need to take it once, but be sure to select all applicable courses when the survey asks about them. If I can’t access the survey, what should I do? Try clearing your cookies in your browser, or to try opening up the survey in a new browser or incognito window. How will survey data be used? Student responses are confidential; summarized responses will be used to identify and create resources and policies to improve their experience at UMD. Contact Information If you have questions, please contact the Campus Assessment Working Group though the Office of Institutional Research, Planning and Assessment: Office of Institutional Research, Planning and Assessment (IRPA) Campus Address: 1101 Clarence M. Mitchell Jr., Building Phone: 301-405-5590 Campus Assessment Working Group (CAWG) Website: http://irpa.umd.edu/CAWG/ Links to an external site. Email: cawg@umd.edu"}, "6576283": {"name": "Proposal Argument Activity", "due_at": "2023-11-08T04:59:59Z", "description": "For this activity, briefly answer the following questions about Baker - The Cost of Business on Wall Street _ Opinion _ The Guardian.pdf . What is the issue/problem that Baker's proposal addresses? What is his proposed solution to the issue? What justification(s) does he give for his proposal? What does the proposal entail, e.g., what (if any) are the specific steps that would be taken to address the issue? Is this a practical proposal or a policy proposal? (For definitions of these terms, see video lecture.) Is Baker's proposal argued from principle, consequence, or resemblance, and how can you tell? (See video lecture.)"}, "6502573": {"name": "Summary Draft", "due_at": "2023-09-07T15:00:00Z", "description": "A primary concern for us throughout the semester will be to consider what it means to enter an academic conversation. Successful academic writing and research depends upon the ability of a writer to summarize, analyze, synthesize, and respond to the ongoing conversation about a particular issue. Summarizing involves listening in on the conversation that other academics are having about a research topic and demonstrating an understanding of the claims, evidence, and controversies surrounding the topic. The ability to write an effective summary might be the most important writing skill a college student can possess. You need to be able to summarize before you can be successful at most of the other kinds of writing that will be demanded of you in college. Assignment Write a summary of “The Living Death of Solitary Confinement” by Lisa Guenther. Your summary will be about 300 words long and should be double-spaced. Audience Your audience for this summary is other students at UMD, but should be academic in tone. You might think of your summary as if it might be posted on a course website to summarize the article for an absent classmate who wasn't able to do the reading. Writing the Summary This summary will demonstrate that you have closely read Guenther’s blog post. Remember, you are summarizing, not analyzing or responding. You should report objectively (and, since you have just 300 words, concisely) Guenthers’s argument, her support, and a sense of how she constructs that argument. Don’t forget a specific, informative title! To achieve your purpose with your audience, use the following strategies in your summary: Introduce the text in the beginning of your summary so your readers know which text you are summarizing. Include the author’s name, title, the date of publication, and where it was published within the first few sentences. Including this information means that a Works Cited is not necessary for this assignment. Focus on the writer’s arguments by reporting the text’s thesis. Show that you understand the “ big picture ”—the writer’s main point. Maintain the focus on the overall argument of the article: the main points that the author make to support their thesis. Avoid giving too many specific examples or extraneous detail. You can generalize about the types of evidence or methods of arguing she employs to support her argument. You will want to include some of the key phrases or terms that are central to her argument and an explanation of what those mean and how they are used. Use “ author tags ” so that your reader understands that you are reporting the author’s ideas rather than suggesting they are your ideas. Use an objective tone and a mix of paraphrased and quoted source material ."}, "6502572": {"name": "Summary", "due_at": "2023-09-13T03:59:59Z", "description": "A primary concern for us throughout the semester will be to consider what it means to enter an academic conversation. Successful academic writing and research depends upon the ability of a writer to summarize, analyze, synthesize, and respond to the ongoing conversation about a particular issue. Summarizing involves listening in on the conversation that other academics are having about a research topic and demonstrating an understanding of the claims, evidence, and controversies surrounding the topic. The ability to write an effective summary might be the most important writing skill a college student can possess. You need to be able to summarize before you can be successful at most of the other kinds of writing that will be demanded of you in college. Assignment Write a summary of “The Living Death of Solitary Confinement” by Lisa Guenther. Your summary will be about 300 words long and should be double-spaced. Audience Your audience for this summary is other students at UMD, but should be academic in tone. You might think of your summary as if it might be posted on a course website to summarize the article for an absent classmate who wasn't able to do the reading. Writing the Summary This summary will demonstrate that you have closely read Guenther’s blog post. Remember, you are summarizing, not analyzing or responding. You should report objectively (and, since you have just 300 words, concisely) Guenthers’s argument, her support, and a sense of how she constructs that argument. Don’t forget a specific, informative title! To achieve your purpose with your audience, use the following strategies in your summary: Introduce the text in the beginning of your summary so your readers know which text you are summarizing. Include the author’s name, title, the date of publication, and where it was published within the first few sentences. Including this information means that a Works Cited is not necessary for this assignment. Focus on the writer’s arguments by reporting the text’s thesis. Show that you understand the “ big picture ”—the writer’s main point. Maintain the focus on the overall argument of the article: the main points that the author make to support their thesis. Avoid giving too many specific examples or extraneous detail. You can generalize about the types of evidence or methods of arguing she employs to support her argument. You will want to include some of the key phrases or terms that are central to her argument and an explanation of what those mean and how they are used. Use “ author tags ” so that your reader understands that you are reporting the author’s ideas rather than suggesting they are your ideas. Use an objective tone and a mix of paraphrased and quoted source material . Reflective Writing (150-200 words) Please respond to the following prompts and include in the same document as your final draft: Describe your writing process for this assignment: What did your first draft look like compared to your final draft? How did the revision workshop shape your drafting process? What did you think was successful about your writing (what did you do well)? What was challenging about the assignment? Why? Style in Focus: How did you use what you have learned about quotation and author tags in your summary? What would you like me to notice about your essay and what would you like me comment on?"}, "6502569": {"name": "Rhetorical Analysis Draft", "due_at": "2023-09-21T15:00:00Z", "description": "Length: 3-4 pages, double-spaced Assignment : Write a 3-4 page rhetorical analysis of a persuasive text selected from the Rhetorical Analysis Article Bank folder in the Rhetorical Analysis files folder. Purpose : You will closely read your selected text in order to become more aware of the arguments and rhetorical strategies enacted by stakeholders impacted by its topic. The Rhetorical Analysis assignment allows to you to learn about effective writing by examining how other writers create successful (and possibly not-so-successful) compositions. Audience : Imagine that your audience is interested in the issue you’re analyzing, but not an expert. Assume your audience has not read the persuasive text, so you’ll need to provide basic contextual information to situate the piece for them. Writing the Rhetorical Analysis When you analyze your selection, your goal is to identify and examine the writer’s rhetorical strategies and how these strategies help to achieve the overarching purpose of the piece. Thus, you will need to explain to your readers how the writer persuades his or her audience, whether or not the writer’s strategies are effective, and why you think so. To provide a thorough analysis for your readers, you’ll need to research the writer, the topic the writer wrote about, the audience the writer addressed, and the historical context during which the writer wrote. In other words, you will need to understand and inform your readers about the rhetorical situation in which the writer composed this document. If you’re unsure about the rhetorical situation that your writer engages, you may need to do a bit of research. Once you choose your persuasive document and research its rhetorical situation, you will be ready to analyze the piece by describing its strengths and weaknesses. You will examine the writer’s use of rhetorical strategies and appeals and discuss how they meet the needs and expectations of the audience. Therefore, to compose your analysis, you’ll establish your own thesis statement —your own argument about the writer’s rhetorical strategies. You will then support this thesis statement with evidence from the text to demonstrate to your audience that your argument about this persuasive piece of writing is a reasonable one. It is important to note that when you compose your analysis, you should avoid simply pointing to a writer’s use of appeals, style, arrangement strategy, etc. Instead, you’ll want to compose your analysis by discussing both the purpose and effect of the rhetorical moves you’re focusing on , asking: (1) Why did the writer choose this appeal? (2) What effect does this appeal have on the audience? By considering these questions, you will effectively evaluate the choices the writer makes when attempting to reach his/her audience. It is important to note as well that you do not need to cover every appeal and persuasive strategy. You might focus on the strategies you found most compelling or representative."}, "6502568": {"name": "Rhetorical Analysis", "due_at": "2023-09-27T03:59:59Z", "description": "Length: 3-4 pages, double-spaced Assignment : Write a 3-4 page rhetorical analysis of a persuasive text selected from the Rhetorical Analysis Article Bank folder in the Rhetorical Analysis files folder. Purpose : You will closely read your selected text in order to become more aware of the arguments and rhetorical strategies enacted by stakeholders impacted by its topic. The Rhetorical Analysis assignment allows to you to learn about effective writing by examining how other writers create successful (and possibly not-so-successful) compositions. Audience : Imagine that your audience is interested in the issue you’re analyzing, but not an expert. Assume your audience has not read the persuasive text, so you’ll need to provide basic contextual information to situate the piece for them. Writing the Rhetorical Analysis When you analyze your selection, your goal is to identify and examine the writer’s rhetorical strategies and how these strategies help to achieve the overarching purpose of the piece. Thus, you will need to explain to your readers how the writer persuades his or her audience, whether or not the writer’s strategies are effective, and why you think so. To provide a thorough analysis for your readers, you’ll need to research the writer, the topic the writer wrote about, the audience the writer addressed, and the historical context during which the writer wrote. In other words, you will need to understand and inform your readers about the rhetorical situation in which the writer composed this document. If you’re unsure about the rhetorical situation that your writer engages, you may need to do a bit of research. Once you choose your persuasive document and research its rhetorical situation, you will be ready to analyze the piece by describing its strengths and weaknesses. You will examine the writer’s use of rhetorical strategies and appeals and discuss how they meet the needs and expectations of the audience. Therefore, to compose your analysis, you’ll establish your own thesis statement —your own argument about the writer’s rhetorical strategies. You will then support this thesis statement with evidence from the text to demonstrate to your audience that your argument about this persuasive piece of writing is a reasonable one. It is important to note that when you compose your analysis, you should avoid simply pointing to a writer’s use of appeals, style, arrangement strategy, etc. Instead, you’ll want to compose your analysis by discussing both the purpose and effect of the rhetorical moves you’re focusing on , asking: (1) Why did the writer choose this appeal? (2) What effect does this appeal have on the audience? By considering these questions, you will effectively evaluate the choices the writer makes when attempting to reach his/her audience. It is important to note as well that you do not need to cover every appeal and persuasive strategy. You might focus on the strategies you found most compelling or representative. Reflective Writing (250-300 words) Please respond to the following prompts and include in the same document as the Rhetorical Analysis: Review my feedback on your Summary. What, if anything, am I asking you to focus on? Review the comments from your peers in both draft workshops: how have you responded directly to peers’ suggestions? What are you noticing about your writing given the feedback you received from your peers? What did you think was successful about your writing in this assignment (what did you do well)? What did you struggle with? Why? Style in Focus : How did you incorporate what you learned about building effective paragraphs? Point to specific places in your essay where you leveraged this knowledge and skill."}, "6502540": {"name": "Annotated Bibliography", "due_at": "2023-10-06T03:59:59Z", "description": "Assignment : For the Annotated Bibliography assignment, you will properly cite and annotate five peer-reviewed scholarly sources you see as significant to the investigation of the issue you have chosen for your research sequence. Each annotation should be approximately 150 words. Single spaced is fine for the purposes of this assignment. Purpose : Now that you have summarized and analyzed the arguments of others, we now begin a sequence of papers on an issue of your choice. Going forward, you will identify and ask questions about an issue (Inquiry), offer your own argument about the issue (Position Paper), and then translate that argument to an online audience for the Infographic and Reflective Writing Assignment. In order to do so, you will need to conduct research on your chosen topic. For this assignment, you’ll be introduced to research strategies and the UMD library system, and this introduction should help you to choose wisely the sources that will speak to, enrich, extend, and complicate your understanding of the issue under consideration and that will be the prime subject matter for your Annotated Bibliography and your writing throughout the semester. Audience : I am your audience for your annotated bibliography. Writing the Annotated Bibliography : In each annotation you should: cite the text of your choice in perfect MLA format sources should be in alphabetical order each citation should have a hanging indent (first line flush left and each additional line of the annotation indented) annotations should be flush left, not indented Need to brush up on MLA? https://owl.english.purdue.edu/owl/resource/747/01/ summarize the text. evaluate the credibility, fairness, and/or bias of the source. discuss how the text will help you gain a deeper sense of the issue and how you might use the source in the Inquiry essay. Your annotated bibliography should follow the example below (written by my colleague Dr. Ruth Osorio). hooks, bell. Feminism is for Everybody: Passionate Politics. Cambridge: South End Press, 2000. Print. hooks’s text works to define what feminism is to an uninformed and possibly resistant audience. Her goal is to dispel negative perceptions of feminists as “men haters” and instead to offer a new, more positive explanation of this political position. Feminism, for hooks, is a “movement to end sexism, sexist exploitation, and oppression,” and she notes that anyone can be a feminist if he or she works towards this end (viii). Her chapters—“Our Bodies, Ourselves,” “Feminist Class Struggle,” and “Global Feminism” (just to name a few)—reinforce her overall aims, as hooks attempts at every turn to explain feminist issues to readers in a generous and welcoming tone. I find her book to be an informed and levelheaded assessment of feminism, and her definition of feminism coincides with that of other authors I’ve consulted (see Bordo). For my Inquiry paper, I help my audience see the various ways stakeholders are re-defining feminism, and hooks’s definitions of what feminism is will be particularly important for my purposes."}, "6502553": {"name": "Inquiry Draft", "due_at": "2023-10-12T15:00:00Z", "description": "Assignment : Write a 4 page (double spaced) inquiry essay about your chosen topic. Purpose : During the second unit of the semester, you will complete a series of assignments that asks you to identify an issue of interest to you and pursue it by asking questions, conducting research, analyzing arguments, and taking a position of your own. The Inquiry assignment initiates this process of research, thinking, and rethinking. The Inquiry assignment asks you to identify the issue you’d like to pursue for the semester and begin your exploration. The goal of the assignment is to present this issue to your readers and pinpoint a guiding and critical question that invested citizens and experts are asking about and the responses they are formulating. Key to this project is the idea that you are not just inquiring for your own sake. Rather, you are using this assignment to encourage an audience of your choice to invest themselves in this issue. That is, you need to make it clear that this issue has exigence: understanding the issue is thus important and asking questions about it is a worthwhile endeavor. Audience: You may choose to write to readers who have never encountered the issue you’re engaging, or you may write to readers who have preconceived ideas about the issue under discussion. Whatever audience you choose, you want to think about how your inquiry addresses their understandings and concerns. Writing the Inquiry : I encourage you to initiate your work on this essay by reflecting on your personal experiences and interests and identifying the issues that are most important to you. However, you will complement this personal investment with scholarly research, which will enable and support your work throughout the rest of assignment sequence. For this assignment, you will identify at least five academic sources that spur your thinking on your topic and add perspective to your experience. The Annotated Bibliography assignment will help you to identify relevant sources and practice summarizing, evaluating, and connecting them to the overarching objective of the Inquiry essay (see the Annotated Bibliography assignment description). Examining these resources should also help you to identify important questions to ask about your issue—questions that should stand at the center of your Inquiry assignment. When you submit your final draft of the Inquiry, you will include a bibliography of the five sources cited in MLA style (no need to include your annotations), and you must integrate and engage at least three of these sources of these in the body of the Inquiry paper. Building on the research you conduct for the Annotated Bibliography, you will craft your Inquiry essay with these goals in mind: identify and explain to your audience the issue itself and argue for the exigence of the topic. pose an insightful, complex, and open-ended series of questions that guide your exploration of the topic and open onto an existing scholarly conversation. synthesize multiple perspectives on and responses to the question to demonstrate how experts and stakeholders understand and engage this issue. include a Works Cited page with five academic sources related to your topic. The end result then is not to complete the investigation or take a position within the issue. Rather, your work is to assert the importance of the issue, identify the main questions that drive it, and display for your readers the array of perspectives on the issue."}, "6502552": {"name": "Inquiry", "due_at": "2023-10-18T03:59:59Z", "description": "Assignment : Write a 4 page (double spaced) inquiry essay about your chosen topic. Purpose : During the second unit of the semester, you will complete a series of assignments that asks you to identify an issue of interest to you and pursue it by asking questions, conducting research, analyzing arguments, and taking a position of your own. The Inquiry assignment initiates this process of research, thinking, and rethinking. The Inquiry assignment asks you to identify the issue you’d like to pursue for the semester and begin your exploration. The goal of the assignment is to present this issue to your readers and pinpoint a guiding and critical question that invested citizens and experts are asking about and the responses they are formulating. Key to this project is the idea that you are not just inquiring for your own sake. Rather, you are using this assignment to encourage an audience of your choice to invest themselves in this issue. That is, you need to make it clear that this issue has exigence: understanding the issue is thus important and asking questions about it is a worthwhile endeavor. Audience: You may choose to write to readers who have never encountered the issue you’re engaging, or you may write to readers who have preconceived ideas about the issue under discussion. Whatever audience you choose, you want to think about how your inquiry addresses their understandings and concerns. Writing the Inquiry : I encourage you to initiate your work on this essay by reflecting on your personal experiences and interests and identifying the issues that are most important to you. However, you will complement this personal investment with scholarly research, which will enable and support your work throughout the rest of assignment sequence. For this assignment, you will identify at least five academic sources that spur your thinking on your topic and add perspective to your experience. The Annotated Bibliography assignment will help you to identify relevant sources and practice summarizing, evaluating, and connecting them to the overarching objective of the Inquiry essay (see the Annotated Bibliography assignment description). Examining these resources should also help you to identify important questions to ask about your issue—questions that should stand at the center of your Inquiry assignment. When you submit your final draft of the Inquiry, you will include a bibliography of the five sources cited in MLA style (no need to include your annotations), and you must integrate and engage at least three of these sources of these in the body of the Inquiry paper. Building on the research you conduct for the Annotated Bibliography, you will craft your Inquiry essay with these goals in mind: identify and explain to your audience the issue itself and argue for the exigence of the topic. pose an insightful, complex, and open-ended series of questions that guide your exploration of the topic and open onto an existing scholarly conversation. synthesize multiple perspectives on and responses to the question to demonstrate how experts and stakeholders understand and engage this issue. include a Works Cited page with five academic sources related to your topic. The end result then is not to complete the investigation or take a position within the issue. Rather, your work is to assert the importance of the issue, identify the main questions that drive it, and display for your readers the array of perspectives on the issue. Reflective Writing Assignment #3 (250-300 words included in same document as your Inquiry) Please respond to the following prompts: Review the comments I’ve made to your Summary and Rhetorical Analysis essays. What am I asking you to focus on? Any trends? Review the comments from your peers from previous peer reviews: what are kinds of feedback have you received from your peers? How have you addressed or incorporated this feedback? What did you think was successful about your inquiry (what did you do well)? What did you struggle with? Why? How is class going for you thus far? What questions or concerns do you have?"}, "6502544": {"name": "Conversation Map", "due_at": "2023-10-27T03:59:59Z", "description": "Description: Throughout this unit, you have gathered and examined resources. Now you will discern how sources connect and speak to one another. The Conversation Map is a visual organizer that will help you (1) explore the main ideas your sources are discussing and (2) prepare to synthesize these sources in your Literature Review. You will explain the arguments that people are already making succinctly, clearly, and without adding your own opinion. You will identify the points of intersection , or places where some arguments overlap or come together and work with each other. You will also identify the points of divergence , or places where some arguments disagree or push and work against each other. In short, you will visually map the conversation . Skills: reading critically, identifying where authors converge and diverge, developing main ideas to focus on for Literature Review and Position Paper Number of sources: You will use 8-10 sources at this stage in your research; at least 6 should be scholarly. You will likely need some new sources as your research direction shifts. Open-Source Resources: (1) This brief tutorial models a slightly different format, but the gist is clearly explained: Link 1 (Links to an external site.) (2) This longer tutorial is more topic-specific, but is also useful: Link 2 (Links to an external site.) Step 1. Building the basic Conversation Map Create a grid and fill in by doing the following: At the top of your grid, write down the general topic or research question. Based on your research, consider which main ideas have emerged. Use the top row of the grid (see “ Main Idea 1 ”) to describe 4-5 main ideas, using a different column for each idea. Write MLA 8-10 citations ( see this guide for help (Links to an external site.) ) for the sources in the first cell of each row (the left-hand column). Note: to add more rows to your table: right click in the table and select Insert row above/below. For each source, consider which main ideas emerge and summarize them in the columns you’ve developed (you'll replace the XXX a brief statement of how the article takes up that idea). If, in your sources, you find a new main idea (i.e. a main idea that doesn’t fit into one of your “Main Idea” columns), create a new column for it. In the complete Conversation Map, you will have 8-10 sources and 4-5 “Main Idea” columns, with entries scattered throughout the chart. Note that not all main ideas occur in all sources. Some cells are going to be blank (see XXX ) . Step 2. Stepping Back to Consider (you won't turn anything in from this section; it's prep for Step 3) Now you have a basic Conversation Map. Your visual organizer should look a lot like the one above. Your next step is to recognize connections and identify gaps. Recognize the spaces where authors are connecting by talking through similar issues. Identify the gaps that represent unexplored areas or missing research. Consider any/all of the following questions. Recognize Connections: What do multiple sources say about your “main ideas”? Do multiple sources corroborate or build on the same points? What do they each add that is unique? Do sources agree or disagree about main ideas? Mark these interesting points of contention; they will be important for developing arguments and counterarguments or zeroing in on conflicting plans of action. Do your sources refer to each other, directly or indirectly? Do they concede to, agree with, or refute each other? Identify Gaps: When you look at your filled out grid and see a row that only has one source talking about a main idea, what can you deduce from that? What if there is a source in a main idea column that none of the other sources talk about and it doesn't contribute to the main ideas the other sources contribute to? Do some sources feel irrelevant and need to be omitted? Do critical gaps in your research possibly represent previously unexplored areas or pressure points where you imagine you might intervene? Step 3. Reflection To organize your thoughts, use what you found in Step 2 to write a 200-300 word reflection on this process. Consider any/all of the following questions: What are the benefits of categorizing your research in these ways? What struggles did you come up against as you categorized your research? What did you observe about the available (or yet incomplete) literature when filling in this grid? What gaps or overlaps did you identify? What further research will you need? What argument(s) about the available research emerged through this assignment? Based on this grid, how do you imagine you’ll organize your Literature Review? What 2-3 tasks are directly in front of you as you develop your Literature Review? How will this help you prepare for your Position Paper? ***Language here is drawn from the SUU Description: https://docs.google.com/document/d/1Hu9fZtXQ-mso9hKU7h6KYw0LhpCwliHx1ckunKz3CJs/edit?usp=sharing"}, "6502555": {"name": "Literature Review", "due_at": "2023-11-03T03:59:59Z", "description": "Assignment: For this assignment, you will create a 3-4 page Literature Review. “Literature” in this context is defined as credible writing about your topic, not literary writing (like a novel or poem). You will draw explicitly from 5-7 credible sources to paint a cohesive, critical, and well-organized picture of the research available about your issue. “Review” also has a somewhat specific meaning in this context. You will need to analyze the available research, present a clear argument about its scope, and, importantly, forecast your own potential intervention into the conversation. The Literature Review is a vital springboard for developing your own argument; this is where you move from asking questions that interest you and conducting research to finding a niche for public intervention. The Literature Review creates a foothold for you to respond to the available writing and research and make your own intervention. Skills: The Literature Review asks you to: continue to explore, research, and write about the issue you’ve chosen to engage throughout the semester use the skills we’ve reviewed previously, including research, summary, analysis, and inquiry. engage with stasis theory to consider ways to use your selected sources practice synthesizing research and nuanced arguments. learn how to discuss, categorize, compare, and contrast sources and engage with their rhetorical moves. Sources: The Literature Review first asks that you return to the sources you collected in the initial stages of your research. These sources represented a range of scholarly, popular, multimedia, and print texts (and some made it to your Inquiry and Annotated Bibliography). Many of these sources may continue to be useful in the Literature Review; however, as your research direction evolves, you will very likely need to collect new sources as well. You will use old and new research methods to select sources and identify various intersecting and conflicting positions. Drawing from that pool of new and existing research, as well as your analysis, you will select 5-7 (5 must be scholarly) sources to explore in your Literature Review (and ultimately to help you develop your Position Paper). Synthesis to Argument: In writing your Literature Review, you will do the important work of synthesis, which means putting your selected sources and authors in conversation with each other. To achieve this kind of source synthesis, you will practice integration strategies, as well as study potential systems of organization that will help you categorize your sources and articulate their arguments, differences, similarities, strengths, and weaknesses. The Literature Review won’t, however, be simply a list of sources or even conversant source annotations. You will ultimately develop a thesis (argument) for your Literature Review. This thesis won’t yet take a position on your topic; rather, you will identify the research clusters you’ve developed and critically consider how scholarship on your topic converges and/or diverges, mining for critical gaps or discrepancies in the research where you might potentially intervene. Audience: Literature Review is a genre that helps scholars—and public intellectuals, medical professionals, politicians, reporters, lawyers, and researchers across disciplines—assess the scope of available research and carve out space in critical discourse. In short, conducting a literature review can help you get a sense of the “conversation” surrounding a topic. Knowing who’s saying what about your topic is an integral step to inserting your own ideas. While literature reviews sometimes appear as standalone projects, they are often integrated into larger peer-reviewed publications. To move toward this kind of writing, you should imagine writing for a primary audience of undergraduate researchers within your field. This audience wants to understand the state of play--and where you will fit into the discourse. Your audience may have these kinds of questions: What is the state of the conversation? Who is talking to whom and how? What aren't people saying? Interestingly, you might also imagine yourself as a secondary audience. This project is designed to help you integrate the sources, stakeholder positions, and systems of organization that will be directly useful in your Position Paper. So you should think about practical ways to use this review of relevant literature to deepen your understanding of your topic and articulate ways you, as an emerging scholar, may intervene. Resources: https://libguides.uwf.edu/c.php?g=215199&p=1420828 https://owl.purdue.edu/owl/research_and_citation/conducting_research/writing_a_literature_review.html"}, "6502561": {"name": "Position Paper Draft", "due_at": "2023-11-16T16:00:00Z", "description": "The Assignment : You will write an 8-10 page position paper plus a Works Cited page featuring at least fifteen sources. Purpose : You have been working toward this paper all semester, gathering research and considering (and re-considering) your position as well as others. Your work in this essay is to take a position within the debate that you’ve explored in your inquiry. The goal is to build on what you’ve learned and what you’ve argued to take a position within the conversation and make a new claim within your issue. This argumentative essay will be the place where you can share the fruits of your research and argue for the ideas you have developed through your writing and research process. Audience : You will identify an audience for this project. When you do, remember the genre of the essay: you are making an academic argument. However, this genre should not be seen as limiting. Academics are not the only people who read academic arguments, and academic arguments are often found in widely read publications. Thus, you should think of your audience as an interested group who expects to encounter a thoughtful, informed, and persuasive essay. Writing the Position Paper Most of you will use rhetorical strategies that take up concerns of cause, consequence, and proposals for new action. Thus, you might work in this final paper to pinpoint the cause and the consequences of the problem you have been exploring and then propose a solution. Such a focus on proposals and solutions is indeed welcome. We can all identify problems; the challenge is to create solutions. For this project, you are required to have a bibliography of at least fifteen sources. At least 10 of these sources need to be academic (peer reviewed books or articles; for our purposes, government and scholarly reports will also satisfy this requirement); the others might include blogs, interviews, magazine or newspaper articles, YouTube videos, or graphs from government or think tank websites. All sources must be reputable, credible, and useful for your case. Of course, you should draw on previous assignments (Annotated Bibliography, Inquiry, Conversation Map, Literature Review, etc.) You’ll also need to conduct more research. A great part of your success in this assignment will be determined by how well you employ your research. One of the trickiest parts of a long argument is organization. You need to give an overview, stake your claim, offer evidence, refute evidence—how will you put it all together? There are two rhetorical tools to help you here. The first is the stasis grid. You can use the hierarchy of the stases, the way that an issue in one stasis depends on or interacts with an issue in another stasis, to help shape the paper. If you are making an argument about action, for example, you might introduce your thesis, but then bring in issues from fact/definition to establish background, issues from cause/effect to show exigence, issues from value to further develop a sense of importance and urgency, and then come to more extensive support for your claim about action. The “parts of a full argument” lecture/slides (forthcoming) offers guidelines about how to begin, give context, and how provide a road map for the paper. Reflective Writing for Position Paper (for final draft only) Please respond to the following prompts in about 300 words: What are the strengths of this essay? What are the weaknesses? How did you take into account my feedback on your earlier assignments? How did the writing processes you moved through in Rhetorical Analysis and Inquiry affect the way you wrote the Position Paper? Think back over the class activities for this unit, what learning experiences helped you as you drafted and revised this essay? Be specific. Style in Focus: How do you maintain the known-new contract through the argument?  What did you do to make sure that your audience had information when they needed it?"}, "6502559": {"name": "Position Paper", "due_at": "2023-11-22T04:59:59Z", "description": "The Assignment : You will write an 8-10 page position paper plus a Works Cited page featuring at least fifteen sources. Purpose : You have been working toward this paper all semester, gathering research and considering (and re-considering) your position as well as others. Your work in this essay is to take a position within the debate that you’ve explored in your inquiry. The goal is to build on what you’ve learned and what you’ve argued to take a position within the conversation and make a new claim within your issue. This argumentative essay will be the place where you can share the fruits of your research and argue for the ideas you have developed through your writing and research process. Audience : You will identify an audience for this project. When you do, remember the genre of the essay: you are making an academic argument. However, this genre should not be seen as limiting. Academics are not the only people who read academic arguments, and academic arguments are often found in widely read publications. Thus, you should think of your audience as an interested group who expects to encounter a thoughtful, informed, and persuasive essay. Writing the Position Paper Most of you will use rhetorical strategies that take up concerns of cause, consequence, and proposals for new action. Thus, you might work in this final paper to pinpoint the cause and the consequences of the problem you have been exploring and then propose a solution. Such a focus on proposals and solutions is indeed welcome. We can all identify problems; the challenge is to create solutions. For this project, you are required to have a bibliography of at least fifteen sources. At least 10 of these sources need to be academic (peer reviewed books or articles; for our purposes, government and scholarly reports will also satisfy this requirement); the others might include blogs, interviews, magazine or newspaper articles, YouTube videos, or graphs from government or think tank websites. All sources must be reputable, credible, and useful for your case. Of course, you should draw on previous assignments (Annotated Bibliography, Inquiry, Conversation Map, Literature Review, etc.) You’ll also need to conduct more research. A great part of your success in this assignment will be determined by how well you employ your research. One of the trickiest parts of a long argument is organization. You need to give an overview, stake your claim, offer evidence, refute evidence—how will you put it all together? There are two rhetorical tools to help you here. The first is the stasis grid. You can use the hierarchy of the stases, the way that an issue in one stasis depends on or interacts with an issue in another stasis, to help shape the paper. If you are making an argument about action, for example, you might introduce your thesis, but then bring in issues from fact/definition to establish background, issues from cause/effect to show exigence, issues from value to further develop a sense of importance and urgency, and then come to more extensive support for your claim about action. The “parts of a full argument” lecture/slides (forthcoming) offers guidelines about how to begin, give context, and how provide a road map for the paper. Reflective Writing for Position Paper (for final draft only) Please respond to the following prompts in about 300 words: What are the strengths of this essay? What are the weaknesses? How did you take into account my feedback on your earlier assignments? How did the writing processes you moved through in Rhetorical Analysis and Inquiry affect the way you wrote the Position Paper? Think back over the class activities for this unit, what learning experiences helped you as you drafted and revised this essay? Be specific. Style in Focus: How do you maintain the known-new contract through the argument?  What did you do to make sure that your audience had information when they needed it?"}, "6502549": {"name": "Infographic and Reflective Memo Draft", "due_at": "2023-12-05T16:00:00Z", "description": "The Assignment : For this assignment, you will craft an infographic that translates your Position Paper for a public audience. Purpose : The fifth major assignment of the semester, the Infographic and Reflective Memo, asks you to consider how you might revise your position paper to engage a public, non-academic audience about the issue you have engaged with throughout the semester. The goal is to think about how a specific public audience differs from a strictly academic one. Your previous assignments should provide the foundation for this project, but the purpose is for you to think about reframing your argument for a different audience in a different medium. Audience : While of course the digital environment would potentially allow anyone to view it, your goal is to shape your infographic’s appeals to a specific audience (i.e., not “the general public”) by using language, evidence, and visuals that would be of interest to them. Remember: your writing is public, so be mindful of how you represent yourself. Infographic Component Use Canva (Links to an external site.) to design an infographic that presents the relevance of your research to your intended audience. You should be attentive to and make use of the affordances of the medium. Affordances are options available to you in different media that enable you to craft, shape, and present your message. A written essay has different affordances than a website or video. Thus you will want to be sure you are aware and take advantage of the specific affordances that infographics allow . You will want to consider the following questions in thinking about how you will create your infographic: How do my choices of font, color, images, graphics, and arrangement reflect the message and overarching project of the infographic? How can I purposefully and thoughtfully make use of these features so that they add depth to my message and reach my audience? You want to think, first and foremost, about audience . What do you need to revise to make your argument more understandable or relatable to this online audience? What is the rhetorical situation? How can you appeal to common beliefs, assumptions, or values with your audience? What level of detail is appropriate to this audience in this medium? You want to think about presentation and formatting . You have likely relied on the full parts of an argument to structure your position paper. You will want to retain each of those parts, but because we are working on an infographic rather than a traditional paper, you will likely arrange the argument differently and more concisely. This may be as simple as breaking up blocks of text with “pull” quotations, images, or other affordances of the medium. Your infographic should create a clear visual narrative that is intuitive for readers to navigate . The translations you make must be substantive and effective , but you need not make an entirely new argument . Rather, you are making a similar argument meant to appeal to a different audience. In moving your argument from a paper to an infographic, you might rethink major aspects of the essay such as appeals, arrangement, introductions and conclusions, integration of research and so on. These changes should be in the service of demonstrating that you know how to respond to a different rhetorical situation. Reflection Component As you work on your infographic, you will compose a reflective memo ( 1.5-2 pages double-spaced ). The expectation here is that you discuss the specific changes you’ve made, and, more importantly , explain the rationale for your translation and revision . In your reflective memo, you might discuss how you appealed to your online audience, how you thought through issues related to cohesiveness and purpose, how you created a new organizational strategy that allowed for greater sense of purpose and cohesion, and/or how you used affordances purposefully to take advantage of the medium. Detailed discussions in your memo are vital because they highlight the thinking and decision-making that directed your revisions . Here is where I gain a sense that you are making conscious, careful, and rhetorically effective decisions. Furthermore, the idea behind the reflective memo is that you offer me a guide to reading your translation. In essence you’re saying, “Here’s what I did and here’s why I did it.”"}, "6502548": {"name": "Infographic and Reflective Memo", "due_at": "2023-12-08T04:59:59Z", "description": "The Assignment : For this assignment, you will craft an infographic that translates your Position Paper for a public audience. Purpose : The fifth major assignment of the semester, the Infographic and Reflective Memo, asks you to consider how you might revise your position paper to engage a public, non-academic audience about the issue you have engaged with throughout the semester. The goal is to think about how a specific public audience differs from a strictly academic one. Your previous assignments should provide the foundation for this project, but the purpose is for you to think about reframing your argument for a different audience in a different medium. Audience : While of course the digital environment would potentially allow anyone to view it, your goal is to shape your infographic’s appeals to a specific audience (i.e., not “the general public”) by using language, evidence, and visuals that would be of interest to them. Remember: your writing is public, so be mindful of how you represent yourself. Infographic Component Use Canva (Links to an external site.) to design an infographic that presents the relevance of your research to your intended audience. You should be attentive to and make use of the affordances of the medium. Affordances are options available to you in different media that enable you to craft, shape, and present your message. A written essay has different affordances than a website or video. Thus you will want to be sure you are aware and take advantage of the specific affordances that infographics allow . You will want to consider the following questions in thinking about how you will create your infographic: How do my choices of font, color, images, graphics, and arrangement reflect the message and overarching project of the infographic? How can I purposefully and thoughtfully make use of these features so that they add depth to my message and reach my audience? You want to think, first and foremost, about audience . What do you need to revise to make your argument more understandable or relatable to this online audience? What is the rhetorical situation? How can you appeal to common beliefs, assumptions, or values with your audience? What level of detail is appropriate to this audience in this medium? You want to think about presentation and formatting . You have likely relied on the full parts of an argument to structure your position paper. You will want to retain each of those parts, but because we are working on an infographic rather than a traditional paper, you will likely arrange the argument differently and more concisely. This may be as simple as breaking up blocks of text with “pull” quotations, images, or other affordances of the medium. Your infographic should create a clear visual narrative that is intuitive for readers to navigate . The translations you make must be substantive and effective , but you need not make an entirely new argument . Rather, you are making a similar argument meant to appeal to a different audience. In moving your argument from a paper to an infographic, you might rethink major aspects of the essay such as appeals, arrangement, introductions and conclusions, integration of research and so on. These changes should be in the service of demonstrating that you know how to respond to a different rhetorical situation. Reflection Component As you work on your infographic, you will compose a reflective memo ( 1. 5-2 pages double-spaced ). The expectation here is that you discuss the specific changes you’ve made, and, more importantly , explain the rationale for your translation and revision . In your reflective memo, you might discuss how you appealed to your online audience, how you thought through issues related to cohesiveness and purpose, how you created a new organizational strategy that allowed for greater sense of purpose and cohesion, and/or how you used affordances purposefully to take advantage of the medium. Detailed discussions in your memo are vital because they highlight the thinking and decision-making that directed your revisions . Here is where I gain a sense that you are making conscious, careful, and rhetorically effective decisions. Furthermore, the idea behind the reflective memo is that you offer me a guide to reading your translation. In essence you’re saying, “Here’s what I did and here’s why I did it.”"}}, "files": {"74199119": {"display_name": "A Beginner's Guide to Shareable Infographics - A Visual Guide for Beginners By Visme.pdf", "url": "https://umd.instructure.com/files/74199119/download?download_frd=1&verifier=VkchSVK1zkp6ppA68fBbsQuMcVaXWniHTtSrQAWs"}, "74199070": {"display_name": "Annotated Bibliography Assignment Sheet.docx", "url": "https://umd.instructure.com/files/74199070/download?download_frd=1&verifier=hi4NYECaAVvfFKHk1HPyAffd3fB8aIfpWAGZuTzP"}, "74199083": {"display_name": "Annotated Bibliography Example.pdf", "url": "https://umd.instructure.com/files/74199083/download?download_frd=1&verifier=aldBymPwpm4sp1cTetyuyYGiCCHUrNDExhHlK5pj"}, "74979014": {"display_name": "Annotated Bibliography Example.pdf", "url": "https://umd.instructure.com/files/74979014/download?download_frd=1&verifier=tfO4C9HOEM59wZdNZSOu3snHQEcn8rTLNtuQn9FW"}, "74199023": {"display_name": "Aristotle's Rhetorical Situation __ Purdue Writing Lab.pdf", "url": "https://umd.instructure.com/files/74199023/download?download_frd=1&verifier=HjYplNCmtqE9xXoOJYGbgszKsvdGDl89iUWGRlbV"}, "74198938": {"display_name": "Audience - The Writing Center - UNC.pdf", "url": "https://umd.instructure.com/files/74198938/download?download_frd=1&verifier=qtOa88q2d24c8nGvzblTnD9iBeygoC4RLnwrqtTy"}, "74199080": {"display_name": "Avoiding Plagiarism – MIT Comparative Media Studies_Writing.pdf", "url": "https://umd.instructure.com/files/74199080/download?download_frd=1&verifier=ZIIXnOQDWnnNu1Xm0dXA8L2suLj7ZvHC4ZqG95x4"}, "74199107": {"display_name": "Baker - The Cost of Business on Wall Street _ Opinion _ The Guardian.pdf", "url": "https://umd.instructure.com/files/74199107/download?download_frd=1&verifier=KwK3bnC7Eli5nLImXg2MYhKlk0yhZksIvXdso3kG"}, "74411188": {"display_name": "Basics of Quotation.pptx", "url": "https://umd.instructure.com/files/74411188/download?download_frd=1&verifier=ST081PiI2Rpy2TBcluUOQD4h8nk3YBWeREbLDzKY"}, "74198949": {"display_name": "Building Paragraphs.pptx", "url": "https://umd.instructure.com/files/74198949/download?download_frd=1&verifier=AOX2rmjJKfcYyWdfjc1VHuAMDSGpblHcbcUZVa2q"}, "74199115": {"display_name": "Causal - Taylor - When the Dream of Owning a Home Became a Nightmare - The New York Times.pdf", "url": "https://umd.instructure.com/files/74199115/download?download_frd=1&verifier=O1mR1XYfXM5GNfRRE1pXqo6JlQIOLlXYxkT3D6v8"}, "74198937": {"display_name": "Causal Arguments.pptx", "url": "https://umd.instructure.com/files/74198937/download?download_frd=1&verifier=hykzrfSAshXyHMFrBguxwvYLwuD8eO5EmWp3ceG5"}, "74199032": {"display_name": "Citing Quoting Plagiarism.pptx", "url": "https://umd.instructure.com/files/74199032/download?download_frd=1&verifier=gZTfU88lYXIqcnzR2XrfIPfoF5fTx2rhbi0nZG0c"}, "74199116": {"display_name": "Clarity and Concision.pdf", "url": "https://umd.instructure.com/files/74199116/download?download_frd=1&verifier=rRMCGOytsvsX8ylINhqYfsqcsI7ANWLXA5d6JF0G"}, "74198991": {"display_name": "Classical Argument __ Purdue Writing Lab.pdf", "url": "https://umd.instructure.com/files/74198991/download?download_frd=1&verifier=TvvRZgDlqccohdeEy9uisZhlf0c2aTyp7xPFBtWG"}, "74199094": {"display_name": "Common Logical Fallacies - UNB Fredricton.pdf", "url": "https://umd.instructure.com/files/74199094/download?download_frd=1&verifier=bAS9WD3Gslk6uns8OjjkMcoJ8haegycBj7srOKHW"}, "74199081": {"display_name": "Concision - Five Strategies.pdf", "url": "https://umd.instructure.com/files/74199081/download?download_frd=1&verifier=BFYcoZA6TrJxgPLh4haYRo0GBAknlbctWNIMGmtM"}, "75117798": {"display_name": "Concision.pptx", "url": "https://umd.instructure.com/files/75117798/download?download_frd=1&verifier=7HqrZYuFK02BTgS7koLgKLKcGS36JurKNxx8B9A9"}, "74199113": {"display_name": "Conclusions - The Writing Center - UNC Chapel Hill.pdf", "url": "https://umd.instructure.com/files/74199113/download?download_frd=1&verifier=9fmGUrvMe1Lvlrk4vM6P9QzltaDveaTDOsz3AHLu"}, "74198939": {"display_name": "Considering Another Side.docx", "url": "https://umd.instructure.com/files/74198939/download?download_frd=1&verifier=2NsEakAeCl3UVnekdsBdDpmoAPYOHGmMMGeE35rD"}, "74199073": {"display_name": "Conversation Map Example 1.pdf", "url": "https://umd.instructure.com/files/74199073/download?download_frd=1&verifier=TYnn2WwF5djom8vyHW8tKTLqKey6IsamFYZ8AEeB"}, "74199078": {"display_name": "Conversation Map Example 2.pdf", "url": "https://umd.instructure.com/files/74199078/download?download_frd=1&verifier=1xxzZuFC5uwrtYKffZPmOskvNwCB9vjfCb2D4b2X"}, "74199061": {"display_name": "Conversation Map.docx", "url": "https://umd.instructure.com/files/74199061/download?download_frd=1&verifier=yqSSJmTw1A0wGEIRaOktKkTSyb0pkmMQEPi7oosT"}, "74199030": {"display_name": "Creating and Using a Thesis.doc", "url": "https://umd.instructure.com/files/74199030/download?download_frd=1&verifier=DdcSXBcW75J8xPKzgO4njq8C5HBzZNqVk4EhaO6T"}, "74199006": {"display_name": "Definition and Resemblance.pptx", "url": "https://umd.instructure.com/files/74199006/download?download_frd=1&verifier=wfDMMek0gcfMxrPvJCyh1SEFiL9PcNCrOIygvmK8"}, "74199110": {"display_name": "Ehrenreich - It Is Expensive to Be Poor - The Atlantic.pdf", "url": "https://umd.instructure.com/files/74199110/download?download_frd=1&verifier=HCSnSI60QijSXuY6mMhYRCDE89iSvpMVMksLJDoD"}, "74649164": {"display_name": "Ethos and Pathos.pptx", "url": "https://umd.instructure.com/files/74649164/download?download_frd=1&verifier=TjbPBAdXIGQQIzUK5yDonVRp3NBv28UvdKZDmcak"}, "74199111": {"display_name": "Evaluating Sources.docx", "url": "https://umd.instructure.com/files/74199111/download?download_frd=1&verifier=o8xxn4m4hMfmadrFgkbCNClSdPTZAxAmfNRpzj5g"}, "74199048": {"display_name": "Evaluation Arguments - EA - 214-41.pdf", "url": "https://umd.instructure.com/files/74199048/download?download_frd=1&verifier=qToL8gweDZ7rPvyuWyKl7hsl5M16lCAf0eUG01Qc"}, "74199105": {"display_name": "Evaluation Arguments.pptx", "url": "https://umd.instructure.com/files/74199105/download?download_frd=1&verifier=VtwAAcSObsZXJbHQzCuvERPcJDegh1t6zZJvW8IC"}, "74199065": {"display_name": "Eveleth - The myth of inevitable technological progress - Vox.pdf", "url": "https://umd.instructure.com/files/74199065/download?download_frd=1&verifier=26iF00fBuzdk1fx6DFy3XL5r2ZhvyYPatCc5m8m0"}, "74199058": {"display_name": "Exigence – Open English @ SLCC.pdf", "url": "https://umd.instructure.com/files/74199058/download?download_frd=1&verifier=K44X4XQBLxkBbZNdqqYtPLxaJZyfXmkPQiYox4al"}, "74199099": {"display_name": "Exploratory Papers __ Purdue Writing Lab.pdf", "url": "https://umd.instructure.com/files/74199099/download?download_frd=1&verifier=tPGXugxWkEpi6AYajQ4h1IMjnPcGqdE67TWqcQli"}, "74199074": {"display_name": "Fallacies - UNC - The Writing Center.pdf", "url": "https://umd.instructure.com/files/74199074/download?download_frd=1&verifier=sqmx6gEf90GOsFnGkAExOWuwhhDqSelk5579Jsbo"}, "74198957": {"display_name": "From Identifying an Issue to Forming Questions.pptx", "url": "https://umd.instructure.com/files/74198957/download?download_frd=1&verifier=tqA1pEYw1mmTDHh3fDqDEkhUegXx4eXSlhPGdVPq"}, "74199043": {"display_name": "Giving and Getting Feedback.pptx", "url": "https://umd.instructure.com/files/74199043/download?download_frd=1&verifier=CXCWgIv08SV3ogmjozScM1vAObZGXjqfd5VSz656"}, "74199027": {"display_name": "Greene - It Runs Deep and We Can’t Talk It Out_ On Campus Racism and the Murder of Richard Collins III with Mark Up.pdf", "url": "https://umd.instructure.com/files/74199027/download?download_frd=1&verifier=h0wV8teKJJCHBNw7lgBUIYG4C8XIV2mkGBeQQttX"}, "74199047": {"display_name": "Greene - It Runs Deep and We Can’t Talk It Out_ On Campus Racism and the Murder of Richard Collins III.pdf", "url": "https://umd.instructure.com/files/74199047/download?download_frd=1&verifier=Fr7QSBnYECIJNlzah91nSldy71JxXIR6QvzhZCL7"}, "74199106": {"display_name": "Greene and Lidinsky - From Identifying Issues to Forming Questions.pdf", "url": "https://umd.instructure.com/files/74199106/download?download_frd=1&verifier=IphqjYuJSnBZsffhfHjRRElRtTDE5SiKeplGsjlg"}, "74199066": {"display_name": "Guenther - The Living Death of Solitary Confinement - The New York Times.pdf", "url": "https://umd.instructure.com/files/74199066/download?download_frd=1&verifier=9OcyHYmdHQGb2DDXKWFEBRbYt3I0RxMZDFxQqjIs"}, "74199109": {"display_name": "Hacker and Sommers - Building Effective Paragraphs.pdf", "url": "https://umd.instructure.com/files/74199109/download?download_frd=1&verifier=s0tfzuxD2UUljYBjYUXfn7EPMWNvEQBnIDHJY0cL"}, "74199102": {"display_name": "Hacker and Sommers - Drafting and Revising a Working Thesis .pdf", "url": "https://umd.instructure.com/files/74199102/download?download_frd=1&verifier=v1UhnTJcdaJ9iYw3CmbS78Sh1wr7o8j1HjI2Yi0b"}, "74199025": {"display_name": "Hacker and Sommers - Integrating Sources.pdf", "url": "https://umd.instructure.com/files/74199025/download?download_frd=1&verifier=Rfy1ZR3K1VLcsa0XWsL6qxmVj8vpWDR7ZQb85WGy"}, "74199051": {"display_name": "Hacker and Sommers - Revising, Editing, and Reflecting excerpt.pdf", "url": "https://umd.instructure.com/files/74199051/download?download_frd=1&verifier=hidMIvERBuslo1v3A8USkEell6b8wLNUTiiRtrmW"}, "74199122": {"display_name": "Hardy and Milanese - Teaching Students to Be Public Intellectuals - The Chronicle of Higher Education.pdf", "url": "https://umd.instructure.com/files/74199122/download?download_frd=1&verifier=HbBvT2DarMTxhC4nRI5bQpzoqNZUG4sJdjoyoLfc"}, "74198990": {"display_name": "Hedges - Softening Claims in Academic Writing ATI.pdf", "url": "https://umd.instructure.com/files/74198990/download?download_frd=1&verifier=KaOspzaLQRIxHoWL3VQW3xOeqFlLG4Hww7cvLkH5"}, "74199068": {"display_name": "Hinton - The Minneapolis Uprising in Context _ Boston Review.pdf", "url": "https://umd.instructure.com/files/74199068/download?download_frd=1&verifier=SqJDSxAAPz8X10CtSIxzQAGgq0BR7cPfvf0u32hw"}, "74199091": {"display_name": "Infographic and Reflective Memo Assignment.docx", "url": "https://umd.instructure.com/files/74199091/download?download_frd=1&verifier=aPmKDBcwxahlx1wFukekfEHdmLg6MbbttTkaZsqx"}, "74199087": {"display_name": "Inquiry Assignment Sheet.docx", "url": "https://umd.instructure.com/files/74199087/download?download_frd=1&verifier=SIjmlJuK2685nf2uKfAkBPEPUKEVrzEFFxWUlDWi"}, "74199054": {"display_name": "Inquiry Assignment.mp4", "url": "https://umd.instructure.com/files/74199054/download?download_frd=1&verifier=zmIADlOLau5Mt5wjX8NgdF4G6pP6CmMTvy7eWVPz"}, "74199077": {"display_name": "Inquiry Example 2.pdf", "url": "https://umd.instructure.com/files/74199077/download?download_frd=1&verifier=PsyKV0M273uyCjK2jC0XptOkrykyHcGofyaTOYxx"}, "74199092": {"display_name": "Inquiry Example.pdf", "url": "https://umd.instructure.com/files/74199092/download?download_frd=1&verifier=mbr2jYiKBKAcHepzeBLi5dvxbIVvZL0nx2cIPsxF"}, "74199117": {"display_name": "Introductions - The Writing Center - UNC Chapel Hill.pdf", "url": "https://umd.instructure.com/files/74199117/download?download_frd=1&verifier=yYNowTn89mbyIhgRGQd5BOJWBBj3mjoK9rP3v7hZ"}, "74199084": {"display_name": "Known New Contract.pdf", "url": "https://umd.instructure.com/files/74199084/download?download_frd=1&verifier=WVZLMw9IPYUQwaJRHVxHZqjhUe3lP0d62fy0UEKk"}, "74199097": {"display_name": "LaBossiere - Argument by Definition.pdf", "url": "https://umd.instructure.com/files/74199097/download?download_frd=1&verifier=gz9PEPRLFfxNyQWAuLNbmokniSe3ictc0C6eZvJV"}, "74199101": {"display_name": "Lamott - Shitty First Drafts.pdf", "url": "https://umd.instructure.com/files/74199101/download?download_frd=1&verifier=jd1dkJ9QZCdnH8dDXFLmNiMTpKk9EhNWhC050zOs"}, "74199114": {"display_name": "Literature Review 2021-2022.docx", "url": "https://umd.instructure.com/files/74199114/download?download_frd=1&verifier=1DieOZQfPYwymBGRSyxWur1wGNFBKtCEY7LUerum"}, "74199039": {"display_name": "Literature Review Example 1.pdf", "url": "https://umd.instructure.com/files/74199039/download?download_frd=1&verifier=gRAY6sYyTTfxj9m79sYKkT0xiqctQigjvcpBpJRz"}, "74199100": {"display_name": "Literature Review Example 2.pdf", "url": "https://umd.instructure.com/files/74199100/download?download_frd=1&verifier=ey3DfCe2CXd3AAwkMhNgUhJtHLCV4b2Rfy8Ip8pj"}, "74199104": {"display_name": "Literature Review.pptx", "url": "https://umd.instructure.com/files/74199104/download?download_frd=1&verifier=Z4tDiQYGosIhXmNEpDA1iNJXC8bkyFqnSx4HI145"}, "74199079": {"display_name": "Literature Reviews – The Writing Center • University of North Carolina at Chapel Hill.pdf", "url": "https://umd.instructure.com/files/74199079/download?download_frd=1&verifier=odYPa38Sepv4l6oGBNhqeMx0UPc4EiPjoOQUe9TK"}, "74199088": {"display_name": "Logos - Writing Commons.pdf", "url": "https://umd.instructure.com/files/74199088/download?download_frd=1&verifier=LSXL04bsa2S9FqN6KUCEdNQsYTsFk3NmlWyRvc2q"}, "74199060": {"display_name": "Logos and Enthymeme Slides.pptx", "url": "https://umd.instructure.com/files/74199060/download?download_frd=1&verifier=YtdvKImNeCBZhPJJzYtzc7arxW94Kr9rRVHkOvPc"}, "74199040": {"display_name": "Markham - The Unnecessary Cruelty of America’s Immigration System - The New York Times.pdf", "url": "https://umd.instructure.com/files/74199040/download?download_frd=1&verifier=eUBR0DltGY7YUbeltSPe1TWl9dJJSWBGWyGNa9dS"}, "74199028": {"display_name": "Mattern - Maintenance and Care.pdf", "url": "https://umd.instructure.com/files/74199028/download?download_frd=1&verifier=V7tEDLUdOKN7ozHzhfYDc8NWNosTT6tQXRpf2gQL"}, "74198997": {"display_name": "McKeldin Floor 6 map.png", "url": "https://umd.instructure.com/files/74198997/download?download_frd=1&verifier=083ybD6jhfriCmsbYDNmF180Sh8LX8ZwEm8giUrn"}, "74199098": {"display_name": "McKeldinFloor6-2022.png", "url": "https://umd.instructure.com/files/74199098/download?download_frd=1&verifier=4lwzZR1TMKpBwQiim2AqX5UxTI4Vb7VMeEcEy8wM"}, "74199059": {"display_name": "MLA Review.pptx", "url": "https://umd.instructure.com/files/74199059/download?download_frd=1&verifier=RjP9yrfVHqusnlPMRULdBMUynh2u6AgvA8e2pW1s"}, "74199096": {"display_name": "New Parts of a Full Argument.pptx", "url": "https://umd.instructure.com/files/74199096/download?download_frd=1&verifier=e1aQ2WKX8xP3qc03Zf9vcEkZortIWhdYviA6uUTs"}, "74198948": {"display_name": "Nguyen - On Being a Refugee an American and a Human Being.pdf", "url": "https://umd.instructure.com/files/74198948/download?download_frd=1&verifier=RFO4IkCQeUbwPvK62QLLzW4UOlMtICy30qvc2I8L"}, "74199050": {"display_name": "No, Robots Aren't Killing the American Dream.docx", "url": "https://umd.instructure.com/files/74199050/download?download_frd=1&verifier=n4VhpGi2yfZ7ZTdBCVvwclfzmMI6lpQzXfcLDwJd"}, "74199055": {"display_name": "Overview - Citing sources - LibGuides at MIT Libraries.pdf", "url": "https://umd.instructure.com/files/74199055/download?download_frd=1&verifier=av9STdbOCdfQ9WhJzAoLRKt8iJtI7zrNvGCW3C64"}, "74411264": {"display_name": "Peer Review Pro Tips.pptx", "url": "https://umd.instructure.com/files/74411264/download?download_frd=1&verifier=5P67UNCgZdc55SCCKLVC4rH3yMiQLWUJIBzUvoUx"}, "74199038": {"display_name": "Plagiarism_ Writing Guides_ Writing Tutorial Services_ Indiana University Bloomington.pdf", "url": "https://umd.instructure.com/files/74199038/download?download_frd=1&verifier=4rKvbNbxVec8Vttc8lb1071p15xzM6YOc4Kz7YkZ"}, "74199009": {"display_name": "Planting a Naysayer.mp4", "url": "https://umd.instructure.com/files/74199009/download?download_frd=1&verifier=jZgqJ9WBcx0sDUVRohr9zIQDmlY4pIixHm41MLIL"}, "74199062": {"display_name": "Proposal Arguments - .pdf", "url": "https://umd.instructure.com/files/74199062/download?download_frd=1&verifier=93eJwagvrnWlBNqAQqZ3BFpkJoHmkiJllZ3Xx1gR"}, "74199095": {"display_name": "Proposal Arguments.pptx", "url": "https://umd.instructure.com/files/74199095/download?download_frd=1&verifier=xP0N1zG2VrwU2dh4fV8fnVkt6C2Me1dt7JFGUjrq"}, "74199093": {"display_name": "Reverse Outlines - U of W Writing Center.pdf", "url": "https://umd.instructure.com/files/74199093/download?download_frd=1&verifier=dRWBq1y8y9anfeIzmXQM74LSphQcLQGdfVtvLQLY"}, "74199112": {"display_name": "Revising an Argumentative Paper - U of W Writing Center.pdf", "url": "https://umd.instructure.com/files/74199112/download?download_frd=1&verifier=6UPRm1YkuLk7GRqg9lAaKAKTYAoePgHKDsa8qff1"}, "74199120": {"display_name": "Revision Strategies for Longer Projects – The Writing Center – UW–Madison.pdf", "url": "https://umd.instructure.com/files/74199120/download?download_frd=1&verifier=NmKiOmEAvJi8RMugUMNM0dZRALZws68tENs0qiNs"}, "74198936": {"display_name": "Revision Strategies.pptx", "url": "https://umd.instructure.com/files/74198936/download?download_frd=1&verifier=bLngd6KUQGb2jQehJSkJqkiEPJbPvZRWMHGXzLnF"}, "74199045": {"display_name": "Rhetorical Analysis - ThinkTank - U of A.pdf", "url": "https://umd.instructure.com/files/74199045/download?download_frd=1&verifier=nLde2AOQC1XY8AHazYqVlOrYlRH6xfoavHxXVvmM"}, "74199069": {"display_name": "Rhetorical Analysis Assignment Sheet.docx", "url": "https://umd.instructure.com/files/74199069/download?download_frd=1&verifier=d9LfVltLmv2dLC5I9KNlM3ZfYcMCavCVOOadCaEo"}, "74199089": {"display_name": "Rhetorical Analysis Assignment.docx", "url": "https://umd.instructure.com/files/74199089/download?download_frd=1&verifier=oqMuJ401iBZFIBX7rgM2CDhfU9NfHAngC3urpZ50"}, "74199076": {"display_name": "Rhetorical Analysis Organization Plan.pptx", "url": "https://umd.instructure.com/files/74199076/download?download_frd=1&verifier=gNedLVM2bELAnWJkQMNakXOHu54Vi33PBUPxWN3x"}, "74199067": {"display_name": "Shantee Rosado - How to read academic work.pptx", "url": "https://umd.instructure.com/files/74199067/download?download_frd=1&verifier=QyoZNGKtWJF3ytn38nhpXdyUK2iF5bsLzk3lA4jm"}, "74199024": {"display_name": "Stasis Theory.docx", "url": "https://umd.instructure.com/files/74199024/download?download_frd=1&verifier=vXvrSJ6EmxIVk2xPkRrKuuYNKjIQhVTJvphP3nNe"}, "74199000": {"display_name": "Stasis Theory.mp4", "url": "https://umd.instructure.com/files/74199000/download?download_frd=1&verifier=WOzffFCoOkKnTE9JCkePS8xB4mjakhFFm1fPDXdx"}, "74199016": {"display_name": "Summary and Chunking.pptx", "url": "https://umd.instructure.com/files/74199016/download?download_frd=1&verifier=5QeqvaRbNFgSD0Xztw4BbvKVGC3OhcMrPLp23eGv"}, "74198986": {"display_name": "Ted Howell's Verbs for Intellectual Activity.docx.pdf", "url": "https://umd.instructure.com/files/74198986/download?download_frd=1&verifier=W68anX7sjMymhsM9uus29z1d3sYIkdUhhikadUfa"}, "74199049": {"display_name": "Tolentino - One Year of #MeToo_ What Women’s Speech Is Still Not Allowed to Do _ The New Yorker.pdf", "url": "https://umd.instructure.com/files/74199049/download?download_frd=1&verifier=Zl9X3sop01EJ5ihe4Rrfgdgyqcvg4X72jBNVh9S4"}, "74199046": {"display_name": "Transitions.pptx", "url": "https://umd.instructure.com/files/74199046/download?download_frd=1&verifier=S0n1t5zyvsMpH2WtHSdbPAbsU6EGuMuETPbo4yWW"}, "74199057": {"display_name": "TSIS The Art of Summarizing Quoting 30-51.pdf", "url": "https://umd.instructure.com/files/74199057/download?download_frd=1&verifier=n4TVjQCHFjxw7XSyNlW0pB2yhHaeyKPPKF0b5kcO"}, "74199075": {"display_name": "Visual Rhetoric Visual Literacy.pdf", "url": "https://umd.instructure.com/files/74199075/download?download_frd=1&verifier=tT21tcDSLZA5R2JPw3rZGQ8lG3t83QTEffrI1wLM"}, "74199029": {"display_name": "What Is Academic Writing.pdf", "url": "https://umd.instructure.com/files/74199029/download?download_frd=1&verifier=aoI8HbFb8OBxhegJt1joGhbQW1zB1EFtEAo2EbEX"}}}, "1355153": {"name": "IDEA101-0110: The Carillon Studio: Creative Problem Solving and Designing Your Maryland Experience-Fall 2023 sburch", "assignments": {"6450161": {"name": "Week 1 Reflection", "due_at": "2023-09-08T21:30:00Z", "description": "Part A: Share 1 takeaway from class this week and why it’s interesting, important to you or has changed the way you think about things. Part B : Choose 2 TerrapinSTRONG values and reflect on what they mean to you (Community, Connection, Inclusion). What is one goal you have for yourself with respect to one of these values? Connection: We want everyone to be able to build relationships and find people who can support us in our work and in life. We all deserve to have a connection to the history, place, and people of the university. We should understand how our work connects to the wider university mission and the vision of inclusion. We all have opportunities to get involved to become better people and to make UMD a better place. Community: We are a community that wants everyone to feel like a part of the family. We are all responsible to make this the most welcoming place possible so that everyone can succeed. We share the university’s values, and we work together to take care of each other. What can you do to create a stronger community? Inclusion: UMD should be a place where everyone can reach their full potential. There are resources available to support diverse people in diverse ways. All of us should feel seen, heard, and respected. We all have a responsibility to include everyone in our community and help everyone find their place at UMD."}, "6450167": {"name": "Week 2 Reflection", "due_at": "2023-09-15T21:30:00Z", "description": "Part A: This week, you met your team and started to get to know them. Teamwork is crucial for creativity, innovation, and addressing Big Questions because of the intermixing of different perspectives, experiences, and identities. Reflect on what you learned about your teammates and respond to the following: List 3 things you learned about your teammates (e.g. - how are they different from you, how are you similar, what do you hope to learn from them?) Part B: This week, you completed a StoryShare exercise in class (the topic was a meaningful team experience). Reflect on this exercise by responding to the following: Share 2 things you learned from StoryShare that informed your Team Canvas and why they are important. Share 1 way in which the StoryShare exercises impacted you or changed your perspective on the way you think about teams."}, "6450172": {"name": "Week 3 Reflection", "due_at": "2023-09-22T21:30:00Z", "description": "Regarding the Design My Maryland project, what is the Big Question you want to explore and answer? (e.g. choose a major, explore career paths within a particular discipline, etc.) What are 2 things you learned in class this week about the method of interviewing, and why are they important to you? What are 2 things you learned in class….that have helped you feel more confident conducting interviews or having conversations with people What is 1 way you can currently apply something about interviewing in your personal or academic life?"}, "6450179": {"name": "Week 4 Reflection", "due_at": "2023-09-29T21:30:00Z", "description": "Part A: In class, you self-assessed your friends & family interviews. Reflect on that self-assessment by responding to the following: Share 3 takeaways - 1) something you did really well, 2) something you found challenging, and would like to improve on, 3) something you learned about yourself from the interviews Part B: In class, we practiced three forms of Idea Generation — mind maps, generating ideas on post-its and generating ideas using constraints. Reflect on idea generation by responding the following: What are 2 things you learned about idea generation that helped you come up with more ideas, and/or helped you come up with more unexpected / original ideas? What is 1 thing about idea generation that might apply to your life beyond this course (personally, professionally, or academically)?"}, "6450182": {"name": "Week 5 Reflection", "due_at": "2023-10-06T21:30:00Z", "description": "This week in class, we introduced a new design mode of working: Experimenting. We also helped each other find people to interview using the Reciprocity Ring. What is interesting, exciting, thought-provoking, valuable, and/or insightful to you about Experimenting, and why? Reflect on the Reciprocity Ring activity. In what ways did this contribute to your sense of belonging in this community? More broadly, how connected do you feel to the community in our course on a s cale of 1 - 10. 1 is not at all connected, and 10 is extremely connected What are 2 things you can do to strengthen the community? Community: We are a community that wants everyone to feel like a part of the family. We are all responsible to make this the most welcoming place possible so that everyone can succeed. We share the university’s values, and we work together to take care of each other. What can you do to create a stronger community?"}, "6450187": {"name": "Week 6 Reflection", "due_at": "2023-10-13T21:30:00Z", "description": "This week, we didn’t meet as a section in order to give you time and space to make progress on your Design My Maryland project. Reflect on the work you did individually for IDEA101 this week, by responding to the following questions. What progress have you made with respect to the Design My Maryland project this week? What is something you learned this week about networking and/or finding resources to help you explore potential futures?"}, "6450191": {"name": "Week 7 Reflection", "due_at": "2023-10-20T21:30:00Z", "description": "This week, we interviewed faculty to learn about their profession and experiences. We also received feedback from faculty on the interviews you conducted with them. What was the experience like preparing for the faculty interview with your team? What did your team do well during the interview? What was something that one of your group members did that you found particularly helpful during the interview? What are 2 interesting, valuable, or thought-provoking things you learned from the faculty you interviewed? What is 1 takeaway you have about interviewing that you can apply to your interviewing assignment for this class?"}, "6450196": {"name": "Week 8 Reflection", "due_at": "2023-10-27T21:30:00Z", "description": "1. This week in class, we practiced the design mode of Generating Ideas. We started by individually coming up with ideas using radical constraints, then you used “yes, and!” to build on the ideas of your teammates and generate more ideas. WHAT: What about these methods of generating ideas is new to you? SO WHAT: Which techniques helped you increase the quantity of your ideas? Which techniques helped you increase the diversity of your ideas? Which techniques helped you increase the originality of your ideas? NOW WHAT: What did you learn from this experience about the value of generating ideas in this way? What learnings can you apply as you move forward? 2. This week in class, we also practiced the design mode of Experimenting — specifically, we used the method of storyboarding to help us quickly flesh out or develop a rough idea. WHAT: What are your thoughts about this method of developing an idea — storyboarding? SO WHAT: What worked well, and what did not work well? NOW WHAT: What did you learn from this experience about the value of developing an idea and experimenting in this way? What learnings can you apply as you move forward?"}, "6450200": {"name": "Week 9 Reflection", "due_at": "2023-11-03T21:30:00Z", "description": "1. This week in class, we again practiced the design mode of Experimenting. We started by inviting each person on the team to create a physical prop to bring a critical moment in the storyboard to life. Then, we tested the idea — this meant showing a classmate a rough storyboard and a quickly built prop and using those things to get feedback. WHAT: What did you notice about testing an idea in this way (building something concrete and quickly getting feedback)? How was it different from the way you would normally approach a problem? SO WHAT: What was the value of experimenting in this design project? In other words, why did we experiment and test in the way that we did? How did this impact your project? NOW WHAT: What did you learn from this experience about the value of testing and/or experimenting? What learnings can you apply as you move forward? 2. This week in class, we practiced the design mode of Listening & Noticing. You interviewed a classmate to learn more about your team’s idea in the context of your partner’s specific experience. WHAT: What is something new you learned about interviewing someone? SO WHAT: What was the value of listening & noticing in this design project? In other words, why did we listen & notice in the way that we did? How did this impact your project? NOW WHAT: What did you learn from this experience about the value of interviewing and/or Listening & Noticing? What learnings can you apply as you move forward?"}, "6450156": {"name": "Week 10 Reflection", "due_at": "2023-11-10T22:30:00Z", "description": "This week in class, you worked with your team to generate ideas for each other’s My Maryland Plan. What was something (a course or activity) that a teammate suggested to you (that you hadn't thought about) that is exciting to you? And what’s a contribution that you made to your teamwork this week that you’re particularly proud of? What are 2 things you find valuable about working in a team this week? This week in class, you were using the design mode of Generating Ideas. What was it like to generate ideas for both your own and your teammate’s My Maryland Plan this week? What was something new you learned about this design mode (generating ideas) this week, and what about that is interesting or helpful to you?"}, "6450110": {"name": "Meaningful Teamwork Story", "due_at": "2023-09-13T20:00:00Z", "description": "We'll be collaborating in small teams during this course. During the next class, you'll meet your team. You'll have a chance to get to know your teammates by sharing a story about a meaningful team experience. Let's prepare you for that conversation. In your Carillon Studio notebook, spend a few minutes writing about a meaningful team experience you've had.  This team experience could have been for a school project or activity, a sports team, a dance team, a robotics team, etc. (You’ll need this story in class, so as always, make sure to bring your notebook with you to class.) When you’re ready, respond to the following to complete this mission: Look back at the team experience you wrote about. Why did you choose that one? What was meaningful about it?"}, "6450153": {"name": "Team Canvas", "due_at": "2023-09-20T20:00:00Z", "description": "Team Canvas What norms would you like to set as a team? What does your team need to do in order to collaborate effectively? As a team, discuss the five areas found on the Team Canvas template: People & Personal Goals Values Goals Norms Purpose Collaborate to create a canvas that captures your discussion and the norms you agree to as a team. Use the Team Canvas template as guidance for your discussion, but you do not have to submit in that format. Your Team Canvas can take any shape, as long as it touches on the five areas. Feel free to work in any medium (google slides, google docs, etc). I have included a link below that will automatically make a copy of the canvas into an editable google slides deck on your google drive, in case you’d like to use that. Once you're ready to submit, please provide me with a link to view and comment on your document. (If you are working in a google doc or google slides, please change the permissions such that I can both view and comment on your work.)  Each team member should submit a link to the same Team Canvas. ------- Resources for Assignment Team Canvas (pdf version of template) // click here to access Team Canvas (google slides version of template) // click here to make a copy of the template in an editable google slide"}, "6450144": {"name": "Self-Reflection", "due_at": "2023-09-20T20:00:00Z", "description": "Next week, we’ll be launching the Design My Maryland project — a project where you’ll use design modes of working to explore potential futures and chart your path here at Maryland. Before diving into that project, take a moment to engage in some self-reflection. You’ll need your notebook for this self-reflection. When you’re ready, click on the linked module below, and it will guide you through a 20 minute written reflection. When you’re done, respond to the following to complete this mission: What did you learn from completing the self-reflection? (If you didn't discover anything new, perhaps reflect a bit more deeply!) ------- Resources for Assignment https://app.nearpod.com/?pin=QUVXH Please use this google slide deck to complete the reflection if the Nearpod link above isn’t working."}, "6450129": {"name": "Reflective Survey, Part I", "due_at": "2023-09-20T20:00:00Z", "description": "Reflective Survey, Part I For this assignment you will answer a series of 23 questions designed to help you reflect about how you approach different situations. It's important that you answer each item as honestly as you can. There are no right answers. Do not linger over each statement—keep moving. Once you’ve completed the survey, you will be prompted to download a Certificate of Completion. Please download that and upload it here in ELMS to receive credit for completing this mission! ------- Resources for Assignment Link to survey: https://forms.gle/bHGUmeixCusBt2Wx7"}, "6450134": {"name": "Reflective Survey, Part II", "due_at": "2023-11-22T04:59:59Z", "description": "Reflective Survey, Part II For this assignment, you will answer a series of 20 questions designed to help you reflect on how you approach different situations. It's important that you answer each item as honestly as you can. There are no right answers. Do not linger over each statement—keep moving. ------- Resources for Assignment Link to survey: https://forms.gle/8u4GExA6VkPzQGvD9"}, "6450088": {"name": "Friends & Family Interviews", "due_at": "2023-09-27T20:00:00Z", "description": "Friends and Family Interviews Interview one friend (not in this class) and one family member (for a total of two interviews) in order to learn their perspectives on your strengths and your interests. Use the asynchronous module linked below to prepare for these interviews. During your interview, take notes in your Carillon Studio notebook, and as always, bring your notebook to class to refer to next week. In addition, respond to the following questions to complete this mission: What did you learn about yourself from completing your friends & family interviews? What did you learn about the method of interviewing? ------- Resources for Assignment Async Module: Preparing for Friends & Family Interviews"}, "6450138": {"name": "Select Two Futures to Explore", "due_at": "2023-10-04T20:00:00Z", "description": "It's time to pick two potential futures to explore throughout the rest of this course. First, gather all of the potential Fearless Mission Statements you generated in class. Then, use the asynchronous modules linked below to select two futures to explore. When you’re ready, respond to the following questions to complete this mission: What is the Fearless Mission Statement that describes your Potential Future A? What is the Fearless Mission Statement that describes your Potential Future B? ------- Resources for Assignment Async Module: Select Two Futures to Explore"}, "6450106": {"name": "Interview Plan", "due_at": "2023-10-11T20:00:00Z", "description": "Interview Plan Who would you like to interview? Use the asynchronous module linked below to guide you through selecting two professionals to interview and drafting an email to each professional. When you’re ready, respond to the following questions to complete this mission: Name one of the professionals you plan to interview. Who are they, and how are you connected to them? What do you want to learn from them? Name another professional you plan to interview. Who are they, and how are you connected to them? What do you want to learn from them? ------- Resources for Assignment Async Module: Draft your Email to your Potential Interviewees"}, "6450080": {"name": "Draft Email to Professionals", "due_at": "2023-10-18T20:00:00Z", "description": "Draft Email to Professionals In many instances your first step in obtaining an interview may be through email. Contacting professionals and faculty in the hopes that they respond requires a different approach from daily emails. In a google doc, draft an email that you will use to reach out to potential interviewees and submit the link so that I can provide feedback. This email should reflect what you have learned about the individual you are hoping to interview and why their work interests you. Don’t forget to set up the permissions for your google doc such that I have access to your document! If you want me to read it and provide feedback, please either share the google doc with me, or write me an email and provide me with the link. This mission is NOT required, but is highly recommended! Email your draft to sburch@umd.edu. ------- Resources for Assignment Async Module: Draft your Email to your Potential Interviewees"}, "6450092": {"name": "Interview 1", "due_at": "2023-11-08T21:00:00Z", "description": "Interview 1 There are people out there living your Potential Future A…today! Conduct an interview with a professional that is engaged in work related to either the What or the Why part of your Fearless Mission Statement. For example, let’s say your Fearless Mission Statement is: In this future, I will design interactive museum exhibits for kids so that kids feel excited to learn about and engage with history. The *perfect* interviewee would be finding someone who does exactly that — maybe someone who works at the National Museum of Natural History and is in charge of Family Programs. It’s definitely worth trying to track that person down! Another option would be to find someone that designs museum exhibits for audiences more broadly. Or, another option would be to find someone that is engaging young kids in learning about history — a teacher or a theater director at a children’s theater. Or you could take it in a different direction — someone who works for Khan Academy designing interactive history digital content for kids. Here’s a process to follow in order to complete this mission: Complete the asynchronous modules called Draft your Email to Professionals . Reach out to the professionals to schedule a 30-minute interview by phone or Zoom. (We recommend reaching out to more than two in case someone doesn’t respond.) Complete the asynchronous module called Create an Interview Guide to craft questions for your interview. Interview the professional to learn about what their day-to-day work is like. Explore your assumptions and questions. Find out what it’d be like to live in that future. Make sure to take notes in your notebook while you interview. After your interview, access the asynchronous module linked below to process what you learned and figure out what that means for you and the potential future you’re exploring. When you’re ready, respond to the following questions to complete this mission: What. What was the potential future you were exploring with this interview? (Provide the Fearless Mission Statement.) What were the most interesting and/or unexpected things that you learned from your interviewee. (Name at least two things.) So What. What does this mean for you? How has this interview impacted your view of this potential future? Now What. Now what are you thinking about with respect to this potential future? Share your revised Fearless Mission Statement for this potential future. ------- Resources for Assignment Async Module: Process Your Interview Data"}, "6450096": {"name": "Interview 2", "due_at": "2023-11-08T21:00:00Z", "description": "Interview 2 There are people out there living your Potential Future B…today! Conduct an interview with a professional that is engaged in work related to either the What or the Why part of your Fearless Mission Statement. For example, let’s say your Fearless Mission Statement is: In this future, I will design interactive museum exhibits for kids so that kids feel excited to learn about and engage with history. The *perfect* interviewee would be finding someone who does exactly that — maybe someone who works at the National Museum of Natural History and is in charge of Family Programs. It’s definitely worth trying to track that person down! Another option would be to find someone that designs museum exhibits for audiences more broadly. Or, another option would be to find someone that is engaging young kids in learning about history — a teacher or a theater director at a children’s theater. Or you could take it in a different direction — someone who works for Khan Academy designing interactive history digital content for kids. Here’s a process to follow in order to complete this mission: Complete the asynchronous modules called Draft your Email to Professionals . Reach out to the professionals to schedule a 30-minute interview by phone or Zoom. (We recommend reaching out to more than two in case someone doesn’t respond.) Complete the asynchronous module called Create an Interview Guide to craft questions for your interview. Interview the professional to learn about what their day-to-day work is like. Explore your assumptions and questions. Find out what it’d be like to live in that future. Make sure to take notes in your notebook while you interview. After your interview, access the asynchronous module linked below to process what you learned and figure out what that means for you and the potential future you’re exploring. When you’re ready, respond to the following questions to complete this mission: What. What was the potential future you were exploring with this interview? (Provide the Fearless Mission Statement.) What were the most interesting and/or unexpected things that you learned from your interviewee. (Name at least two things.) So What. What does this mean for you? How has this interview impacted your view of this potential future? Now What. Now what are you thinking about with respect to this potential future? Share your revised Fearless Mission Statement for this potential future. ------- Resources for Assignment Async Module: Process Your Interview Data"}, "6450149": {"name": "Sign Up for One-on-One Meeting", "due_at": "2023-10-08T03:59:59Z", "description": "In Week 6, instead of meeting as a full section, I will meet with each of you individually for 15 minutes. Sign up for an appointment slot on my Google Calendar . Please let me know no if there are no available times that work for you. THIS PAGE WILL BE AVAILABLE UNTIL SATURDAY, OCTOBER 7th. https://calendar.app.google/DsEEo1Zt2CMrGVgT9"}, "6450102": {"name": "Interview Guide", "due_at": "2023-10-18T20:00:00Z", "description": "Interview Guide Hooray! The professional that you want to interview and learn from has said yes to an interview! Time to think more specifically about what you want to learn and what you’re going to ask. Use the asynchronous module linked below to guide you through creating an Interview Guide for both of your interviews. Don’t forget to: Think about how you will begin the interview. Ask questions that are specific to the person; don’t ask things that you could easily find the answer to on Google. (You might want to read as much as you can about them, if possible beforehand.) Once you’ve created your Interview Guides, please answer the following questions to complete this mission: What is a question you’re curious to ask during Interview 1? What is a question you’re curious to ask during Interview 2? ------- Resources for Assignment Async Module: Create an Interview Guide"}, "6450074": {"name": "Design Project Synthesis", "due_at": "2023-11-08T21:00:00Z", "description": "Design Project Synthesis Yay! You’ve completed a team design project! With your team, synthesize and summarize what you learned during this project. Create a poster-sized visual that responds to the following: 1. What was the concept you came up with and tested? Headline your idea and share the various storyboard versions of your idea. 2. Synthesize what you learned about the following: What did you learn about the people impacted by this design challenge? What did you learn about the design challenge topic itself? What did you learn about the idea you came up with and tested? 3. What are you inspired to do next? Use the templates (printed on 11x17 size paper) available in class. Once you’ve created your poster, take a *good* picture of it, and submit the photo to complete this mission. (If you can’t capture everything in one photo, you can submit multiple photos.) This mission is to be completed with your team, but each person on the team should still submit the deliverable in order to receive credit. Definition of a *good* picture: Right side up! (Not sideways & not upside down!) Crisp image! (Not blurry!) Readable text! (Can zoom in to see detail if needed!) ------- Resources for Assignment Synthesis Template // Here is a link to a pdf of the template provided in class"}, "6450123": {"name": "Personal Elevator Pitch", "due_at": "2023-11-15T21:00:00Z", "description": "Prepare a 1-2 minute \"elevator pitch\" that you might use to introduce yourself in a professional setting. Your goal is to describe who you are, what you want to do and what you’ve learned so far about your path in college and beyond. Use elements of storytelling, including a Story Arc, in your pitch. Use the Asynchronous Module linked below to help you craft your pitch. The module contains a basic template for your pitch. When you prepare your pitch, decide who your audience is and speak to them. Remember, your audience should be someone you might encounter in a professional setting. They could be a recruiter for a specific organization/company you’re interested in. Or, they could be a professor you want to work with / research with. You should submit a short description of who your audience is along with your pitch. Be as specific as possible with who your audience is. “Potential Employer” will not suffice. Record yourself delivering the elevator pitch and submit by the due date indicated. As part of the last class, we will screen all of the pitches. You may choose to record audio-only or audio & video. Please submit: A google drive link to your media file. Please upload your media file to google drive, and submit the link in order to complete this assignment. Make sure to change the settings on the file link such that I can access it. A short description of your intended audience. Be as specific as possible. ------- Resources for Assignment Async Module: Crafting an Elevator Pitch Personal Elevator Pitch Rubric (pdf) // click here to access Personal Elevator Pitch template (pdf) // click here to access"}, "6450114": {"name": "My Maryland Plan", "due_at": "2023-11-22T04:59:59Z", "description": "My Maryland Plan Using the template provided, design a My Maryland Plan. Your plan should be inspired by two of the Fearless Mission Statements that you are currently exploring. The plan should include at least four courses and four activities that you would like to engage in while here at Maryland that will help you explore your Fearless Mission Statements. (Activities are defined as things you don’t get academic credit for: internships, student clubs, research opportunities, etc.) Think of this plan as a way to make the time you spend here on-campus, your own! We encourage you to not just pick courses that are required as a part of your degree requirements; pick courses that will truly serve you and your interests. ------- Resources for Assignment My Maryland Plan Template (this is a view-only file so that you can preview what it looks like) // click here to make a local copy that is editable Note: Once you click on the link provided above, a copy of the template will be automatically made to your google drive. Once you're ready to submit, make sure that the permissions are such that I can access. (I prefer that you grant me edit access so that I may provide comments in the document.) My Maryland Plan Rubric"}, "6450038": {"name": "Sept 11 // MCS Reflection", "due_at": "2023-09-15T21:00:00Z", "description": "In order to receive credit for attending this M onday C ommunity S ession, please respond to following questions."}, "6449984": {"name": "Sept 18 // MCS Reflection", "due_at": "2023-09-22T21:00:00Z", "description": "In order to receive credit for attending this M onday C ommunity S ession, please respond to following questions."}, "6450003": {"name": "Sept 25 // MCS Reflection", "due_at": "2023-09-29T21:00:00Z", "description": "In order to receive credit for attending this M onday C ommunity S ession, please respond to following questions. Remember that two specific sessions (October 2 Bystander Training and November 6 Faculty Roundtable) are required. If you have already completed 2 other Monday Community Session Reflections, and attended this session to receive extra credit, please complete one of the Extra Credit Reflection assignments instead."}, "6450043": {"name": "October 2 // MCS Reflection", "due_at": "2023-10-06T21:00:00Z", "description": "In order to receive credit for attending this M onday C ommunity S ession, please respond to following questions. Remember that this session (October 2 — Bystander Training) is required."}, "6450025": {"name": "October 9 // MCS Reflection", "due_at": "2023-10-13T21:00:00Z", "description": "In order to receive credit for attending this M onday C ommunity S ession, please respond to following questions. Remember that two specific sessions (October 2—Bystander Training and November 6—Faculty Roundtable) are required. If you have already completed 2 other Monday Community Session Reflections, and attended this session to receive extra credit, please complete one of the Extra Credit Reflection assignments instead."}, "6450046": {"name": "October 16 // MCS Reflection", "due_at": "2023-10-20T21:00:00Z", "description": "In order to receive credit for attending this M onday C ommunity S ession, please respond to following questions. Remember that two specific sessions (October 2—Bystander Training and November 6—Faculty Roundtable) are required. If you have already completed 2 other Monday Community Session Reflections, and attended this session to receive extra credit, please complete one of the Extra Credit Reflection assignments instead."}, "6449976": {"name": "October 23 // MCS Reflection", "due_at": "2023-10-27T21:00:00Z", "description": "In order to receive credit for attending this M onday C ommunity S ession, please respond to following questions. Remember that two specific sessions (October 2—Bystander Training and November 6—Faculty Roundtable) are required. If you have already completed 2 other Monday Community Session Reflections, and attended this session to receive extra credit, please complete one of the Extra Credit Reflection assignments instead."}, "6449969": {"name": "October 30 // MCS Reflection", "due_at": "2023-11-03T21:00:00Z", "description": "In order to receive credit for attending this M onday C ommunity S ession, please respond to following questions. Remember that two specific sessions (October 2—Bystander Training and November 6—Faculty Roundtable) are required. If you have already completed 2 other Monday Community Session Reflections, and attended this session to receive extra credit, please complete one of the Extra Credit Reflection assignments instead."}, "6450031": {"name": "November 6 // MCS Reflection - Required", "due_at": "2023-11-10T22:00:00Z", "description": "In order to receive credit for attending this M onday C ommunity S ession, please respond to following questions. Remember this session (Faculty Roundtable) is required!"}, "6449996": {"name": "November 13 // MCS Reflection", "due_at": "2023-11-17T22:00:00Z", "description": "In order to receive credit for attending this M onday C ommunity S ession, please respond to following questions. Remember that two specific sessions (October 2—Bystander Training and November 6—Faculty Roundtable) are required. If you have already completed 2 other Monday Community Session Reflections, and attended this session to receive extra credit, please complete one of the Extra Credit Reflection assignments instead."}, "6450085": {"name": "Final Course Reflection", "due_at": "2023-11-22T04:59:59Z", "description": "You’re almost there! We have one last reflection for you related to this course; however, we encourage you to maintain the practice of reflection that you have started in this course in other courses and beyond. Reflection is how we learn. Please complete the survey found via this link: https://umdsurvey.umd.edu/jfe/form/SV_8uZFaxzQZ85Ulls This survey is part final reflection and part assessment of your course experience. As we are using a survey tool that is external to ELMS  you will need to input your name and section number and you will not receive a notification in ELMS that the survey has been completed. Once you see a message that says “Thank you,” you will know that the survey is submitted. If you have questions about the submission please ask me."}, "6450017": {"name": "Extra Credit Reflection I", "due_at": "2023-11-17T22:00:00Z", "description": "You will receive extra credit for any additional Monday Community Sessions you attend. Each session is worth 2 points, and you can earn up to 6 points of extra credit. Complete this reflection for an extra community session you attend in order to receive extra credit."}, "6450010": {"name": "Extra Credit Reflection II", "due_at": "2023-11-17T22:00:00Z", "description": "You will receive extra credit for any additional Monday Community Sessions you attend. Each session is worth 2 points, and you can earn up to 6 points of extra credit. Complete this reflection for an extra community session you attend in order to receive extra credit."}, "6449991": {"name": "Extra Credit Reflection III", "due_at": "2023-11-17T22:00:00Z", "description": "You will receive extra credit for any additional Monday Community Sessions you attend. Each session is worth 2 points, and you can earn up to 6 points of extra credit. Complete this reflection for an extra community session you attend in order to receive extra credit."}}, "files": {}}, "1361999": {"name": "MATH240-0311,0312,0313,0321,0322,0323,0331,0332: Introduction to Linear Algebra-Spring 2024 wwong123", "assignments": {"6691975": {"name": "Suggested Exercises", "due_at": null, "description": "NOTHING is submitted.  Practice at your own leisure. Suggested_Exercises.pdf"}, "6708448": {"name": "Assignment 1", "due_at": "2024-02-17T04:59:59Z", "description": "The first Matlab assignment is due Friday February 16, 2024 at 11:59 PM (Maryland time) on Gradescope. You may work with up to 2 other people ( groups of 3 ) and submit one PDF on Gradescope. Make sure to add ALL NAMES TO YOUR GROUP when you submit 1 file on Gradescope.  THERE SHOULD BE AN OPTION TO \"ADD GROUP MEMBERS.\"  MAKE SURE TO MARK THE PAGES. Matlab can be downloaded for free here: https://terpware.umd.edu/Windows/Title/1849 Basic instructions on using Matlab can be found here: MATLAB_basics.pdf A simple template you can start your assignment with, and Publish to see the correct formatting: Example_Matlab_File.m A sample output of what your file should look like: Example_Matlab_File_Output.pdf A simple tutorial to upload to Gradescope and HOW TO MARK YOUR PAGES: Gradescope_tutorial.mp4 Assignment1_S24.pdf"}, "6722886": {"name": "Assignment 2", "due_at": "2024-03-16T03:59:59Z", "description": "The second Matlab assignment is due Friday March 15, 2024 at 11:59 PM (Maryland time) on Gradescope. You may work with up to 2 other people ( groups of 3 ) and submit one PDF on Gradescope. Make sure to add ALL NAMES TO YOUR GROUP when you submit 1 file on Gradescope.  THERE SHOULD BE AN OPTION TO \"ADD GROUP MEMBERS.\"  MAKE SURE TO MARK THE PAGES. Assignment2_S24.pdf"}, "6740353": {"name": "Assignment 3", "due_at": "2024-04-15T03:59:59Z", "description": "The third Matlab assignment is due Sunday April 14, 2024 at 11:59 PM (Maryland time) on Gradescope. You may work with up to 2 other people ( groups of 3 ) and submit one PDF on Gradescope. Make sure to add ALL NAMES TO YOUR GROUP when you submit 1 file on Gradescope.  THERE SHOULD BE AN OPTION TO \"ADD GROUP MEMBERS.\"  MAKE SURE TO MARK THE PAGES. Assignment3_S24.pdf"}, "6757138": {"name": "Assignment 4", "due_at": "2024-05-05T03:59:59Z", "description": "The fourth Matlab assignment is due Saturday May 4, 2024 at 11:59 PM (Maryland time) on Gradescope. You may work with up to 2 other people ( groups of 3 ) and submit one PDF on Gradescope. Make sure to add ALL NAMES TO YOUR GROUP when you submit 1 file on Gradescope.  THERE SHOULD BE AN OPTION TO \"ADD GROUP MEMBERS.\"  MAKE SURE TO MARK THE PAGES. Assignment4_S24.pdf"}, "6713842": {"name": "Quiz 1", "due_at": null, "description": null}, "6717827": {"name": "Quiz 2", "due_at": null, "description": null}, "6722657": {"name": "Quiz 3", "due_at": null, "description": null}, "6728136": {"name": "Quiz 4", "due_at": null, "description": null}, "6737524": {"name": "Quiz 5", "due_at": null, "description": null}, "6740398": {"name": "Quiz 6", "due_at": null, "description": null}, "6745052": {"name": "Quiz 7", "due_at": null, "description": null}, "6749652": {"name": "Quiz 8", "due_at": null, "description": null}, "6757737": {"name": "Quiz 9", "due_at": null, "description": null}, "6762966": {"name": "Quiz 10", "due_at": null, "description": null}, "6723307": {"name": "Exam 1 Practice", "due_at": null, "description": "PracticeProblemsExam1.pdf"}, "6743628": {"name": "Exam 2 Practice", "due_at": null, "description": "PracticeProblemsExam2.pdf"}, "6760674": {"name": "Exam 3 Practice", "due_at": null, "description": "PracticeProblemsExam3.pdf"}, "6730062": {"name": "Exam 1", "due_at": null, "description": null}, "6750890": {"name": "Exam 2", "due_at": null, "description": null}, "6768456": {"name": "Exam 3", "due_at": null, "description": null}, "6776744": {"name": "Final Exam", "due_at": null, "description": null}}, "files": {"76791506": {"display_name": "240_Syllabus.pdf", "url": "https://umd.instructure.com/files/76791506/download?download_frd=1&verifier=3j0stEfBWYU5jD26y8LUwhNhokDfJwOyCJsjZ7Bu"}, "77071082": {"display_name": "Assignment1_S24.pdf", "url": "https://umd.instructure.com/files/77071082/download?download_frd=1&verifier=9RCW76l7EOOwc6VHtA47kVR416E1AcLsvwFZiaST"}, "77194794": {"display_name": "Assignment2_S24.pdf", "url": "https://umd.instructure.com/files/77194794/download?download_frd=1&verifier=iWmbtOVPtwOj1LnKWv9AwgSaDOk5uYD3A0vg633n"}, "77879089": {"display_name": "Assignment3_S24.pdf", "url": "https://umd.instructure.com/files/77879089/download?download_frd=1&verifier=7RKTfcqRjq5cTR5EHkPJT8EtFfoatmAuIJjYPA2E"}, "78141593": {"display_name": "Assignment4_S24.pdf", "url": "https://umd.instructure.com/files/78141593/download?download_frd=1&verifier=CJTdHTMyLmFY6iWM4QAsovvMw19ltGgVQfcF0jdh"}, "76885184": {"display_name": "Example_Matlab_File_Output.pdf", "url": "https://umd.instructure.com/files/76885184/download?download_frd=1&verifier=peUaroaVcEaOfU84MYs6zZTNkC2usfp4GZ2ohNrZ"}, "76885181": {"display_name": "Example_Matlab_File.m", "url": "https://umd.instructure.com/files/76885181/download?download_frd=1&verifier=2bAlENtcSY0cmE1gsZgtIrWk2abHkrDu4QbnH4JZ"}, "76791409": {"display_name": "Gradescope_tutorial.mp4", "url": "https://umd.instructure.com/files/76791409/download?download_frd=1&verifier=k8H5oLI5n2cb7ZXTCjSHx92ATJstJ21ATgVWMGbe"}, "76885148": {"display_name": "MATLAB_basics.pdf", "url": "https://umd.instructure.com/files/76885148/download?download_frd=1&verifier=aDFHQJ9D4TEjvGkWan7IojCAGGVY0ICVK7knefTn"}, "77213122": {"display_name": "PracticeProblemsExam1.pdf", "url": "https://umd.instructure.com/files/77213122/download?download_frd=1&verifier=cBf0jlp0bwfUZ4Z5O6e800IXE3JU0BQplH9YGyik"}, "77766407": {"display_name": "PracticeProblemsExam2.pdf", "url": "https://umd.instructure.com/files/77766407/download?download_frd=1&verifier=XlGKe2EJu27WTQpHUacQSwdCkVTEnjE3aicQqH0o"}, "78235759": {"display_name": "PracticeProblemsExam3.pdf", "url": "https://umd.instructure.com/files/78235759/download?download_frd=1&verifier=oazadsVogBtxcWsBT7Vi70GoBzAgHYJuD6MXseIA"}, "77317530": {"display_name": "Quiz4_Sol.pdf", "url": "https://umd.instructure.com/files/77317530/download?download_frd=1&verifier=y6aU6TCcfgDMzzCZAxJ1YVF6OFzc8l3GMEFbbqxe"}, "77930834": {"display_name": "SolQuiz8.pdf", "url": "https://umd.instructure.com/files/77930834/download?download_frd=1&verifier=GBTMu23gQr2RceblWm2kwo8Cyy4rHyvEQJUhMlwI"}, "76791357": {"display_name": "Suggested_Exercises.pdf", "url": "https://umd.instructure.com/files/76791357/download?download_frd=1&verifier=1BGKyFcmfhsEeZfTFXCsbD8b17jaeA10VmwhI4cP"}}}, "1370449": {"name": "MATH241-0311,0312,0321,0322,0331,0332,0341,0342: Calculus III-Fall 2024 jiconway", "assignments": {"6829911": {"name": "MATLAB Project 1", "due_at": "2024-10-01T03:59:59Z", "description": null}, "6829912": {"name": "MATLAB Project 2", "due_at": "2024-10-29T03:59:00Z", "description": null}, "6829913": {"name": "MATLAB Project 3", "due_at": "2024-12-10T04:59:59Z", "description": null}, "6829914": {"name": "Quiz 1", "due_at": null, "description": null}, "6829915": {"name": "Quiz 2", "due_at": null, "description": null}, "6829916": {"name": "Quiz 3", "due_at": null, "description": null}, "6829917": {"name": "Quiz 4", "due_at": null, "description": null}, "6829918": {"name": "Quiz 5", "due_at": null, "description": null}, "6829919": {"name": "Quiz 6", "due_at": null, "description": null}, "6829920": {"name": "Quiz 7", "due_at": null, "description": null}, "6829921": {"name": "Quiz 8", "due_at": null, "description": null}, "6829922": {"name": "Quiz 9", "due_at": null, "description": null}, "6833149": {"name": "Quiz 10", "due_at": null, "description": null}, "6829906": {"name": "Exam 1", "due_at": null, "description": null}, "6829907": {"name": "Exam 2", "due_at": null, "description": null}, "6829908": {"name": "Exam 3", "due_at": null, "description": null}, "6829910": {"name": "Final Exam", "due_at": null, "description": null}}, "files": {"79567533": {"display_name": "01 August 26 - 11.1.pdf", "url": "https://umd.instructure.com/files/79567533/download?download_frd=1&verifier=jiVQUPuTGJxH2jpLmjiumpyUWmXgv9IahbGnkWP0"}, "79622321": {"display_name": "02 August 28 - 11.2.pdf", "url": "https://umd.instructure.com/files/79622321/download?download_frd=1&verifier=DAI1xMkJZC9oNR3Xy7cv6jb3MOyQSuRuiCXwogj0"}, "79657286": {"display_name": "03 August 30 - 11.3.pdf", "url": "https://umd.instructure.com/files/79657286/download?download_frd=1&verifier=qBUEmrzVPKVarNF9s6w5iJNGtBrUhWKEQBCQAb8q"}, "79715844": {"display_name": "04 September 4 - 11.4.pdf", "url": "https://umd.instructure.com/files/79715844/download?download_frd=1&verifier=QbfWH7iaHu4Cea6sYuvTyIwPSTdAiPqpyVf3GNDf"}, "79755085": {"display_name": "05 September 6 - 11.5.pdf", "url": "https://umd.instructure.com/files/79755085/download?download_frd=1&verifier=SwEeeb5St839Av6970dVHRG17M9UrF7EcGIr5dmd"}, "79793650": {"display_name": "06 September 9 - 11.6.pdf", "url": "https://umd.instructure.com/files/79793650/download?download_frd=1&verifier=1J3NWdT7nY1cqjlzUuEvb7c3CiKDTPGr9pEYCfkw"}, "79847046": {"display_name": "07 September 11 - 12.1, 12.2.pdf", "url": "https://umd.instructure.com/files/79847046/download?download_frd=1&verifier=K0a5BJzV8UoSWA3W6gSaiR5G2yq9LyeWLoY1cv6u"}, "79892314": {"display_name": "08 September 13 - 12.3.pdf", "url": "https://umd.instructure.com/files/79892314/download?download_frd=1&verifier=ZkxRTFBvPgQnsM2XBlviQQY000iMIzTEtyPksxQ7"}, "79064520": {"display_name": "Example_Matlab_File.m", "url": "https://umd.instructure.com/files/79064520/download?download_frd=1&verifier=IHW3ySz8T3iCu2dMAp8ClEPLnw7Fr5qw3Q0HcV76"}, "79064523": {"display_name": "Example_Matlab_File.pdf", "url": "https://umd.instructure.com/files/79064523/download?download_frd=1&verifier=iCZCnjz4Cfot0uQEbP5Cjw4Pa7Znu2PNZ0oOmmOC"}, "79135142": {"display_name": "Guide.pdf", "url": "https://umd.instructure.com/files/79135142/download?download_frd=1&verifier=3HDnIq2C5AaSuIpcJBMrWHePq83pWZ6WCxeNunNY"}, "79823732": {"display_name": "IMG_2544.jpeg", "url": "https://umd.instructure.com/files/79823732/download?download_frd=1&verifier=9e0jFF43q0PGv4bpqXy9HkwfCcOnFxoumn3Mmb59"}, "79228695": {"display_name": "MATLAB Project 1.pdf", "url": "https://umd.instructure.com/files/79228695/download?download_frd=1&verifier=C0X25leY1Raak0DpG2T7MPx7p6n6QG7UAjRhHhO7"}, "79228694": {"display_name": "MATLAB Project 2.pdf", "url": "https://umd.instructure.com/files/79228694/download?download_frd=1&verifier=wmXLsewdxlJ2DbZw7SFPQkXkj8oj816Q1YWUExvr"}, "79228696": {"display_name": "MATLAB Project 3.pdf", "url": "https://umd.instructure.com/files/79228696/download?download_frd=1&verifier=Qly8CEK53nGBHUilmHBkaT4gIESPOLVujtPg0fzx"}}}, "1374575": {"name": "MATH246-0211,0212,0221,0222,0231,0232,0241,0242: Differential Equations for Scientists and Engineers-Fall 2024 jiconway", "assignments": {"6941887": {"name": "Quiz 1", "due_at": null, "description": null}, "6941888": {"name": "Quiz 2", "due_at": null, "description": null}, "6941889": {"name": "Quiz 3", "due_at": null, "description": null}, "6941890": {"name": "Quiz 4", "due_at": null, "description": null}, "6941891": {"name": "Quiz 5", "due_at": null, "description": null}, "6941892": {"name": "Quiz 6", "due_at": null, "description": null}, "6941893": {"name": "Quiz 7", "due_at": null, "description": null}, "6941894": {"name": "Quiz 8", "due_at": null, "description": null}, "6941895": {"name": "Quiz 9", "due_at": null, "description": null}, "6941896": {"name": "Quiz 10", "due_at": null, "description": null}, "6941897": {"name": "Exam 1", "due_at": null, "description": null}, "6941898": {"name": "Exam 2", "due_at": null, "description": null}, "6941899": {"name": "Exam 3", "due_at": null, "description": null}, "6941901": {"name": "Matlab Project 1", "due_at": "2024-10-01T03:59:59Z", "description": null}, "6941902": {"name": "Matlab Project 2", "due_at": "2024-11-05T04:59:59Z", "description": null}, "6941904": {"name": "Matlab Project 3", "due_at": "2024-12-05T04:59:59Z", "description": null}, "6941905": {"name": "Final Exam", "due_at": null, "description": null}}, "files": {"79598481": {"display_name": "01 August 27 - 0, I.1, I.2.pdf", "url": "https://umd.instructure.com/files/79598481/download?download_frd=1&verifier=UJWSY9DtzOz54GjH5Humgdo5Ym9rQxxYHrXwnS9b"}, "79639955": {"display_name": "02 August 28 - I.2, I.3.pdf", "url": "https://umd.instructure.com/files/79639955/download?download_frd=1&verifier=URC9yX3TcFCvKA4d4cOuKmet8FNXlyg9vqlqc5hH"}, "79691403": {"display_name": "03 September 3 - I.4, I.5.pdf", "url": "https://umd.instructure.com/files/79691403/download?download_frd=1&verifier=tzmOzUsDyLRwaWia7TUd9xGCotqkZniQE8lT5Irg"}, "79735618": {"display_name": "04 September 5 - I.6.pdf", "url": "https://umd.instructure.com/files/79735618/download?download_frd=1&verifier=cdweiLu4s29TMA8wDveOAMHz7rEJoXJKESTv817g"}, "79821468": {"display_name": "05 September 10 - I.6, I.7.pdf", "url": "https://umd.instructure.com/files/79821468/download?download_frd=1&verifier=XhAolrxbFXMYcEApSfv9Wr83XEZe4RPclhBXefQF"}, "79867569": {"display_name": "06 September 12 - I.7, I.9.pdf", "url": "https://umd.instructure.com/files/79867569/download?download_frd=1&verifier=HciWG8iOqNfImBiStbOang3vHysoskZZE75jUmeP"}, "79721375": {"display_name": "246_Lecture2_Sep4.pdf", "url": "https://umd.instructure.com/files/79721375/download?download_frd=1&verifier=FrKmJgaSqMbcMlh9VsZYcUN4swxL99AeKZseYN96"}, "79354801": {"display_name": "Example_Matlab_File.m", "url": "https://umd.instructure.com/files/79354801/download?download_frd=1&verifier=tKhGyJQRTea6e8tyQmjKiyFLjBb94yQkCmQSNxe7"}, "79354800": {"display_name": "Example_Matlab_File.pdf", "url": "https://umd.instructure.com/files/79354800/download?download_frd=1&verifier=JEYOgaXbSo92eBWs3MjGY6eMsFxxJiM76H9oKBQZ"}, "79354797": {"display_name": "Matlab Project 1.pdf", "url": "https://umd.instructure.com/files/79354797/download?download_frd=1&verifier=3lwY1A7l24rrcZDpcvqONVqQtaEGaKzf6ZyOroXn"}, "79629913": {"display_name": "Matlab Project 2.pdf", "url": "https://umd.instructure.com/files/79629913/download?download_frd=1&verifier=yvNn6a7iCd5iCb16HXXWa7U1a87kE8CDNY21F9Do"}, "79645711": {"display_name": "Matlab Project 3.pdf", "url": "https://umd.instructure.com/files/79645711/download?download_frd=1&verifier=b68UksWBn1gZNght9BjDI4YuZ43KJFT105IFwU3Z"}}}, "1312443": {"name": "SGA Committee on Financial Affairs: Apply for SGA funding", "assignments": {"6466679": {"name": "SGA Funding: Knowledge Check", "due_at": null, "description": "Passing score for the SGA Funding Knowledge Check is a minimum of 90% correct (45 questions correct) . Quizzes can be taken an unlimited number of times, and please use all of the resources we've provided! We are not trying to trick you, we want you to learn the requirements of funding in order to make the process easier for everyone."}, "6940379": {"name": "SGA Funding: Final Knowledge Check ", "due_at": null, "description": null}}, "files": {"74020409": {"display_name": "Advertising and Decorations.mp4", "url": "https://umd.instructure.com/files/74020409/download?download_frd=1&verifier=aYJSwn6FcmLLlHYIE03mdk2828t0W4Yiz5l6rK4L"}, "74020410": {"display_name": "Advertising and Decorations.pptx", "url": "https://umd.instructure.com/files/74020410/download?download_frd=1&verifier=jmTiJgHrU6mFbHx2Vz4vqS9ZOXEoYLuL9f3yDqfa"}, "74229406": {"display_name": "Bad Sample Budget Application 2023-2024.pdf", "url": "https://umd.instructure.com/files/74229406/download?download_frd=1&verifier=26VE4zcXMp2Np4Qy9UltVMUUezQZV735WEyqaXSY"}, "74020407": {"display_name": "Contractual Services Presentation.pptx", "url": "https://umd.instructure.com/files/74020407/download?download_frd=1&verifier=re3O1mJQ5WAzstlGPKf2Y02A85LzzQpsZdR11TQs"}, "74020405": {"display_name": "Contractual Services.mp4", "url": "https://umd.instructure.com/files/74020405/download?download_frd=1&verifier=mHYrAPpcRZhW3im9vrdVCnMY0J7er5G63DIp1sTo"}, "74020404": {"display_name": "Dues and Fees.mp4", "url": "https://umd.instructure.com/files/74020404/download?download_frd=1&verifier=cuPTCtWLYOtKS6jDleVu0RwarKoth8TjgMkGi8k4"}, "74020406": {"display_name": "Dues and Fees.pptx", "url": "https://umd.instructure.com/files/74020406/download?download_frd=1&verifier=6OO4FzObE2M22GXR35cGMV5Q1gprR6qnEzMk0pCj"}, "74020402": {"display_name": "Equipment Rental_Repair.mp4", "url": "https://umd.instructure.com/files/74020402/download?download_frd=1&verifier=I4HX1DlwJJaQqPz4naEKXpFmSUvJiEnHNRanqe5I"}, "74020403": {"display_name": "Equipment Rental_Repair.pptx", "url": "https://umd.instructure.com/files/74020403/download?download_frd=1&verifier=8Das87KR9mDQI5TKnHOTePmIMUBBo0fpcZXD7MGQ"}, "74229405": {"display_name": "FAQ - SGA Finance (1) (1).pdf", "url": "https://umd.instructure.com/files/74229405/download?download_frd=1&verifier=OERZWVL4oQeRXF7GvcEngjbCmQS3tbEHq0Djvs3c"}, "79666555": {"display_name": "FY25 SGA Funding Presentation.pdf", "url": "https://umd.instructure.com/files/79666555/download?download_frd=1&verifier=i7opoBg7sQ7kL2bc7ozsbrWzdbpx9dlcakWQAu6y"}, "79666557": {"display_name": "FY25 SGA Funding Presentation.pptx", "url": "https://umd.instructure.com/files/79666557/download?download_frd=1&verifier=ccxjIuqfKOGtE4nDUjdgWBJepJfFaNusks005uGh"}, "74116389": {"display_name": "General Finance Video.mp4", "url": "https://umd.instructure.com/files/74116389/download?download_frd=1&verifier=bUwct2Mn688nmQycSetGZG5QDcm4EW1J2oVQ9aDH"}, "74116411": {"display_name": "General Guidelines Video.pptx", "url": "https://umd.instructure.com/files/74116411/download?download_frd=1&verifier=hh1DwYqp3SjbAPrFhq3EcHoSKDUFojo5HBsegecV"}, "74282182": {"display_name": "Good Sample Budget Application 2023-2024.docx.pdf", "url": "https://umd.instructure.com/files/74282182/download?download_frd=1&verifier=tftEKta94ZmnL5UG5Caq7aY04j0HOT5GkLuQiLuG"}, "74229410": {"display_name": "HOW TO FIND THE SGA FINANCE BUDGET APPLICATION.pdf", "url": "https://umd.instructure.com/files/74229410/download?download_frd=1&verifier=JZZIXozDQbVnPTiz26Y8LYJArP3QbuUKMTYBJIRR"}, "74282262": {"display_name": "Line Item Overview.pdf", "url": "https://umd.instructure.com/files/74282262/download?download_frd=1&verifier=PsmEE7SzkrPNEMj3kzm9sa3LtZDSQSSTuiPkfQa3"}, "79649812": {"display_name": "Manual_ SGA Funding Process .pdf", "url": "https://umd.instructure.com/files/79649812/download?download_frd=1&verifier=ZpD9DFw6MbeyEBj6og0YPWX66GZdzzwy4xcwiy5c"}, "74020398": {"display_name": "Miscellaneous Items.mp4", "url": "https://umd.instructure.com/files/74020398/download?download_frd=1&verifier=lDRBoU7MvC4W9zGcIAu2jA5e82WFcgIqMIOHAHSR"}, "74020401": {"display_name": "Miscellaneous Items.pptx", "url": "https://umd.instructure.com/files/74020401/download?download_frd=1&verifier=jnvs7hqKLxIkrr7wZuBjfaOsmIbg4DtUFZBO8TOQ"}, "63229868": {"display_name": "Policy on Disbursement of Student Activities Fee 1998.pdf", "url": "https://umd.instructure.com/files/63229868/download?download_frd=1&verifier=26MEx8xaKbJvkwr5txa9d7NKoHfULfRz7Ikje8DV"}, "74020396": {"display_name": "Printing, Copying, and Postage.mp4", "url": "https://umd.instructure.com/files/74020396/download?download_frd=1&verifier=prBVXxT9uQzIGIkFZlpn2PsKL3h2svoLmsVoposm"}, "74020397": {"display_name": "Printing, Copying, and Postage.pptx", "url": "https://umd.instructure.com/files/74020397/download?download_frd=1&verifier=1WfJ5PI4gdEaPgsX5AvwOZ3us4I51QM7Mcc1g7h9"}, "74229409": {"display_name": "Reasons for Not Getting Funded.pdf", "url": "https://umd.instructure.com/files/74229409/download?download_frd=1&verifier=OTige6rPBHcemsePsBsRAcbAWIP8xrwaXJJ73wGC"}, "74020394": {"display_name": "Room Space Rental.mp4", "url": "https://umd.instructure.com/files/74020394/download?download_frd=1&verifier=tPikkezRe7G8wTCyObVYHrmnZl3mga8vKkF9daEP"}, "74020395": {"display_name": "Room_Space Rental.pptx", "url": "https://umd.instructure.com/files/74020395/download?download_frd=1&verifier=rlRdInk0vmMmBGXCzVPLUZZ4Kb8rFTOwke5UwDbe"}, "74020393": {"display_name": "Sample Budget Application 2023-2024.pdf", "url": "https://umd.instructure.com/files/74020393/download?download_frd=1&verifier=e2JLvwgMtwZzZEi1UFphs2Z7k7gz4N8wXa9SzH7f"}, "63231265": {"display_name": "SGA Accountability and Ethics May 2019.pdf", "url": "https://umd.instructure.com/files/63231265/download?download_frd=1&verifier=YGZZ8TjiRDlQjwxAAY9ZCRwSX3cmJklCFpjEgIap"}, "74019833": {"display_name": "SGA Bylaws June 2022.pdf", "url": "https://umd.instructure.com/files/74019833/download?download_frd=1&verifier=U7u79MzQIXgRNCPZORg4Lyyhr8OzS23sLJnaaM1c"}, "63231279": {"display_name": "SGA Constitution April 2021.pdf", "url": "https://umd.instructure.com/files/63231279/download?download_frd=1&verifier=SekOKvg98yE8EYqsq0RnZIDJKF8An01FYRGzWaab"}, "74229407": {"display_name": "SGA Funding Process.pdf", "url": "https://umd.instructure.com/files/74229407/download?download_frd=1&verifier=10DI0qNJ53jGoZP7AXlnMWpmfg1mGfhx3gSXzUaX"}, "63231276": {"display_name": "SGA Structure.pdf", "url": "https://umd.instructure.com/files/63231276/download?download_frd=1&verifier=NOD2jbXQtzVQX41OHuecIVp7b77gTf26YbWKIXrj"}, "74020392": {"display_name": "SGA Travel and Vehicle Rental.mp4", "url": "https://umd.instructure.com/files/74020392/download?download_frd=1&verifier=nGk0CQxsdKjehSDS9N3t84vEAieN6Uc0RPFuoU3s"}, "74229403": {"display_name": "Tips for Success - SGA Finance.pdf", "url": "https://umd.instructure.com/files/74229403/download?download_frd=1&verifier=WoWGSuKL5C9NVbnufpYaYpgMzkAqXYwAzAprHbFn"}, "74020574": {"display_name": "Travel Presentation.pptx", "url": "https://umd.instructure.com/files/74020574/download?download_frd=1&verifier=zrGhNstII4RfqG671h1GpskSy9CiSmr5V0KfJHVy"}, "74282284": {"display_name": "Website Walkthrough.mp4", "url": "https://umd.instructure.com/files/74282284/download?download_frd=1&verifier=udGxa5q1seVUMnV0YD9eLE2Ijr9cAa2G7CXKQ7jl"}}}, "1354434": {"name": "Student Organization Resource Center", "assignments": {"6558340": {"name": "Test Your Knowledge: Quiz 1 (5 Mins)", "due_at": null, "description": null}, "6561823": {"name": "Test Your Knowledge: Quiz 2 (5 Mins)", "due_at": null, "description": null}}, "files": {}}, "1344161": {"name": "Undergraduate TerrapinSTRONG Onboarding 2023-24", "assignments": {"6251700": {"name": "Intro Reflection", "due_at": null, "description": "TerrapinSTRONG Reflection Take a minute to reflect on what TerrapinSTRONG means to you, then add your response to the question below. Answers to this question are anonymous. We may sometimes review answers in aggregate to better understand how participants engage with the onboarding, but individual responses are never reported. Progress: Module 1 of 5 Icon Progress Bar/Navigation (built in browser, hidden in app)"}, "6251702": {"name": "History Reflection", "due_at": null, "description": "History Reflection Based on your exploration of the History Gallery on the previous page, please respond to the following reflection questions and click Submit Quiz when you are done. Progress: Module 2 of 5 Icon Progress Bar/Navigation (built in browser, hidden in app)"}, "6251699": {"name": "Inclusion Reflection", "due_at": null, "description": "Inclusion Reflection You have just explored many ways the university takes action to advance diversity, equity, inclusion and social justice. You also learned about resources here to support members of our campus community when they do experience discrimination or injustice. Take a few moments to reflect with the following questions. Progress: Module 3 of 5 Icon Progress Bar/Navigation (built in browser, hidden in app)"}, "6251698": {"name": "Belonging Reflection", "due_at": null, "description": "Belonging Reflection Take a moment to reflect on the traditions and resources and identify those that are most important to your own sense of belonging to our community. Answers to this question are anonymous. We may sometimes review answers in aggregate to better understand how participants engage with the onboarding, but individual responses are never reported. Progress: Module 4 of 5 Icon Progress Bar/Navigation (built in browser, hidden in app)"}, "6251701": {"name": "Create your Action Plan", "due_at": null, "description": "Community. Connection. Inclusion. Create your Action Plan You are now a part of our community, striving alongside us to be TerrapinSTRONG. The Action Plan you are about to create is your opportunity to decide how you want to continue this TerrapinSTRONG journey. Use this Action Plan to commit yourselves to learning more about our community , building meaningful connections , and pursuing inclusion for a University of Maryland where everyone can reach their full potential. Directions: 1. Use the list provided below or click this link to create your own copy of the TerrapinSTRONG Action Plan in your Google Drive. 2. Check all the actions you are interested in taking to continue your TerrapinSTRONG journey. 3. Answer the questions on the next page to let us know what you are most excited about. Community Take the UMD African American History and Landmark Tour Take the UMD M-Book Challenge . Watch this Johnny Holliday interview with Darryl Hill , the first African-American football player in any of the southern athletic conferences 󠇀Learn about the Frog and Jim Henson 󠇀 Learn about the 1856 Project . Learn about Johnson-Whittle Hall and Pyon-Chen Hal l , the newest residence halls in the Heritage Community . Take a self-guided tour of campus landmarks. Take part in the Maryland Flash Mob by attending men’s basketball games. Join The Pride , the official student organization for fans of Maryland Athletics. Learn our Maryland Victory Song and Alma Mater to sing at a UMD sporting event. Find one of the 7 Testudo statues, rub his nose and post a picture with #terrapinstrong! Follow us on social media for history, traditions & more. #terrapinstrong @terrapinstrong Follow the University of Maryland on social media UnivofMaryland univofmaryland UMD2101 UofMaryland or umdrightnow univofmaryland Connection Build meaningful relationships with the people who will support your journey. Get involved in the Student Government Association . Apply for a role in the legislature, executive or judicial branch or join an Open Committee. Get involved in the Residence Hall Association , the student-run governing body for on-campus students. Join a student organization through Terplink or the First Look Fair. Join an intramural sports team, outdoor adventure or group fitness class with RecWell . Take part in Technica , the world’s largest all-women and nonbinary hackathon. Join TerraPeers and be matched with an upperclass student who wants to share their experience and knowledge with you. Connect with your faith community through campus Chaplains and student organizations . Get Involved with an affinity group via MICA , the Nyumburu Cultural Center , the Student Disability Affinity Space or the LGBTQ+ Equity Center Inclusion Find your own path within our shared commitment to diversity, equity, inclusion and social justice. Act Participate in the Common Ground Dialogue Program and join peer-led multicultural dialogues around current issues affecting our world. Join a student advocacy group and make a difference. Go to Terplink organizations and select the category “Activism/Advocacy/Awareness” to read about them all! Donate to the Campus Pantry , serving all members of the campus community in times of food insecurity. They accept funds and food, as well as items for the Campus Reuse Store . Participate in the Do Good Challenge by developing solutions for pressing social issues and competing for prize money to make your idea a reality. Participate in experiential and community-based learning to become a socially responsible leader through Leadership & Community Service Learning. Commit to taking small, impactful actions to help tackle the climate crisis with the UMD Green at Home Guide or get certified as a Green Terp , and get sustainable prizes. Register to vote and VOTE! Participate in an Alternative Break experience to put learning & justice into action. Join the Social Interaction Group Network for All (SIGNA) , offering specialized training and support for neurodivergent college students, as member, peer coach or mentor Apply for a Vital Signs: Creative Arts for Black Lives Mini-Grant for your art project affirming Black life and interrogating white supremacy. Volunteer for the University of Maryland SAFE Center for Human Trafficking Survivors . Learn Learn about bias resources in a Bias Incident Support Services Stop the Hate workshop. Get certified in Mental Health First Aid and learn how to recognize, intervene and get help for people with mental health challenges. Participate in a program with Multicultural Involvement Community Advocacy (MICA) . Read the First Year Book , attend the events and discuss it with your classmates. Attend a lecture from the Bahá’í Chair for World Peace . Participate in the College of Arts and Humanities Dean’s Colloquium Series on Race, Equity and Justice or the Antiracism: Communities + Collaborations series. Learn more about how pronouns support members of the trans community. Explore the LGBTQ+ Equity Center TransTerps resources . Sign up to receive the Office of Diversity and Inclusion newsletter and stay up-to-date about events, initiatives, and resources. Attend NewsBreak at the Nyumburu Cultural Center where students, staff and faculty learn about current events impacting the Black community. Join the Harriet Tubman Department of Women, Gender, and Sexuality Studies for a Social Justice Hangout. Learn more about diversity, equity and inclusion through the arts Attend an Arts Citizenship Talk (ACTnow), the NextNOW Fest, or other events such as the Blacklight summit at The Clarice Smith Performing Arts Center Visit the Stamp gallery and the Contemporary Art Collection to engage with contemporary art that addresses broad community and social issues Visit the David C. Driskell Center which is committed to preserving the rich heritage of African American visual art and culture Learn more about the Responsible Conduct of Research Collaborative (RCR-C) Learn more about the Social Justice Alliance , the collaboration between UMD and Bowie State University developed to honor 1st Lt. Richard W. Collins III. Take a class with one of the many cultural & ethnic studies programs in the College of Arts and Humanities (ARHU) to expand your understanding of DEI. Progress: Module 5 of 5 Icon Progress Bar/Navigation (built in browser, hidden in app)"}}, "files": {}}}}