{
    "name": "COMM107-9902,9909: Oral Communication: Principles and Practices-Spring 2024 taufiq",
    "assignments": {
        "6630593": {
            "name": "Informative Outline",
            "due_at": null,
            "points_possible": 30.0,
            "score": 30.0,
            "description": "Informative Outline (30 points) You will submit an outline for the Informative Presentation. You should organize your outline using a nested structure. You may consider following an organizational structure, as explained in your textbook (i.e., chronological/temporal, spatial/geographical, temporal, comparative advantage). Please be sure that your outline also includes the components of an introduction , body , and conclusion; as well as transitions, internal previews , and signposts . This outline will organize your entire presentation in full sentences. For more information, see Chapter 6: Presentation Preparation. Further Guidelines: Research: Your outline must include at least three (3) sources. These sources must support and reinforce the main ideas and claims made throughout the outline. They must come from credible sources, such as expert interviews, academic journals, and newspapers. All references to external sources must be attributed using complete and accurate in-text citations and be properly formatted at the end of the outline. For more information on citation resources see https://owl.purdue.edu/owl/research_and_citation/resources.html Introduction: Your introduction should gain the audience's attention, provide a clear thesis statement, establish practicality, and preview the main points of your presentation. The attention grabber must hook the audience and draw them into the presentation. The purpose/central idea/thesis statement should narrow the topic, and it should not be persuasive. For more information, see Chapter 6: Presentation Preparation and Chapter 8: Informative Presentations. Body: The body of your speech should have a structure that makes sense for the presentation (e.g., chronological, spatial, topical). It should be arranged logically to present concepts. It should have artfully-constructed transitions between ideas. Don't just say, \"second...\" but provide a segue from one point to another. There should be enough material in the body to make the presentation thorough, but not so much that it moves outside the time frame of a 3-4 minute presentation. For more information, see Chapter 6: Presentation Preparation. Conclusion: Your conclusion should restate the goal, review the main points, and complete the circular narrative. Explanatory strategies: The presentation outline should also note places where the speaker will use stories, analogies, examples, evidence, and other techniques to liven-up and better engage the audience For more information, see Chapter 8: Informative Presentations. Learning Outcome Demonstrate competency in planning, preparing, and presenting effective oral presentations."
        },
        "6630572": {
            "name": "Informative I Presentation",
            "due_at": null,
            "points_possible": 25.0,
            "score": 20.0,
            "description": "This assignment is the first part of a 2-part series of informative presentations: Informative Presentation I and Informative Presentation II. For the first informative presentation, y ou will prepare a 3-4 minute informative presentation about a topic of your choice. The purpose of your informative presentations is to inform, not persuade . In other words, you should strive to make your audience aware of an event, person, place, or thing ( speech of awareness) , demonstrate how to do something ( speech of demonstration) , or to increase understanding of a complex subject ( speech of explanation) . You should NOT discuss why your listeners should take a particular action. For more details about what makes a presentation informative, see Chapter 8: Informative Presentations. Your grade for this assignment will be determined by (1) meeting the presentation requirements and (2) providing quality feedback to your assigned peers. Presentation Requirements Time : 3-4 minutes. Presentation Aid : None. You will not use a visual aid for this presentation. Oral Citations : Three (For more details on credible sources and supporting materials, see Chapter 5: Information Literacy). Speaking Notes : To be determined by instructor. Learning Outcomes Demonstrate competency in planning, preparing, and presenting effective oral presentations. Use effective presentation techniques. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate an ability to listen carefully."
        },
        "6630582": {
            "name": "Informative II Presentation",
            "due_at": null,
            "points_possible": 75.0,
            "score": 72.0,
            "description": "Informative Presentation II (75 points) For this assignment, you will present an improved version of your first informative presentation. Y ou should incorporate the feedback you received from your instructor and peers on your first informative presentation. The purpose of your informative presentations is to inform, not persuade . In other words, you should strive to make your audience aware of an event, person, place, or thing ( speech of awareness) , demonstrate how to do something ( speech of demonstration) , or to increase understanding of a complex subject ( speech of explanation) . You should NOT discuss why your listeners should take a particular action. For more details about what makes a presentation informative, see Chapter 8: Informative Presentations. Presentation Requirements Time : 3-4 minutes. Presentation Aid : None. You will not use a visual aid for this presentation. Oral Citations : Three (For more details on credible sources and supporting materials, see Chapter 5: Information Literacy). Speaking Notes : To be determined by instructor. Learning Outcomes Demonstrate competency in planning, preparing, and presenting effective oral presentations. Use effective presentation techniques. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate an ability to listen carefully."
        },
        "6630598": {
            "name": "Informative Self-Reflection",
            "due_at": "2024-03-14T16:30:00Z",
            "points_possible": 20.0,
            "score": 20.0,
            "description": "Informative Self-Reflection (20 points) This assignment asks you to reflect on your performance during the Informative Presentation after watching the recording and getting your feedback. You will write a two-paragraph reflection: Paragraph I: Reflect on your presentation’s strengths and weaknesses after watching the recording. Paragraph II: Craft an action plan for improvement. Example: In paragraph one, you might state the following: \"I was reading from directly from my notes throughout the entire presentation.\" In paragraph two, you might provide a summary that states: \"My peer noticed that I did not have a clear conclusion for the presentation.\" Learning Outcomes Demonstrate an understanding of the role of oral communication in academic, social, civic, and professional endeavors. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate competency in planning, preparing, and presenting effective oral presentations."
        },
        "6630609": {
            "name": "Persuasive Outline",
            "due_at": "2024-04-08T03:59:59Z",
            "points_possible": 40.0,
            "score": 38.0,
            "description": "Persuasive Outline (40 points) You will submit an outline for the Persuasive Presentation. You should organize your outline using a nested structure and include full sentences. You may consider following an organizational structure, as explained in your textbook (i.e., comparative advantage, cause-effect problem-solution, Monroe's motivated sequence). Please be sure that your outline also includes the components of an introduction , body , and conclusion; as well as transitions, internal previews , and signposts . This outline will organize your entire presentation in full sentences. For more information, see Chapter 6: Presentation Preparation. Further guidelines: Research: Your outline must include seven (7) sources. These sources must support and reinforce the main ideas and claims made throughout the outline. They must come from credible sources, such as expert interviews, academic journals, and newspapers. All references to external sources must be attributed using complete and accurate in-text citations, must indicated in bold within the outline, and be properly formatted at the end of the outline. For more information on citation resources see the The Purdue OWL website Introduction: Your introduction should gain the audience's attention, provide a clear thesis statement, establish practicality, and preview the main points of your presentation. The attention grabber must hook the audience and draw them into the presentation. The purpose/central idea/thesis statement should narrow the topic. For more information, see Chapter 6: Presentation Preparation. Body: Your structure should make sense for the presentation. It should be arranged logically to present concepts. It should have artfully-constructed transitions between ideas. There should be enough material in the body to make the presentation thorough, but not so much that it moves outside the time frame of a 6-7 minute presentation. For more information, see Chapter 6: Presentation Preparation. Conclusion: Your conclusion should restate the goal, review the main points, and complete the circular narrative. Style: The outline should also note places where the speaker will use stories, analogies, examples, evidence, and other techniques to liven up and better engage us in the topic. For more information, see Chapter 11: Persuasive Speaking. Learning Outcome Demonstrate competency in planning, preparing, and presenting effective oral presentations."
        },
        "6630618": {
            "name": "Persuasive Presentation",
            "due_at": null,
            "points_possible": 175.0,
            "score": 170.0,
            "description": "Persuasive Presentation (175 points) In this presentation you will attempt to persuade your classmates to adopt/quit a behavior (e.g., meatless Mondays, composting, reusable water bottles) or address a policy (e.g., Purple Line construction, paying student-athletes, student fee allocation). Presentation Requirements Time : 6-7 minutes. Visual Aid : Required. See Chapter 9: Visual Communication. Oral Citations : Seven. For more details on credible sources and supporting materials, see Chapter 5: Information Literacy Speaking Notes : To be determined by instructor. Learning Outcomes Demonstrate competency in planning, preparing, and presenting effective oral presentations. Use effective presentation techniques including presentation graphics. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate an understanding of the role of oral communication in academic, social, and professional endeavors. Demonstrate an ability to listen carefully."
        },
        "6630627": {
            "name": "Persuasive Self-Reflection",
            "due_at": "2024-04-16T18:00:00Z",
            "points_possible": 20.0,
            "score": 20.0,
            "description": "Persuasive Self-Reflection (20 points) This assignment asks you to reflect on your how your performance changed/improved in your Persuasive Presentation. It also asks you to consider how you will develop a plan for improvement as we move into our Small Group Presentation. You will write a Two-paragraph reflection: the First will be small and the second will be the detailed paragraph while answering the questions. Paragraph I: Reflect on your presentation’s strengths and weaknesses of your Persuasive Presentation. Paragraph II: Looking forward to our Small Group Presentation, how can you continue to improve as a speaker? Craft a plan for improvement considering some or all of the following: (1) How will you select information and prepare it in a way that is interesting for your audience? (2) How will you improve your organization? (3) How will you continue to work on vocal delivery, eye contact, and body language? (4) What are some ways that you can continue to build a connection with your audience? (5) How you will you work on developing convincing arguments? (6) How will you work to incorporate emotional and logical appeals? Learning Outcomes Demonstrate an understanding of the role of oral communication in academic, social, civic, and professional endeavors. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate competency in planning, preparing, and presenting effective oral presentations."
        },
        "6630644": {
            "name": "Small Group Outline",
            "due_at": "2024-04-25T18:00:00Z",
            "points_possible": 50.0,
            "score": 47.0,
            "description": "Small Group Outline (50 Points) You will submit an outline for the Small Group Presentation. You should organize your outline using a nested structure and include full sentences. You may consider following an organizational structure, as explained in your textbook (i.e., problem-solution). Please be sure that your outline also includes the components of an introduction , body , and conclusion; as well as transitions, internal previews , and signposts . This outline will organize your entire presentation in full sentences. For more information, see Chapter 6: Presentation Preparation. Further guidelines: Research: Your outline must include ten (10) sources. These sources must support and reinforce the main ideas and claims made throughout the outline. They must come from credible sources, such as expert interviews, academic journals, and newspapers. All references to external sources must be attributed using complete and accurate in-text citations and be properly formatted at the end of the outline. For more information on citation resources see: https://owl.purdue.edu/owl/research_and_citation/resources.html Introduction: Your introduction should gain the audience's attention, provide a clear thesis statement, establish practicality, and preview the main points of your presentation. The attention grabber must hook the audience and draw them into the presentation. Body: Your structure should make sense for the presentation. It should be arranged logically to present concepts. It should have artfully-constructed transitions between ideas. There should be enough material in the body to make the presentation thorough, but not so much that it moves outside the time frame of a 13-15 minute presentation. For more information, see Chapter 6: Presentation Preparation. Conclusion: Your conclusion should restate the goal, review the main points, and complete the circular narrative. Style: The outline should also note places where the speaker will use stories, analogies, examples, evidence, and other techniques to liven up and better engage us in the topic. Learning Outcome Demonstrate competency in planning, preparing, and presenting effective oral presentations."
        },
        "6630653": {
            "name": "Small Group Presentation",
            "due_at": null,
            "points_possible": 150.0,
            "score": 147.0,
            "description": "Small Group Presentation (150 Points) This group presentation will ask you to work with a team of your classmates to identify a problem in your community (however you define the community) and to develop three solutions to this problem. The first part of your presentation should convince the audience that a problem exists; the latter half should emphasize different approaches to solving it. Presentation Requirements Time : 13-15 minutes Presentation Aid : Required. See Chapter 9: Visual Communication. Oral Citations : Ten. For more details on credible sources and supporting materials, see Chapter 5: Information Literacy. Speaking Notes : To be determined by instructor. Learning Outcomes Demonstrate competency in planning, preparing, and presenting effective oral presentations. Use effective presentation techniques including presentation graphics. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate an understanding of the role of oral communication in academic, social, and professional endeavors. Demonstrate an ability to listen carefully. Demonstrate skill in asking and in responding to questions."
        },
        "6630649": {
            "name": "Small Group Peer Evaluation",
            "due_at": "2024-05-07T20:00:00Z",
            "points_possible": 30.0,
            "score": 30.0,
            "description": "Small Group Peer Evaluation (30 points) You will evaluate the performance each of your group members on a 5-item rubric . Students’ grade for this assignment will be determined by the average of the scores given to them by their fellow group members. If you do not complete the Peer Evaluation, you will earn a zero for this assignment. Download this this small group evaluation rubric to complete for all group members and upload. This is not a group assignment so your group members will not see your responses."
        },
        "6630659": {
            "name": "Small Group Statement of Mutual Expectations",
            "due_at": null,
            "points_possible": 20.0,
            "score": 20.0,
            "description": "Small Group Statement of Mutual Expectations (20 points) Your group will fill out this form during Small Group Statement of Mutual Expectations Day. Upload one copy of your group's completed form here."
        },
        "6630566": {
            "name": "Informative I Peer Feedback Day",
            "due_at": null,
            "points_possible": 12.5,
            "score": 12.5,
            "description": "You will complete the Informative I Peer Feedback Day Activity as discussed in class."
        },
        "6630588": {
            "name": "Informative Instructor Feedback Day I & II",
            "due_at": null,
            "points_possible": 25.0,
            "score": 25.0,
            "description": "Instructor Feedback Conference You will complete a five-minute feedback conference with me via Zoom. We will discuss your Informative I presentation, and how to incorporate feedback, and I will answer any questions you may have about the Informative II Presentation. After this activity, you will have to upload/submit One paragraph in detail about the Instructor's feedback about your presentation One paragraph in detail about Peers' feedback about your presentation"
        },
        "6630577": {
            "name": "Informative II Peer Feedback Day",
            "due_at": "2024-03-12T21:00:00Z",
            "points_possible": 12.5,
            "score": 12.5,
            "description": "You will complete the Informative II Peer Feedback. The grading of your feedback will be based on two activities. First, you would write your feedback about three students and submit it here before March 12 Tuesday, before your class time. Second, You would share verbally this feedback with those students on Peer Feedback Day for Informative-II. Peer Feedback for Informative-II (9902).docx Peer Feedback for Informative-II (9909).docx"
        },
        "6630632": {
            "name": "Persuasive Visual Aid Peer Feedback Day",
            "due_at": "2024-04-08T03:59:59Z",
            "points_possible": 12.5,
            "score": 12.5,
            "description": "you will provide feedback to an individual or small group of peers for their visual aid using this checklist . You are not filling out this checklist but it should be used to guide your conversations. After providing and receiving feedback, complete this reflection in approximately one paragraph: What did you do well in terms of the visual aid? How will you improve your visual aid before the Persuasive Presentation?"
        },
        "6630613": {
            "name": "Persuasive Outline Peer Feedback Day",
            "due_at": null,
            "points_possible": 12.5,
            "score": 12.5,
            "description": "During class, you will be assigned a small group of peers for an outline feedback activity.  After providing and receiving feedback, complete this reflection in approximately one paragraph: What did you do well in terms of outlining? How will you improve your outline before the Persuasive Presentation?"
        },
        "6630636": {
            "name": "Question & Answer Feedback Day",
            "due_at": null,
            "points_possible": 12.5,
            "score": 12.5,
            "description": "This class will be specifically designed for Q&A. All the groups will meet with the instructor and discuss their questions about their group presentation."
        },
        "6630641": {
            "name": "Small Group Check-In With Instructor ",
            "due_at": null,
            "points_possible": 12.5,
            "score": 12.5,
            "description": "Your group will have a 15 minute check-in with me (adjust based on the number of groups you have) about your presentation. Your small group can choose to do the following with me: Practice your presentation Review visual aid with me Review the outline You should come to class during the following times. When you are not meeting with me your group should be practicing your presentation. Group 1: [insert time] Group 2: [insert time] Group 3: [insert time] Group 4: [insert time] Group 5: [insert time]"
        },
        "6630486": {
            "name": "Quiz 1",
            "due_at": "2024-02-19T22:00:00Z",
            "points_possible": 10.0,
            "score": 10.0,
            "description": "This Quiz will cover Chapter 2 and Chapter 8."
        },
        "6630503": {
            "name": "Quiz 2",
            "due_at": "2024-02-06T19:00:00Z",
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6630509": {
            "name": "Quiz 3",
            "due_at": "2024-02-13T19:00:00Z",
            "points_possible": 10.0,
            "score": 10.0,
            "description": "This Quiz is from Chapter-3"
        },
        "6630495": {
            "name": "Quiz 4",
            "due_at": "2024-02-13T19:00:00Z",
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6630478": {
            "name": "Quiz 5",
            "due_at": "2024-03-26T18:00:00Z",
            "points_possible": 10.0,
            "score": 10.0,
            "description": "This quiz is related to chapter- 10 \"The Persuasive Process\""
        },
        "6630464": {
            "name": "Quiz 6",
            "due_at": "2024-03-28T18:00:00Z",
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6630519": {
            "name": "Quiz 7",
            "due_at": "2024-04-02T18:00:00Z",
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6630527": {
            "name": "Quiz 8",
            "due_at": "2024-04-16T18:00:00Z",
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6630537": {
            "name": "Quiz 9",
            "due_at": "2024-04-23T18:00:00Z",
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6630470": {
            "name": "Quiz 10",
            "due_at": "2024-05-13T20:00:00Z",
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6630661": {
            "name": "Special Occasion Presentation",
            "due_at": "2024-05-15T16:30:00Z",
            "points_possible": 40.0,
            "score": 39.0,
            "description": "Special Occasion Presentation (40 points) One of the overarching goals of COMM107 is to provide the skills and knowledge necessary to engage in presentational speaking situations that you will encounter in your academic, professional, personal, and civic lives. Drawing on the course, this recorded final exam asks you to prepare and deliver a creative individual presentation that allows you to practice giving “everyday” presentations (e.g., wedding toasts, speeches of introductions, acceptance speeches). Specific assignment details will be discussed in class. Special occasion presentations are most effective when they are relatively brief, heartfelt, entertaining, and well-suited to the audience. Presentation Requirements Time : 2-3 minutes is considered best practice Presentation Aid : Not required or expected. Oral Citation : None. Speaking Notes : To be determined by instructor. Learning Outcomes Demonstrate competency in planning, preparing, and presenting effective oral presentations. Use effective presentation techniques including presentation graphics. Demonstrate effectiveness in using verbal and nonverbal language appropriate to the goal and the context of the communication. Demonstrate an understanding of the role of oral communication in academic, social, and professional endeavors."
        },
        "6630604": {
            "name": "Outside Communication Activity ",
            "due_at": "2024-05-10T03:59:59Z",
            "points_possible": 10.0,
            "score": 10.0,
            "description": "Outside Communication Activity (10 points) The Outside Communication Activity is designed to help you better understand the role of oral communication in academic, social, civic, and professional endeavors outside of our classroom. You will complete one hour of Outside Communication Activities throughout the semester. In this activity, you will choose from a combination of the following options: Participate in SONA research You can earn points by participating in communication research studies. Click on this link to access SONA opportunities online. These opportunities are on a first-come, first served basis. Visit the OCC to get help with your presentations. Attend an in-person or virtual event. Submission Information Below are examples of what your submission should look like after completing an activity. You should submit by the last day of classes in order to earn full credit for this assignment. I completed the SONA study [insert name] on [insert date] I completed an OCC appointment on [insert date] I attended [insert event name] on [insert date]. Your instructor will verify your OCC attendance, SONA participation, or event attendance (if applicable) on Reading Day. Your grade will be updated for this assignment shortly after Reading Day. Completion Examples Here are the different ways you can earn the OCA points: 1 hour of SONA research participation 1 OCC appointment 1 eligible event"
        },
        "6630558": {
            "name": "Assessment ",
            "due_at": "2024-05-10T03:59:59Z",
            "points_possible": 10.0,
            "score": 10.0,
            "description": "To understand your experience in COMM 107, the Oral Communication Program would like to know about how you define and understand civic engagement after taking COMM 107. This research study will include a short survey that will only take 15-30 minutes to complete, and your responses will be entirely anonymous. Your responses to this survey will NOT be connected to your name or any personally identifying information . Furthermore, your responses will not negatively or positively affect your grade, standing, or employability at UMD. If you choose not to complete the survey, you must complete an alternative assignment (Option 2) to earn credit for this assignment. This alternative assignment will also take approximately 15-30 minutes to complete, is no more difficult than completing the survey, and you will receive full credit for completion of this assignment. Option 1 (Participating in the Survey) The survey will take approximately 15-30 minutes to complete. Upon your completion of this survey, you will receive 10 points of course credit. Your responses will not be connected to your name or any personally identifying information, and your instructor will not be able to see your responses. To participate in this study you must be enrolled in COMM107 and be 17 years of age or older. Please take the survey here and leave this page open. Once you have finished the survey, you will be given a random number that you will need to enter into this ELMS assignment in order to receive credit. If you have questions about this research, you can contact: Lindsey B. Anderson, Ph.D. Associate Professor Co-Director of the Oral Communication Program lbander@umd.edu Option 2 (Alternative Assignment) To complete the alternative assignment please write a structured paragraph describing how, if at all, oral communication contributes to civic engagement. Please provide a definition of civic engagement and give a concrete example of how oral communication can facilitate/support civic engagement. To submit your paragraph, please click here (linked to Qualtrics survey) to access the anonymous submission survey. Once you have finished the survey, you will be given a random number that you will need to enter into this ELMS assignment in order to receive credit. Your instructor will not be able to see your response and you will not be graded on the quality or content of your response. You will receive 10 points for completing this assignment. Your submission to this survey will NOT be used as data for any research study. If you have any questions about the alternative assignment please contact: Lindsey B. Anderson, Ph.D. Associate Professor Co-Director of the Oral Communication Program lbander@umd.edu"
        },
        "6713787": {
            "name": "Activity Ch. 2 & 8",
            "due_at": null,
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6713788": {
            "name": "Activity Ch. 6",
            "due_at": null,
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6745213": {
            "name": "Activity Ch. 3 & 4",
            "due_at": null,
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6745214": {
            "name": "Activity Ch. 5",
            "due_at": null,
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6745215": {
            "name": "Activity Ch. 10",
            "due_at": null,
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6745216": {
            "name": "Activity Ch. 11",
            "due_at": null,
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6745217": {
            "name": "Activity Ch. 7",
            "due_at": null,
            "points_possible": 10.0,
            "score": 10.0,
            "description": null
        },
        "6784982": {
            "name": "Activity Ch. 9",
            "due_at": null,
            "points_possible": 10.0,
            "score": 8.0,
            "description": null
        },
        "6784983": {
            "name": "Activity Ch. 13",
            "due_at": null,
            "points_possible": 10.0,
            "score": 8.0,
            "description": null
        },
        "6784984": {
            "name": "Activity Ch. 12",
            "due_at": null,
            "points_possible": 10.0,
            "score": 9.0,
            "description": null
        }
    },
    "announcements": {
        "5379915": {
            "title": "Grades Submission for COMM-107",
            "message": "Dear All, I have completed all the grading for the COMM-107 course. I will be submitting the final grades tonight. You can check your grades on ELMS. If you have any questions or concerns, please don't hesitate to reach out to me via email. Thank you for your hard work and participation throughout the course. Taufiq",
            "posted_at": "2024-05-21T12:15:04Z"
        },
        "5376079": {
            "title": "Reminder- Final Exam Timing ",
            "message": "Dear All, Please keep in mind the timing for the final exam of COMM107. The uploading window at ELMS will open as per the given time for the final exam. Section Class Timing Exam Day Exam Timing 9902 12:30 p.m. - 1:45 p.m. Thursday, May 16 1:30 p.m. - 3:30 p.m. 9909 2 p.m. - 3:15 p.m. Wednesday, May 15 10:30 a.m. - 12:30 p.m. Get the detail here; https://registrar.umd.edu/registration/register-classes/final-exams/spring-2024",
            "posted_at": "2024-05-15T14:20:28Z"
        },
        "5371289": {
            "title": "Final Class Session ",
            "message": "Dear All, Welcome to our final class session! Here's a quick overview of what we'll be doing today: Course Wrap-Up : We'll reflect on the journey we've taken together in this course, reviewing what we've covered and celebrating your progress and growth. Special Occasion Presentations Practice : Get ready to practice your special occasion presentations, a creative and fun way to conclude our course! Quiz 10 : We'll be discussing the final quiz Submissions : You can discuss any outstanding assignments or materials for final review. Let's finish strong and have a great class!",
            "posted_at": "2024-05-09T13:56:09Z"
        },
        "5368741": {
            "title": "Discussion in Today's class ",
            "message": "Dear All, In today's class, we will discuss, Chapter 12, Virtual Presentation, Details of \"Special Occasion Presentation\" Questions about \"Outside of Communication Activity\"",
            "posted_at": "2024-05-07T15:51:58Z"
        },
        "5363724": {
            "title": "Today's Small Group Presentations ",
            "message": "Dear All, Here is the sequence of today's presentation. You can paste the link of your presentation or attach the PPT. Group Members Presentation Sequence Akash, Nishkal, Shasshank First Jen, Molly, Katherine Second Belen, Lexi, Michael Third Daphne, Sabrina, Kenzie, Naina Fourth Dahong, Elliot, Ella Fifth Amaro, Eyoha, Alex Sixth",
            "posted_at": "2024-05-02T13:37:27Z"
        },
        "5348299": {
            "title": "Small Group Presentation Topics and Groups -9909",
            "message": "Please open the document and add the name of your group, members and topic https://docs.google.com/document/d/1pN2WjXQgtHhttpfVFOip3d0y4SyBPITeuPdnZalGDoc/edit?usp=sharing",
            "posted_at": "2024-04-16T16:15:34Z"
        },
        "5342594": {
            "title": "Persuasive Presentations -9909",
            "message": "https://drive.google.com/drive/folders/1uINOnntTjztJEUWNBhYh1LJsHbuOpiSi?usp=sharing",
            "posted_at": "2024-04-09T17:57:56Z"
        },
        "5338961": {
            "title": "Schedule for Persuasive Presentations ",
            "message": "Dear All, I have attached here the schedule of Persuasive Presentations for next week, April 09, and  April 11. Schedule for Persuasive Presentations (9909).docx Let me know, if you have any questions Taufiq",
            "posted_at": "2024-04-04T18:38:48Z"
        },
        "5336299": {
            "title": " Tuesday, April 4th, the Main Activity ",
            "message": "Dear all, In our upcoming class on Tuesday, April 4th, the main activity will revolve around \"Persuasive Outline Peer Feedback.\" During the first half of the session, students will engage in discussions and refine their Persuasive Outlines, receiving valuable feedback from their peers. While I'm extending the deadline for submission, we must utilize this time to discuss and finalize our outlines effectively. In the latter half of the class, students will have the opportunity to develop a draft of their PowerPoint presentations for their presentations. These are graded activities and attendance for these activities is mandatory. Looking forward to our productive session together. Taufiq",
            "posted_at": "2024-04-02T19:14:01Z"
        },
        "5330292": {
            "title": "Add the topic of Persuasive Presentation ",
            "message": "Dear All, Please open the following document and add your topic for the Persuasive Presentation. https://docs.google.com/document/d/1sHqEXw2-cFLZZazHZIZMScb4QIlwX9q5mrZy40YaxMg/edit?usp=sharing",
            "posted_at": "2024-03-27T16:23:27Z"
        },
        "5322021": {
            "title": "Informative II Peer Feedback Day (9909) at Zoom",
            "message": "Dear Students Join Zoom Meeting while using this link OR go to the Zoom menu at ELMS and directly join from there as well. https://umd.zoom.us/j/95538851656 Meeting ID: 955 3885 1656 You can find more details here below about the list of the students who are part of your group. Peer Feedback for Informative-II (9909)-1.docx",
            "posted_at": "2024-03-12T15:29:55Z"
        },
        "5312391": {
            "title": "Feedback Activities and Schedule for Informative-II",
            "message": "Dear All, It was great interacting with you all during Instructor feedback days. Please add two small paragraphs (one related to peer feedback and the other is instructor feedback) on what you learned through these feedback activities and submit them at ELMS  in the assignments under Informative Instructor Feedback Day I & II. Please be ready for next week's presentations and we have the same schedule for the Informative-II, which was for Informative-I. Feel free to ask me, if you have any questions Taufiq",
            "posted_at": "2024-02-29T20:08:40Z"
        },
        "5312083": {
            "title": "Zoom link for today's Meeting (9909) ",
            "message": "Dear Students Join Zoom Meeting while using this link OR go to the Zoom menu and directly join from there as well. https://umd.zoom.us/j/7898427840?omn=93865531888 Meeting ID: 789 842 7840 Join the meeting at your turn OR the mentioned time in the attached file (already shared) You can find more details here below about the list of the students who will attend today's meeting Schedule for Instructor feedback Day-I (9909)-1.pdf",
            "posted_at": "2024-02-29T17:23:24Z"
        },
        "5309744": {
            "title": "Zoom link for today's Meeting (9909) ",
            "message": "Dear All, Join Zoom Meeting through this link. https://umd.zoom.us/j/7898427840?omn=98809257311 Meeting ID: 789 842 7840 Join the meeting at your turn OR the mentioned time in the attached file (already shared) You can find more details here below about the list of the students who will attend today's meeting Schedule for Instructor feedback Meeting (9909).pdf",
            "posted_at": "2024-02-27T16:41:10Z"
        },
        "5305716": {
            "title": "Schedule for Instructor Feedback Day (9909)",
            "message": "Schedule for Instructor feedback Day-I (9909).pdf",
            "posted_at": "2024-02-22T19:40:16Z"
        },
        "5305644": {
            "title": "Peer Feedback Informative-I",
            "message": "Peer feedback for Informative-I (9909).pdf https://jamboard.google.com/d/1CXsDCJ8dWEk1lztcy48hHVmEWifiq1FSvLsuad6KPnA/edit?usp=sharing",
            "posted_at": "2024-02-22T18:53:11Z"
        },
        "5297663": {
            "title": "Informative presentation Schedule ",
            "message": "Dear All, I have attached the Informative Presentation schedule here. You can find the details in the document regarding your presentation. Schedule for Informative-I (9909).pdf",
            "posted_at": "2024-02-14T04:59:32Z"
        },
        "5292951": {
            "title": "Quiz 3 & 4",
            "message": "Dear Students, Quiz-4 is now available for all of you. Furthermore, Quiz-3 has been reopened for students who were unable to participate initially. Feel free to take part in both quizzes Taufiq",
            "posted_at": "2024-02-09T00:42:33Z"
        },
        "5292350": {
            "title": "Sample Informative Outline ",
            "message": "Dear Students, Here you can find an example of an Informative Outline that can be helpful for your work. Example of Info Outline.pdf Taufiq",
            "posted_at": "2024-02-08T18:36:16Z"
        },
        "5288667": {
            "title": "Final Informative Topics ",
            "message": "Dear All, Please share the final topic of your informative speech.",
            "posted_at": "2024-02-06T18:59:23Z"
        },
        "5284419": {
            "title": "Informative Topics",
            "message": "https://jamboard.google.com/d/1tLd_IvMDbXeY7UzBrEEXuEDgLdX42vFhkXVQ05b0Xi8/edit?usp=sharing",
            "posted_at": "2024-02-01T19:35:09Z"
        },
        "5281740": {
            "title": "Personal Report of Public Speaking Anxiety (PRPSA)",
            "message": "https://speakmeister.com/public-speaking-anxiety-test",
            "posted_at": "2024-01-30T17:55:36Z"
        },
        "5276036": {
            "title": "Welcome Note",
            "message": "Hello everyone, Welcome to the first class of COMM107. Today this first class will be introductory, focusing on the syllabus, assignments, instructor, and fellow students. I've uploaded the syllabus at ELMS, so please review it, and we'll delve into a detailed discussion during the class. Excited to meet you all soon. Best, Taufiq",
            "posted_at": "2024-01-25T16:14:16Z"
        }
    },
    "files": {
        "76468589": {
            "display_name": "02 - Column.jpg",
            "url": "https://umd.instructure.com/files/76468589/download?download_frd=1&verifier=VuHwdPwrAITpdeMLJNQz8nydy5wZHZT3E4ysCssh"
        },
        "76468582": {
            "display_name": "04 - Bleachers.jpg",
            "url": "https://umd.instructure.com/files/76468582/download?download_frd=1&verifier=g2cxHHQC0yGGQV7PHpQQ66xhSAZmsmsq6F5HRysL"
        },
        "76468586": {
            "display_name": "05 - McKeldin.jpg",
            "url": "https://umd.instructure.com/files/76468586/download?download_frd=1&verifier=ahwDpjKpUa5Ow2vjVLOXmglYcq92xOTTpGRL8W0x"
        },
        "76468576": {
            "display_name": "07 - Gate.jpg",
            "url": "https://umd.instructure.com/files/76468576/download?download_frd=1&verifier=2MzP6GuTZkpsU7kDPoGOyBKPNcKQUxUdWJ6SxKPB"
        },
        "76468602": {
            "display_name": "09 - Aerial Big M.jpg",
            "url": "https://umd.instructure.com/files/76468602/download?download_frd=1&verifier=j30hoEqYT3x9Lt75Iwu42O64y7Pcw06GizJ5P6Fd"
        },
        "76468575": {
            "display_name": "10 - Sundial.jpg",
            "url": "https://umd.instructure.com/files/76468575/download?download_frd=1&verifier=t62W5nIB15TljHIZTDq70R3cXAoaLZb6GyhlFlM8"
        },
        "76468597": {
            "display_name": "16 - Students McKeldin Front.jpg",
            "url": "https://umd.instructure.com/files/76468597/download?download_frd=1&verifier=9I0ECKDNDwvoRJKutMp788dS6wncTsbKDQkBbOcH"
        },
        "76468573": {
            "display_name": "18 - Crowd Flag.jpg",
            "url": "https://umd.instructure.com/files/76468573/download?download_frd=1&verifier=a2rSjRKxadtxLCiUCy6NXpCbI0T6g35ad2tyyj6s"
        },
        "76468580": {
            "display_name": "21 - Finance.jpg",
            "url": "https://umd.instructure.com/files/76468580/download?download_frd=1&verifier=g4Tj8PJLUIpT1RNzxMK7Vk3gwYGlg6er9WEuEgNG"
        },
        "76468584": {
            "display_name": "22 - Group Work.jpg",
            "url": "https://umd.instructure.com/files/76468584/download?download_frd=1&verifier=B0BbkHagr74hBlfZBrVA0sFaB2dRHAiH7dNfaKB8"
        },
        "76468599": {
            "display_name": "23 - Long Exposure Campus.jpg",
            "url": "https://umd.instructure.com/files/76468599/download?download_frd=1&verifier=vU9yIv79revBLfOXkF0aIypbufg96mhHdWcHCvy0"
        },
        "76468592": {
            "display_name": "26 - Reflection.jpg",
            "url": "https://umd.instructure.com/files/76468592/download?download_frd=1&verifier=HpLK5oZZYQMeTCwG5Xo2cQ2Ksd0w2NOwc20tfm8Y"
        },
        "76468614": {
            "display_name": "Assessment Techniques.pdf",
            "url": "https://umd.instructure.com/files/76468614/download?download_frd=1&verifier=7CxM0iGANr92H1cC8Nr0sdXbpFee1dEt0mN8OIpZ"
        },
        "76468618": {
            "display_name": "COMM107 Small Group Peer Evaluation.docx",
            "url": "https://umd.instructure.com/files/76468618/download?download_frd=1&verifier=NfdgTcuB6wv79LeWjoOOo0XgiDg1u4Aoqr2cTN6d"
        },
        "76468621": {
            "display_name": "COMM107 Small Group Statement of Mutual Expectations.docx",
            "url": "https://umd.instructure.com/files/76468621/download?download_frd=1&verifier=so6vSPiJHpkCsG1sYMd6SHczNJevHoejSGeZ7ekB"
        },
        "76958764": {
            "display_name": "Example of Info Outline.pdf",
            "url": "https://umd.instructure.com/files/76958764/download?download_frd=1&verifier=E3fNmKAN6aPANNv9hSPq4ZTrDEZG2i02DyvT6y13"
        },
        "76468611": {
            "display_name": "Learning Outcomes & Bloom's Taxonomy.pdf",
            "url": "https://umd.instructure.com/files/76468611/download?download_frd=1&verifier=IkFcx6RlvSwJ54ILiPhcq0mMONUt6XOjBSbj6RUC"
        },
        "77631597": {
            "display_name": "Peer Feedback for Informative-II (9902).docx",
            "url": "https://umd.instructure.com/files/77631597/download?download_frd=1&verifier=1fqiFzwkBfSjMvpmRFborzkaoU6jBvQWzPGzrzGL"
        },
        "77631596": {
            "display_name": "Peer Feedback for Informative-II (9909).docx",
            "url": "https://umd.instructure.com/files/77631596/download?download_frd=1&verifier=DXJdFSTRgBSTmyZ4HyzChG8OBym98egiqxOphfzZ"
        },
        "77152880": {
            "display_name": "Peer Feedback Performa (Informative-I).docx",
            "url": "https://umd.instructure.com/files/77152880/download?download_frd=1&verifier=SIePio1M8cQR5IerAe3gFcnKilQXdGpdzm65HSup"
        },
        "77152865": {
            "display_name": "Schedule for Informative-I (9909).pdf",
            "url": "https://umd.instructure.com/files/77152865/download?download_frd=1&verifier=eYtsBs4LQ737bDf9BjR96Jh9x1OeooAhO4vDIxMn"
        },
        "77315187": {
            "display_name": "Schedule for Instructor feedback Day-I (9909).pdf",
            "url": "https://umd.instructure.com/files/77315187/download?download_frd=1&verifier=ndJWG6WwgNlpNUk7Z49H7VSCO1B2nrDZiIY0ZkAH"
        },
        "77315840": {
            "display_name": "SCHEDULE for Instructor Feedback(9902).docx",
            "url": "https://umd.instructure.com/files/77315840/download?download_frd=1&verifier=E06MB0Iile75oUojSpOlVx17VK2miyWfKepvt9UZ"
        },
        "77152862": {
            "display_name": "SCHEDULE INFORMATIVE PRESENTATIONS (9902).pdf",
            "url": "https://umd.instructure.com/files/77152862/download?download_frd=1&verifier=z4lyN5GE6R83Q1fIuryakIEvoTOkTJw5NgU3EN3h"
        },
        "76468594": {
            "display_name": "Shoemaker_Banner.jpg",
            "url": "https://umd.instructure.com/files/76468594/download?download_frd=1&verifier=mmJuRStzb4ipOf4F4Gb5fOr0YJ9wukZcqbnqWXUy"
        },
        "76468607": {
            "display_name": "VitalSource_Instructions-UMD-Presentations.pdf",
            "url": "https://umd.instructure.com/files/76468607/download?download_frd=1&verifier=KWh0ilgumZKqNNqaX6Ni10pUEOzy4otG9O0DegCW"
        }
    }
}